[
  {
    "id": "pandoro_tiramisu",
    "title": "Pandoro Tiramisu",
    "prep_time": "15 mins",
    "cook_time": null,
    "total_time": "Overnight",
    "image": "assets/images/categories/dessert/pandoro_tiramisu.jpg",
    "ingredients": [
      "5 Egg yolks",
      "150g Sugar",
      "700g Mascarpone",
      "3 Egg whites",
      "400ml Strong black coffee",
      "2 tbsp Marsala wine",
      "600g Pandoro cake",
      "Cocoa powder for dusting"
    ],
    "steps": [
      "Brew about 400ml of strong black coffee and let it cool completely. Stir in the Marsala wine and set aside. You can brew the coffee in advance so it is cold when you start assembling.",
      "Separate the 5 eggs into yolks and whites, placing them in two clean bowls. Make sure no yolk gets into the whites or they will not whip properly.",
      "Add 150g sugar to the bowl with the egg yolks. Using an electric mixer on medium speed, beat for 3–5 minutes until the mixture becomes pale, thicker, and forms ribbons when lifted.",
      "Add the mascarpone (700g) to the yolk mixture in 2–3 additions, beating on low speed just until smooth and creamy after each addition. Do not overbeat or the mascarpone may split.",
      "In a separate clean bowl, whisk the 3 egg whites with an electric mixer on medium–high speed until soft peaks form (when you lift the beaters, the tips of the foam gently bend over). This will take about 3–5 minutes. Do not whip until dry.",
      "Fold the whipped egg whites into the mascarpone mixture in three additions. Use a spatula to gently fold from the bottom up, turning the bowl as you go, until no streaks of egg white remain. The cream should be light and airy.",
      "Slice the pandoro into slices about 1.5–2cm thick. Trim off any very dark or tough crust if needed so the slices arrange neatly.",
      "Prepare your serving dish (a glass dish or cake tin). Quickly dip each slice of pandoro into the coffee–Marsala mixture, 1–2 seconds per side, just enough to moisten without soaking. Arrange the dipped slices in a single even layer to cover the base of the dish.",
      "Spread a generous layer of mascarpone cream (about 1–2cm thick) over the pandoro. Repeat the layers, alternating soaked pandoro and cream, until all the components are used, finishing with a layer of cream on top. Smooth the surface with a spatula.",
      "Cover the dish tightly with plastic wrap and refrigerate for at least 8 hours or overnight so the dessert sets and the flavors meld. Just before serving, dust the top generously with cocoa powder through a fine sieve, then slice and serve."
    ]
  },
  {
    "id": "choc_hazelnut_fudge_brownie_cake",
    "title": "Choc-Hazelnut Fudge Brownie Cake",
    "prep_time": "20 mins",
    "cook_time": "35 mins",
    "total_time": "55 mins",
    "image": "assets/images/categories/dessert/choc_hazelnut_fudge_brownie_cake.jpg",
    "ingredients": [
      "110g Roasted hazelnuts",
      "185g Salted butter",
      "300g Dark chocolate",
      "220g Brown sugar",
      "110g White sugar",
      "25g Cocoa powder",
      "4 Eggs",
      "200g All-purpose flour",
      "1/3 cup Nutella"
    ],
    "steps": [
      "Preheat the oven to 180°C (350°F) with top and bottom heat. Line a 20×20cm square baking tin with baking paper and lightly grease the sides.",
      "Spread the hazelnuts on a baking tray in a single layer and roast in the hot oven for 8–10 minutes until fragrant and lightly golden. Let cool, then roughly chop them, reserving a small handful for sprinkling on top of the brownie.",
      "Place the salted butter (185g) and dark chocolate (300g), chopped into small pieces, in a heatproof bowl. Set the bowl over a pot of gently simmering water (double boiler), stirring occasionally until the butter and chocolate melt and become smooth. Remove from the heat and let cool slightly for 5–10 minutes.",
      "In a large mixing bowl, whisk together the 4 eggs, brown sugar (220g), and white sugar (110g) using a whisk or electric mixer on medium speed. Beat for 3–5 minutes until the mixture looks paler and slightly thickened.",
      "Slowly pour the warm but not hot chocolate mixture into the egg and sugar mixture, whisking on low speed as you pour until fully combined.",
      "Sift the all-purpose flour (200g) and cocoa powder (25g) into the bowl. Using a spatula, gently fold the dry ingredients into the batter until no dry streaks remain. Avoid overmixing so the brownie stays fudgy.",
      "Fold most of the chopped hazelnuts into the batter, keeping some aside for topping. Pour the batter into the prepared tin and smooth the surface. Spoon small dollops of Nutella over the top and use a knife to swirl it into the batter. Sprinkle the reserved hazelnuts evenly over the surface.",
      "Bake for 30–35 minutes, or until the top is shiny with a thin crust and the centre is still slightly soft. A toothpick inserted in the centre should come out with moist crumbs rather than clean.",
      "Remove the tin from the oven and let the brownie cool completely in the tin on a wire rack for at least 1 hour so it sets before slicing. Dust with extra cocoa powder if desired and cut into squares to serve."
    ]
  },
  {
    "id": "brown_butter_brown_sugar_cheesecake",
    "title": "Brown Butter & Brown Sugar Cheesecake",
    "prep_time": "1 day ahead",
    "cook_time": "1 hr",
    "total_time": "Overnight",
    "image": "assets/images/categories/dessert/brown_butter_brown_sugar_cheesecake.jpg",
    "ingredients": [
      "100g Unsalted butter (for biscuit base)",
      "65g Unsalted butter (for browning)",
      "500g Crushed biscuits",
      "1kg Cream cheese, at room temperature",
      "300g Brown sugar",
      "5 Eggs",
      "3 Egg yolks",
      "125ml Whipping cream"
    ],
    "steps": [
      "Line the base of a 23cm springform tin with baking paper and lightly grease the sides. If you plan to bake the cheesecake in a water bath, wrap the outside of the tin tightly with foil to prevent leaks.",
      "Make the biscuit base: Melt 100g unsalted butter in a small saucepan over low heat. In a bowl, combine the melted butter with the 500g crushed biscuits and mix until the crumbs are evenly moistened and resemble damp sand.",
      "Tip the biscuit mixture into the prepared tin and press firmly over the base with the back of a spoon or the bottom of a glass to make an even, compact layer. Bake the base at 170°C for 8–10 minutes until fragrant, then remove from the oven and allow to cool to room temperature.",
      "Make the brown butter: Place 65g unsalted butter in a small saucepan over medium–low heat. Cook, stirring frequently, until the butter melts, foams, and the milk solids at the bottom turn golden brown and smell nutty, about 4–5 minutes. Immediately pour into a heatproof bowl to stop the cooking and let cool to room temperature.",
      "Preheat the oven to 150–160°C. Prepare a large roasting pan or deep baking tray that the springform tin can sit in if using a water bath.",
      "For the filling, place the cream cheese (1kg, at room temperature) in a large mixing bowl. Beat with an electric mixer on low–medium speed for 2–3 minutes until smooth and free of lumps. Add the brown sugar (300g) and beat for another 2–3 minutes until fully combined and creamy, scraping down the sides of the bowl as needed.",
      "Add the 5 eggs and 3 egg yolks one at a time, beating on low speed just until each addition is incorporated before adding the next. Do not overbeat; too much air can cause the cheesecake to crack.",
      "Pour in the whipping cream (125ml) and the cooled brown butter. Beat on low speed until the mixture is smooth and evenly combined, then tap the bowl gently on the counter a few times to release air bubbles.",
      "Pour the cheesecake filling over the cooled biscuit base and smooth the top. Place the springform tin in the roasting pan and pour hot water into the pan to come halfway up the sides of the tin to create a water bath.",
      "Bake for about 1 hour, or until the edges are set and the centre still has a slight wobble when gently shaken. Turn off the oven, prop the door open slightly, and leave the cheesecake inside for about 1 hour to cool gradually.",
      "Remove the tin from the water bath and place on a wire rack to cool to room temperature (1–2 hours). Then refrigerate, still in the tin, for at least 6 hours or overnight until fully set. Before serving, run a thin knife around the edge, release the springform ring, and slice to serve."
    ]
  },
  {
    "id": "lemon_finger_lime_tart",
    "title": "Lemon & Finger Lime Tart",
    "prep_time": "At least 7 hrs",
    "cook_time": "20–30 mins",
    "total_time": "Approx 7 hrs 30 mins",
    "image": "assets/images/categories/dessert/lemon_finger_lime_tart.jpg",
    "ingredients": [
      "250g All-purpose flour",
      "85g Icing sugar",
      "125g Unsalted butter, cold and diced",
      "2 Egg yolks",
      "300ml Whipping cream",
      "250g Mascarpone",
      "200ml Lemon juice",
      "80g Sugar (for lemon filling)",
      "4 Finger limes"
    ],
    "steps": [
      "Make the tart dough: In a mixing bowl, combine the flour (250g) and icing sugar (85g). Add the cold diced butter (125g) and rub it into the flour with your fingertips until the mixture resembles coarse crumbs. Work quickly so the butter stays cold.",
      "Add the 2 egg yolks and mix with a fork until the dough starts to come together. Use your hands to gently press it into a ball (if the mixture is very dry, you can sprinkle in 1 tbsp of cold water at a time). Flatten into a disc about 2–3cm thick, wrap in plastic wrap, and chill in the fridge for at least 1 hour.",
      "Take the dough out of the fridge and let it sit at room temperature for 5–10 minutes to soften slightly. Lightly flour the work surface and roll the dough out to about 3mm thickness, large enough to line your tart tin.",
      "Carefully transfer the rolled dough to the tart tin, pressing it into the base and up the sides. Trim any excess dough and prick the base all over with a fork to prevent puffing. Chill the lined tin for another 30 minutes to firm up the dough.",
      "Preheat the oven to 180°C. Line the chilled tart shell with baking paper and fill with baking weights or dried beans to blind-bake.",
      "Bake the tart shell for 15–20 minutes, then remove the paper and weights and bake for a further 5–10 minutes until the base and edges are light golden and crisp. Remove from the oven and allow the shell to cool completely in the tin (about 30–60 minutes).",
      "While the tart shell cools, make the lemon filling: Place the whipping cream (300ml) and mascarpone (250g) in a bowl. Beat with an electric mixer on medium speed for 3–4 minutes until smooth and slightly thickened.",
      "Gradually add the lemon juice (200ml) and sugar (80g), beating on low speed so the mixture stays smooth. Continue mixing until the sugar dissolves and the filling tastes pleasantly tangy and sweet. If the mixture seems too loose, chill it briefly to firm up slightly before filling the tart shell.",
      "Pour the lemon filling into the cooled tart shell and smooth the surface. Refrigerate for at least 4 hours, or until the filling is set enough to slice cleanly.",
      "Just before serving, halve the finger limes and gently squeeze out the caviar-like pearls. Spoon the finger lime pearls over the tart and add extra mascarpone in small dollops or piped rosettes if you like. Remove the tart from the tin and slice to serve."
    ]
  },
  {
    "id": "cheats_mille_feuille",
    "title": "Cheat's Mille-Feuille",
    "prep_time": "30 mins",
    "cook_time": "20 mins",
    "total_time": "50 mins",
    "image": "assets/images/categories/dessert/cheats_mille_feuille.jpg",
    "ingredients": [
      "375g Puff pastry",
      "Icing sugar, for dusting and crisping",
      "300ml Whipping cream",
      "200g Vanilla custard",
      "Mixed berries of your choice (such as strawberries, blueberries, raspberries)"
    ],
    "steps": [
      "Preheat the oven to 200°C and line a baking tray with baking paper.",
      "Unroll or roll out the puff pastry (375g) on a lightly floured surface. Cut into equal rectangles or squares, for example about 4×10cm, to form the layers of the mille-feuille.",
      "Transfer the pastry pieces to the prepared tray. Prick them all over with a fork to help prevent excessive puffing, then dust lightly with icing sugar to promote a crisp, lightly caramelised surface.",
      "Place another sheet of baking paper over the pastry and set a second baking tray on top as a weight so the pastry bakes flat. Bake for about 15–20 minutes until the pastry is cooked through and golden. Remove the top tray and paper and bake for a further 2–3 minutes if you want them extra crisp. Allow the pastry to cool completely on a wire rack.",
      "While the pastry bakes, make the cream filling. Whip the cold whipping cream (300ml) with an electric mixer on medium–high speed until soft peaks form. Add the vanilla custard (200g) and beat on low speed until just combined and smooth. Do not overwhip or the mixture may split.",
      "Wash and dry the mixed berries. Hull and slice the strawberries into bite-sized pieces if using; leave smaller berries like blueberries and raspberries whole.",
      "To assemble, place one piece of puff pastry on a serving plate. Pipe or spread a thick layer of the custard cream over it, then arrange berries on top. Place another pastry piece on top and repeat the layers 2–3 times as desired, finishing with a pastry layer.",
      "Just before serving, dust the top generously with icing sugar through a fine sieve and decorate with extra berries if you wish. Serve immediately so the pastry stays crisp and the cream is light."
    ]
  }
]
