[
  {
    "id": "spanish_seafood_paella",
    "title": "Spanish Seafood Paella",
    "prep_time": "20 mins",
    "cook_time": "40 mins",
    "total_time": "1 hr",
    "image": "assets/images/categories/maincourse/spanish_seafood_paella.jpg",
    "ingredients": [
      "1/4 cup Olive oil",
      "1 Onion, chopped",
      "1 Bell pepper, chopped",
      "4 cloves Garlic",
      "3 Roma tomatoes or 8 oz tomato sauce",
      "1 Bay leaf",
      "1 tsp Paprika",
      "1 pinch Saffron",
      "Salt and Pepper",
      "1/4 cup White wine",
      "4 Boneless chicken thighs",
      "1/4 cup Chopped parsley",
      "2 cups Spanish rice",
      "5 cups Chicken stock",
      "1/2 cup Peas",
      "12 Prawns",
      "10–12 Mussels",
      "8 oz Squid rings"
    ],
    "steps": [
      "Prepare the ingredients: Pat the chicken thighs dry with paper towels, then cut into bite-sized pieces (or leave whole if you prefer). Season lightly with salt and pepper and set aside. Finely chop the onion and bell pepper. If using fresh Roma tomatoes, grate or finely chop them; otherwise, have the tomato sauce ready.",
      "Heat a wide paella pan or a large, wide shallow pan over medium-high heat. Add the 1/4 cup olive oil. When the oil is hot, add the chicken pieces and sear for about 3–4 minutes per side until lightly browned on the outside (they do not need to be cooked through). Remove the chicken from the pan and set aside.",
      "Reduce the heat to medium. Add the chopped onion and bell pepper to the same pan and sauté for 5–7 minutes until the onion is soft and translucent. Add the minced garlic and cook for 1–2 minutes more until fragrant, stirring frequently so it doesn’t burn.",
      "Stir in the grated tomatoes or tomato sauce, bay leaf, paprika, saffron, and a pinch of salt and pepper. Cook for 3–5 minutes, stirring occasionally, until the mixture thickens slightly and the spices are fragrant.",
      "Pour in the 1/4 cup white wine. Use a wooden spoon to scrape up any browned bits from the bottom of the pan. Bring to a gentle simmer and cook for about 10 minutes until the alcohol has evaporated and the sauce has reduced a little.",
      "Return the seared chicken and any juices to the pan. Add the chopped parsley and stir to coat the chicken in the sauce.",
      "Add the 2 cups of Spanish rice, spreading it evenly over the bottom of the pan. Stir gently for 1–2 minutes so every grain is coated in the oil and sauce, but do not fry it too long.",
      "Pour in the 5 cups of hot chicken stock and stir once to distribute the rice evenly. Bring to a boil, then reduce the heat to medium-low so the liquid is gently simmering. From this point on, **do not stir** the rice. Cook for 15–18 minutes, rotating the pan occasionally over the heat if needed so it cooks evenly. If the liquid reduces too quickly, you can add a little more hot stock or water around the edges.",
      "When most of the liquid has been absorbed and the rice is almost tender, arrange the prawns, mussels (hinge-side down), squid rings, and peas on top of the rice. Cover the pan with a lid or foil and cook for another 5–8 minutes over low heat, until the prawns turn pink and opaque, the mussels have opened, and the squid rings are cooked through.",
      "Remove the pan from the heat and let the paella rest, covered, for 10 minutes. This allows the rice to finish cooking and a socarrat (crispy layer) to form on the bottom. Sprinkle with extra chopped parsley if desired and serve straight from the pan."
    ]
  },
  {
    "id": "moroccan_lamb_tagine",
    "title": "Moroccan Lamb Tagine",
    "prep_time": "15 mins",
    "cook_time": "2 hrs",
    "total_time": "2 hrs 15 mins",
    "image": "assets/images/categories/maincourse/moroccan_lamb_tagine.jpg",
    "ingredients": [
      "1–1.6 kg Lamb (cubed)",
      "1 tbsp Coriander powder",
      "1 tbsp Cumin powder",
      "2 tsp Ground cardamom",
      "2 tsp Turmeric powder",
      "1.5 tsp Fennel powder",
      "1 tsp Hot paprika",
      "Salt",
      "3 tbsp Oil",
      "3 cloves Garlic",
      "2 Onions",
      "1.5 tbsp Tomato paste",
      "2 tsp Grated ginger",
      "2 Cinnamon sticks",
      "2.5 cups Chicken stock",
      "1 cup Dried apricots",
      "1/2 cup Roasted almonds",
      "Lemon zest and coriander for garnish"
    ],
    "steps": [
      "In a small bowl, combine the coriander powder, cumin powder, ground cardamom, turmeric, fennel powder, hot paprika, and about 1–1.5 tsp salt. Stir well to make a spice mix.",
      "Pat the lamb cubes dry with paper towels and place them in a large bowl. Sprinkle the spice mix over the lamb and use your hands to rub the spices into the meat so that each piece is well coated. Let it stand for about 10–15 minutes so the flavours begin to absorb.",
      "Heat a tagine or heavy-based pot over medium-high heat. Add 2–3 tbsp oil. When hot, add the lamb in batches, without crowding the pan, and brown on all sides, about 5–7 minutes per batch. Transfer the browned lamb to a plate and repeat with the remaining meat.",
      "Reduce the heat to medium. In the same pot, add the sliced or chopped onions and sauté for 5–7 minutes until soft and lightly golden. Add the minced garlic (3 cloves) and grated ginger (2 tsp) and cook for a further 1–2 minutes until fragrant.",
      "Stir in the tomato paste and cook for about 1–2 minutes to remove its raw taste. Add the cinnamon sticks and mix everything together.",
      "Return the browned lamb and any accumulated juices to the pot. Pour in the chicken stock (2.5 cups), or enough to just cover the meat. Stir gently, bring to a boil, then reduce the heat to low. Cover with the lid and let the tagine simmer gently for about 45 minutes, checking occasionally to ensure it is not drying out. Add a little more stock or water if needed.",
      "After 45 minutes, add the dried apricots to the pot and stir them into the sauce. Cover and continue to simmer on low heat for another 45–60 minutes, or until the lamb is very tender and the sauce has thickened slightly and coats the meat and apricots.",
      "Taste and adjust the seasoning with more salt if needed. Remove the cinnamon sticks before serving. Garnish with roasted almonds, freshly grated lemon zest, and chopped coriander leaves. Serve hot with couscous, rice, or flatbread."
    ]
  },
  {
    "id": "miso_glazed_black_cod",
    "title": "Miso-Glazed Black Cod",
    "prep_time": "10 mins",
    "cook_time": "10–14 mins",
    "total_time": "2–3 days + 20 mins",
    "image": "assets/images/categories/maincourse/miso_glazed_black_cod.jpg",
    "ingredients": [
      "1/4 cup Sake",
      "1/4 cup Mirin",
      "1/4 cup White miso",
      "3 tbsp Sugar",
      "4 Black cod fillets"
    ],
    "steps": [
      "Make the marinade: Combine the sake (1/4 cup) and mirin (1/4 cup) in a small saucepan. Bring to a gentle boil over medium–low heat and simmer for 30 seconds to 1 minute to cook off the alcohol. Remove from the heat.",
      "While the mixture is still warm, whisk in the white miso (1/4 cup) and sugar (3 tbsp) until completely smooth and the sugar has dissolved. Allow the marinade to cool to room temperature.",
      "Prepare the fish: Pat the black cod fillets dry with paper towels. If the fillets are very thick, you can score the skin lightly with a sharp knife to help the heat and flavours penetrate more evenly.",
      "Marinate the cod: Place some of the cooled miso marinade into a shallow dish or a resealable plastic bag. Add the cod fillets and spread the remaining marinade over them so they are well coated on all sides. Cover the dish or seal the bag, pressing out excess air. Refrigerate for at least 2 days and up to 3 days, turning the fillets once a day so they marinate evenly.",
      "When ready to cook, preheat the oven to 200°C (or use the grill/broiler function if available). Line a baking tray with baking paper or foil and lightly oil it to prevent sticking. Remove the cod from the marinade and gently wipe or scrape off the excess marinade (do not rinse), as too much on the surface can burn easily.",
      "Place the fillets on the prepared tray, skin-side down. Bake or grill for 10–14 minutes, depending on the thickness of the fillets. The surface should caramelise and become lightly charred in spots, and the fish should flake easily with a fork and be just opaque in the centre. If using a grill/broiler, you may need to watch closely in the last few minutes to avoid burning.",
      "Remove the cod from the oven and let it rest on the tray for 2–3 minutes. Serve immediately with steamed rice and vegetables, spooning any juices from the tray over the fish."
    ]
  },
  {
    "id": "chicken_tikka_masala",
    "title": "Chicken Tikka Masala",
    "prep_time": "15 mins",
    "cook_time": "45 mins",
    "total_time": "1 hr",
    "image": "assets/images/categories/maincourse/chicken_tikka_masala.jpg",
    "ingredients": [
      "600g Chicken thighs",
      "1/2 cup Yogurt",
      "6 cloves Garlic",
      "1 tbsp Grated ginger",
      "Garam masala, cumin, coriander, paprika, cayenne",
      "400ml Tomato sauce",
      "100ml Cream",
      "50g Butter"
    ],
    "steps": [
      "Cut the 600g of chicken thighs into bite-sized pieces and pat them dry with paper towels. In a large bowl, combine 1/2 cup yogurt, the minced garlic from 6 cloves, 1 tbsp grated ginger, about 1 tsp salt, and ground spices such as garam masala, cumin, coriander, paprika, and cayenne (start with 1–2 tsp of each, adjusting the cayenne to your preferred heat level). Mix well to form a marinade.",
      "Add the chicken pieces to the bowl and toss until they are evenly coated in the yogurt and spice mixture. Cover the bowl with plastic wrap or a lid and refrigerate for at least 3 hours, or overnight for deeper flavour.",
      "When ready to cook, preheat the oven to 220°C or prepare a grill/grill pan. Arrange the marinated chicken pieces on a lightly oiled baking tray lined with baking paper, making sure they are not crowded. Roast for 15–20 minutes, or until the chicken is cooked through and has some charred edges. Alternatively, grill for about 5–7 minutes per side. Reserve any juices from the tray to add to the sauce later.",
      "Make the sauce: Heat a heavy-based pan over medium heat. Add about half of the butter (25g). If you like, you can also add 1 finely chopped onion (not listed but commonly used) for extra flavour. Sauté the onion for 5–7 minutes until soft and translucent. Add an extra 1 tsp grated ginger and 2 minced garlic cloves (optional) and cook for 1–2 minutes until fragrant.",
      "Sprinkle in additional ground spices (garam masala, cumin, coriander, paprika, and cayenne, about 1 tsp each or to taste) and stir for 30 seconds to 1 minute to toast the spices and release their aroma, being careful not to burn them.",
      "Pour in the 400ml tomato sauce, scraping the bottom of the pan to release any browned bits. Reduce the heat to medium–low and simmer gently for 10–15 minutes, stirring occasionally, until the sauce thickens slightly.",
      "For a smoother sauce, use an immersion blender to puree the sauce directly in the pan, or carefully transfer to a blender and blend until smooth, then return to the pan. Add the remaining 25g butter and the 100ml cream. Stir until the butter melts and the sauce turns a rich, creamy orange. Taste and adjust the seasoning with salt and a pinch of sugar if needed.",
      "Add the cooked chicken tikka (and any reserved juices) to the sauce. Stir to coat the chicken well. Simmer on low heat for another 10–15 minutes so the chicken absorbs the flavours and the sauce thickens to your liking.",
      "Turn off the heat. Garnish with chopped fresh coriander leaves if desired and serve hot with basmati rice, naan, or roti."
    ]
  },
  {
    "id": "pan_seared_steak",
    "title": "Pan-Seared Steak",
    "prep_time": "5 mins (+30 mins rest)",
    "cook_time": "15 mins",
    "total_time": "50 mins",
    "image": "assets/images/categories/maincourse/pan_seared_steak.jpg",
    "ingredients": [
      "1 lb Steak (NY Strip/Ribeye/Sirloin)",
      "Vegetable oil",
      "Sea salt",
      "Black pepper",
      "Butter",
      "Garlic",
      "Rosemary"
    ],
    "steps": [
      "Remove the steak from the fridge and let it sit at room temperature for about 30 minutes so it cooks more evenly. Pat both sides dry thoroughly with paper towels; a dry surface helps create a good crust.",
      "Season both sides of the steak generously with sea salt and freshly ground black pepper. Press the seasoning lightly into the meat and set aside while you heat the pan.",
      "Place a heavy skillet (such as cast iron) over medium-high heat and let it heat for 2–3 minutes until very hot. Add 1–2 tbsp vegetable oil and swirl to coat the bottom. The oil should shimmer and just begin to smoke.",
      "Carefully lay the steak in the pan, laying it away from you to avoid splashes. Sear without moving it for 2–3 minutes until a deep brown crust forms on the bottom. Flip the steak and sear the other side for another 2–3 minutes.",
      "Reduce the heat to medium. Add about 2 tbsp butter to the pan along with 2–3 lightly crushed garlic cloves and 1–2 sprigs of rosemary. Once the butter has melted and is foaming, tilt the pan slightly and use a spoon to baste the steak continuously with the hot butter for 1–2 minutes on each side.",
      "The total cooking time will depend on the thickness of the steak and your desired doneness. For a 1-inch (about 2.5cm) thick steak, 6–8 minutes of total cooking time usually yields medium-rare. For more precise results, use an instant-read thermometer: about 52–54°C (125–130°F) for medium-rare and 57–60°C (135–140°F) for medium.",
      "Once the steak reaches your desired internal temperature, transfer it to a cutting board or plate. Tent loosely with foil and let it rest for 5–7 minutes so the juices redistribute throughout the meat.",
      "After resting, slice the steak against the grain into thick slices (if the cut has visible grain) and drizzle with some of the buttery pan juices and garlic. Serve immediately with mashed potatoes, roasted vegetables, or salad."
    ]
  }
]
