[
  {
    "id": "walnut_miso_noodles",
    "title": "Walnut Miso Noodles",
    "prep_time": "10 mins",
    "cook_time": "10 mins",
    "total_time": "20 mins",
    "image": "assets/images/categories/noodles/walnut_miso_noodles.jpg",
    "ingredients": [
      "200g Soba noodles",
      "2 tbsp White miso",
      "1/3 cup Roasted walnuts",
      "Soy sauce (for seasoning)",
      "Honey (for seasoning)",
      "Sesame oil (for seasoning)",
      "Warm water or noodle cooking water (to adjust sauce consistency)",
      "Scallions, sliced (for garnish)",
      "Toasted sesame seeds (for garnish)"
    ],
    "steps": [
      "Cook the noodles: Bring a large pot of water to a boil and add a pinch of salt. Add the 200g soba noodles and cook according to the package instructions (about 5–7 minutes) until tender but still slightly firm (al dente). Stir gently with chopsticks to prevent sticking. Reserve about 1/4 cup of the noodle cooking water, then drain the noodles in a colander. Rinse briefly under cold water to stop the cooking and rinse off excess starch. Drain well.",
      "Make the walnut miso base: If your walnuts are not yet roasted, toast them in a dry pan over medium heat for 3–5 minutes until fragrant and lightly golden, then let cool. Place the 1/3 cup roasted walnuts and 2 tbsp white miso in a blender, food processor, or mortar. Add a little warm water or noodle cooking water (1–2 tbsp at a time) and blend or pound until you have a thick, smooth paste.",
      "Season the sauce: Add about 1–2 tsp soy sauce, 1–2 tsp honey, and 1 tsp sesame oil to the walnut miso paste. Stir or blend again until the sauce is smooth and well combined. Taste and adjust – add more soy sauce for saltiness, more honey for sweetness, or more water if the sauce is too thick. The sauce should be thick but pourable.",
      "Toss the noodles: Place the drained noodles in a large mixing bowl. Pour in most of the walnut miso sauce and toss gently with chopsticks or tongs until the noodles are evenly coated. If the noodles seem dry, add a splash of the reserved cooking water and toss again. Taste and add more sauce or a little extra soy sauce/honey if needed.",
      "Serve: Divide the noodles between serving bowls. Garnish generously with sliced scallions and toasted sesame seeds. Serve warm or at room temperature."
    ]
  },
  {
    "id": "sesame_noodles",
    "title": "Sesame Noodles",
    "prep_time": "10 mins",
    "cook_time": "10 mins",
    "total_time": "20 mins",
    "image": "assets/images/categories/noodles/sesame_noodles.jpg",
    "ingredients": [
      "200g Noodles (egg noodles or other Asian noodles)",
      "3–4 tbsp Ground toasted sesame seeds",
      "2–3 tbsp Japanese soy sauce",
      "1–2 tsp Sesame oil",
      "1–2 tbsp Rice vinegar",
      "1–2 tsp Sugar or honey (to taste)",
      "Cucumber, cut into matchsticks (for serving)",
      "Scallions, sliced (for garnish)",
      "Extra toasted sesame seeds (for garnish)"
    ],
    "steps": [
      "Cook the noodles: Bring a pot of water to a boil and add the 200g noodles. Cook according to the package directions (about 4–6 minutes) until just tender. Drain in a colander. You can briefly rinse with warm or cold water to stop the cooking and remove excess starch, then drain well. Toss with a small drizzle of sesame oil to keep the noodles from sticking.",
      "Make the sesame sauce: In a mixing bowl, combine the ground toasted sesame seeds (3–4 tbsp), Japanese soy sauce (2–3 tbsp), rice vinegar (1–2 tbsp), sesame oil (1 tsp), and sugar or honey (1–2 tsp). Stir until the sugar or honey is dissolved. Taste and adjust the balance of salty, tangy, and sweet. If the sauce seems too thick, add 1–2 tbsp water to loosen it.",
      "Toss the noodles: Add the drained noodles to the bowl of sauce. Use tongs or chopsticks to toss gently until the noodles are evenly coated. Taste and adjust seasoning with a little more soy sauce or vinegar if needed.",
      "Serve: Divide the noodles into bowls or plates. Top with cucumber matchsticks, sliced scallions, and a sprinkle of extra toasted sesame seeds. Serve at room temperature or slightly chilled."
    ]
  },
  {
    "id": "rainbow_noodle_salad",
    "title": "Rainbow Noodle Salad",
    "prep_time": "15 mins",
    "cook_time": "10 mins",
    "total_time": "25 mins",
    "image": "assets/images/categories/noodles/rainbow_noodle_salad.jpg",
    "ingredients": [
      "200g Rice noodles or Soba",
      "Julienned carrot",
      "Shredded purple cabbage",
      "Julienned cucumber",
      "Bell pepper, thinly sliced (red/yellow/green as desired)",
      "2–3 tbsp Roasted peanuts",
      "2–3 tbsp Japanese soy sauce",
      "2–3 tbsp Rice vinegar or lime juice",
      "1 tsp Sesame oil",
      "1–2 tsp Honey or sugar",
      "Chili oil (optional, to taste)"
    ],
    "steps": [
      "Cook the noodles: Bring a pot of water to a boil. Add the 200g rice noodles or soba and cook according to the package instructions until just tender. Drain in a colander and rinse under cold water to stop the cooking and remove excess starch. Gently toss the noodles so they don’t clump together and let them drain well.",
      "Prepare the vegetables: Julienne the carrot and cucumber, shred the purple cabbage, and thinly slice the bell pepper. Aim for a total of about 2–3 cups of mixed vegetables so the salad is colourful and filled with crunch.",
      "Make the dressing: In a small bowl, combine Japanese soy sauce (2–3 tbsp), rice vinegar or lime juice (2–3 tbsp), sesame oil (1 tsp), and honey or sugar (1–2 tsp). Stir until the honey or sugar dissolves. Add a little chili oil if you’d like some heat. Taste and adjust the seasoning to your preference.",
      "Combine the salad: Place the drained noodles in a large mixing bowl. Add all the prepared vegetables. Pour the dressing over the noodles and vegetables. Use tongs to toss everything together gently until the noodles and vegetables are evenly coated in the dressing.",
      "Serve: Transfer the salad to a serving platter or individual bowls. Sprinkle with 2–3 tbsp roasted peanuts (roughly chopped if you like) for crunch. Serve chilled or at room temperature as a light, colourful noodle salad."
    ]
  },
  {
    "id": "spicy_tahini_noodles",
    "title": "Spicy Tahini Noodles",
    "prep_time": "10 mins",
    "cook_time": "10 mins",
    "total_time": "20 mins",
    "image": "assets/images/categories/noodles/spicy_tahini_noodles.jpg",
    "ingredients": [
      "200g Udon or Rice noodles",
      "2 tbsp Tahini",
      "Chili sauce (such as sriracha or your favourite hot sauce)",
      "1–2 tbsp Japanese soy sauce",
      "Warm water or noodle cooking water (to adjust sauce consistency)",
      "A little sugar or honey (optional, to balance flavour)",
      "Scallions, sliced (for garnish)",
      "Toasted sesame seeds (for garnish)"
    ],
    "steps": [
      "Cook the noodles: Bring a large pot of water to a boil. Add the 200g udon or rice noodles and cook according to the package directions (udon typically 8–10 minutes, rice noodles about 5–7 minutes) until tender. Drain in a colander. Rinse briefly with warm or cold water if desired, then drain well.",
      "Make the spicy tahini sauce: In a mixing bowl, add the 2 tbsp tahini, about 1–2 tsp chili sauce (more or less depending on how spicy you like it), and 1–2 tbsp Japanese soy sauce. Add 1–2 tbsp warm water or noodle cooking water and whisk until smooth and creamy. Taste and adjust with a little sugar or honey if you’d like a rounder, less sharp heat.",
      "Toss with noodles: Place the drained noodles in a large bowl. Pour the spicy tahini sauce over the noodles. Toss gently with tongs or chopsticks until all the noodles are evenly coated. If the mixture seems too thick or dry, add a splash more warm water or noodle cooking water and toss again.",
      "Serve: Divide the noodles into bowls. Garnish with sliced scallions and toasted sesame seeds. Serve warm or at room temperature."
    ]
  },
  {
    "id": "slurptastic_herb_noodles",
    "title": "Slurptastic Herb Noodles",
    "prep_time": "10 mins",
    "cook_time": "10 mins",
    "total_time": "20 mins",
    "image": "assets/images/categories/noodles/slurptastic_herb_noodles.jpg",
    "ingredients": [
      "200g Noodles",
      "Coriander",
      "Mint",
      "Basil (or Thai basil)",
      "Scallions",
      "2–3 tbsp Japanese soy sauce",
      "1 tbsp Fish sauce (optional)",
      "1–2 tbsp Lime juice",
      "1 tsp Sesame oil",
      "1 tsp Chili oil (or to taste)",
      "1–2 tsp Sugar (to balance flavour)"
    ],
    "steps": [
      "Cook the noodles: Bring a pot of water to a boil. Add the 200g noodles and cook according to the package instructions until tender but still pleasantly chewy. Drain in a colander, then briefly rinse with warm or cool water to remove excess starch. Shake off as much water as possible.",
      "Prepare the herbs: Wash the coriander, mint, basil (or Thai basil), and scallions thoroughly and pat dry. Roughly chop or slice the herbs. You should have about 1–1.5 cups of chopped mixed herbs in total so the noodles are very fragrant and fresh.",
      "Make the herb dressing: In a small bowl, combine Japanese soy sauce (2–3 tbsp), fish sauce (1 tbsp, if using), lime juice (1–2 tbsp), sesame oil (1 tsp), chili oil (1 tsp or to taste), and sugar (1–2 tsp). Stir until the sugar dissolves. Taste and adjust – more lime juice for acidity, more soy or fish sauce for saltiness, more sugar to soften the edges, or more chili oil for heat.",
      "Toss the noodles: Put the drained noodles into a large mixing bowl. Add all the chopped herbs. Pour the dressing over the noodles and herbs. Toss gently but thoroughly with tongs so the noodles are coated with the dressing and the herbs are evenly distributed.",
      "Serve: Transfer to serving bowls or plates. Serve immediately at room temperature or slightly warm so the aroma of the herbs is at its best. This dish works well as a light main or as a side alongside grilled meats or other dishes."
    ]
  }
]
