[
  {
    "id": "mexican_chicken_stew_quinoa_beans",
    "title": "Mexican Chicken Stew with Quinoa & Beans",
    "prep_time": "10 mins",
    "cook_time": "35 mins",
    "total_time": "45 mins",
    "image": "assets/images/categories/protein/mexican_chicken_stew_quinoa_beans.jpg",
    "ingredients": [
      "400g Chicken breast, cut into bite-sized pieces",
      "150g Quinoa, rinsed",
      "1 can Red beans, rinsed and drained",
      "1 can Chopped tomatoes or 2–3 fresh tomatoes, chopped",
      "1 Onion, chopped",
      "3–4 cloves Garlic, minced",
      "750ml Chicken stock (about 3 cups)",
      "1–2 tsp Mixed Mexican spices (such as paprika, cumin, chili powder)",
      "Salt and freshly ground black pepper",
      "1–2 tbsp Vegetable oil"
    ],
    "steps": [
      "Prepare the ingredients: Rinse the quinoa in a fine-mesh sieve under running water for 1–2 minutes to remove its natural bitterness, then drain well. Rinse and drain the canned beans. Cut the chicken breast into bite-sized pieces and pat dry with paper towels. Chop the onion and mince the garlic.",
      "Sauté onion and garlic: Heat a heavy-based pot over medium heat and add 1–2 tbsp vegetable oil. Add the chopped onion and sauté for about 3–4 minutes until soft and translucent. Add the minced garlic and cook for 1 minute more, stirring, until fragrant but not browned.",
      "Brown the chicken with spices: Add the chicken pieces to the pot, spreading them out in a single layer. Cook for about 4–5 minutes, stirring occasionally, until the outside of the chicken turns white and begins to brown lightly. Sprinkle in the Mexican spices (about 1–2 tsp in total) and season lightly with salt and pepper. Stir to coat the chicken and aromatics with the spices and cook for another 1–2 minutes until fragrant.",
      "Add tomatoes, beans, and quinoa: Stir in the chopped tomatoes and let them cook for 2–3 minutes until they begin to break down. Add the rinsed quinoa and drained beans, stirring to combine everything evenly.",
      "Simmer with stock: Pour in the chicken stock (about 750ml). Stir to distribute the quinoa evenly. Bring the mixture up to a boil, then reduce the heat to medium-low. Cover the pot partially with a lid and let it simmer gently for 20–25 minutes, stirring occasionally to prevent the quinoa from sticking to the bottom.",
      "Check doneness and season: When the quinoa is cooked, the grains will be tender and slightly translucent, and the stew will have thickened. If it looks too thick, you can add a little more hot stock or water. Taste and adjust seasoning with more salt, pepper, or chili powder to your liking. Turn off the heat and let the stew rest for about 5 minutes before serving so the flavours meld."
    ]
  },
  {
    "id": "bean_enchiladas",
    "title": "Bean Enchiladas",
    "prep_time": "15 mins",
    "cook_time": "20 mins",
    "total_time": "35 mins",
    "image": "assets/images/categories/protein/bean_enchiladas.jpg",
    "ingredients": [
      "400g Refried beans (or mashed black/red beans)",
      "8–10 Tortillas (corn or flour)",
      "2–3 cups Enchilada sauce",
      "1 cup Corn kernels (fresh, frozen, or canned and drained)",
      "1–2 cups Grated cheese (such as cheddar, mozzarella, or a blend)",
      "1/2 Onion, finely chopped (optional)",
      "A little vegetable oil for sautéing and greasing the dish",
      "Salt and pepper (to season the filling)"
    ],
    "steps": [
      "Preheat the oven: Heat the oven to 180°C (350°F). Lightly grease a baking dish (about 20×30cm) with a little oil or cooking spray.",
      "Make the filling: Heat a frying pan over medium heat and add a little oil. If using onion, add the chopped onion and sauté for 3–4 minutes until soft and translucent. Add the refried beans (400g) and the corn kernels (1 cup). Stir to combine well. If the mixture is very thick, add a splash of water or a few tablespoons of enchilada sauce to loosen it. Season with salt and pepper to taste. Cook until heated through, then remove from the heat and let cool slightly.",
      "Warm the tortillas: To make them easier to roll, gently warm the tortillas by wrapping them in foil and placing them in the oven for 3–5 minutes, or by heating each tortilla in a dry pan over low heat for about 20–30 seconds per side.",
      "Assemble the enchiladas: Spread a thin layer of enchilada sauce (about 1/2 cup) over the bottom of the prepared baking dish. Place a warm tortilla on a board, spoon 2–3 tbsp of the bean and corn filling along the centre, and sprinkle a little grated cheese on top. Roll up the tortilla tightly and place it seam-side down in the baking dish. Repeat with the remaining tortillas and filling, arranging them snugly in the dish.",
      "Top with sauce and cheese: Pour the remaining enchilada sauce evenly over the rolled tortillas, making sure they are all well coated. Sprinkle the rest of the grated cheese generously over the top.",
      "Bake: Place the dish in the preheated oven and bake for 15–20 minutes, or until the cheese is melted and bubbly and the enchiladas are heated through. Remove from the oven and let rest for about 5 minutes before serving. Serve with salsa, sour cream, and fresh coriander if desired."
    ]
  },
  {
    "id": "chicken_stroganoff",
    "title": "Chicken Stroganoff",
    "prep_time": "10 mins",
    "cook_time": "20 mins",
    "total_time": "30 mins",
    "image": "assets/images/categories/protein/chicken_stroganoff.jpg",
    "ingredients": [
      "400g Chicken breast, sliced into strips or bite-sized pieces",
      "250g Mushrooms, sliced",
      "1 Onion, sliced or roughly chopped",
      "1–2 tbsp Mustard (such as Dijon)",
      "150–200g Sour cream",
      "250ml Chicken stock",
      "Salt and freshly ground black pepper",
      "2–3 tbsp Butter or vegetable oil",
      "Chopped parsley for garnish (optional)"
    ],
    "steps": [
      "Prepare the ingredients: Slice the chicken breast into strips or chunks. Pat dry with paper towels. Slice the mushrooms and cut the onion into wedges or rough chunks.",
      "Cook the mushrooms and onions: Heat a large frying pan or skillet over medium heat and add 1 tbsp butter or oil. Add the mushrooms and cook for about 4–5 minutes until they release their moisture and start to brown. Remove the mushrooms and set aside. Add a little more butter or oil if needed, then add the onion and sauté for 3–4 minutes until soft and lightly golden. Remove and set aside with the mushrooms.",
      "Brown the chicken: In the same pan, add a little more butter or oil if necessary and increase the heat to medium-high. Add the chicken pieces and cook for about 4–5 minutes, stirring occasionally, until the outside is browned. Season lightly with salt and pepper.",
      "Combine and add mustard: Return the cooked mushrooms and onions to the pan with the chicken. Add 1–2 tbsp mustard and stir to coat the chicken and vegetables evenly.",
      "Simmer with stock: Pour in the chicken stock (250ml) and stir well, scraping the bottom of the pan to release any browned bits. Reduce the heat to medium-low and let the mixture simmer gently for 8–10 minutes until the chicken is cooked through and the sauce has reduced slightly.",
      "Stir in the sour cream and season: Reduce the heat to low (or briefly remove the pan from the heat) before adding the sour cream. Stir in 150–200g sour cream until the sauce becomes smooth and creamy. Do not let the sauce boil vigorously after adding the sour cream to prevent curdling. Taste and adjust the seasoning with salt and pepper.",
      "Serve: Sprinkle with chopped parsley if using. Serve hot over rice, mashed potatoes, or pasta."
    ]
  },
  {
    "id": "basa_fillet_garlic_paprika_butter",
    "title": "Basa Fillet with Garlic & Paprika Butter",
    "prep_time": "10 mins",
    "cook_time": "12 mins",
    "total_time": "22 mins",
    "image": "assets/images/categories/protein/basa_fillet_garlic_paprika_butter.jpg",
    "ingredients": [
      "2 Basa fillets (about 150–180g each)",
      "40g Butter",
      "2–3 cloves Garlic, minced",
      "1–2 tsp Paprika",
      "Salt and freshly ground black pepper",
      "A little vegetable oil for greasing the tray"
    ],
    "steps": [
      "Preheat the oven: Heat the oven to 200°C (400°F). Line a baking tray with baking paper or foil and lightly grease it with a little oil.",
      "Season the fish: Pat the basa fillets dry with paper towels. Season both sides lightly with salt and black pepper, then sprinkle 1–2 tsp paprika over the fillets, rubbing gently so the spices coat the surface evenly.",
      "Bake the fish: Place the seasoned fillets on the prepared tray. Bake in the preheated oven for 10–12 minutes, depending on thickness, until the fish is opaque and flakes easily with a fork.",
      "Make the garlic paprika butter: While the fish is baking, melt the 40g butter in a small saucepan over low heat. Add the minced garlic and cook for 1–2 minutes, stirring, until fragrant and just turning pale golden (do not let it burn). Stir in an extra 1/2–1 tsp paprika, then remove from the heat.",
      "Serve: Transfer the baked basa fillets to serving plates and spoon the warm garlic paprika butter over the top. Serve immediately with vegetables, mashed potatoes, or salad."
    ]
  },
  {
    "id": "herb_garlic_baked_cod_romesco_spinach",
    "title": "Herb Garlic Baked Cod with Romesco Sauce & Spinach",
    "prep_time": "15 mins",
    "cook_time": "20 mins",
    "total_time": "35 mins",
    "image": "assets/images/categories/protein/herb_garlic_baked_cod_romesco_spinach.jpg",
    "ingredients": [
      "2 Cod fillets (about 150–180g each)",
      "2 cloves Garlic, minced",
      "2–3 tbsp Chopped herbs (such as parsley, thyme, rosemary or a mix)",
      "3–4 tbsp Olive oil",
      "200–250g Fresh spinach",
      "Romesco sauce, store-bought or homemade, for serving",
      "Salt and freshly ground black pepper"
    ],
    "steps": [
      "Preheat the oven: Heat the oven to 190–200°C (375–400°F). Line a baking tray with baking paper or foil.",
      "Season the cod: Pat the cod fillets dry with paper towels. Season both sides with salt and black pepper and place them on the prepared baking tray.",
      "Make the herb-garlic oil: In a small bowl, combine 2–3 tbsp olive oil with the minced garlic and chopped herbs. Stir to make a fragrant herb-garlic oil.",
      "Bake the cod: Spoon or brush the herb-garlic oil over the top and sides of the cod fillets so they are well coated. Bake in the preheated oven for 15–20 minutes (depending on thickness), until the fish is opaque and flakes easily with a fork. For a slightly browned top, you can switch on the grill/broiler for the last 1–2 minutes, watching carefully to avoid burning.",
      "Sauté the spinach: While the cod is baking, heat the remaining olive oil (about 1 tbsp) in a large frying pan over medium heat. Add a little extra minced garlic if you like and cook until fragrant. Add the spinach and sauté for 2–3 minutes, tossing, until just wilted. Season lightly with salt and pepper, then remove from the heat.",
      "Serve: Arrange the sautéed spinach on serving plates as a bed. Place a herb-garlic baked cod fillet on top of the spinach. Spoon romesco sauce over or alongside the fish. Garnish with a few extra fresh herbs if desired and serve immediately."
    ]
  }
]
