[
  {
    "id": "simple_green_salad",
    "title": "Simple Green Salad",
    "prep_time": "15 mins",
    "cook_time": "0 mins",
    "total_time": "15 mins",
    "image": "assets/images/categories/salad_and_healthy/simple_green_salad.jpg",
    "ingredients": [
      "6 cups Mixed greens (such as oak leaf, romaine, rocket, etc.)",
      "1 English cucumber",
      "1 cup Cherry tomatoes",
      "1 Carrot",
      "1 Avocado",
      "Goat cheese or Feta, crumbled (to taste)",
      "3 tbsp Olive oil",
      "1–2 tbsp Lemon juice",
      "1 tsp Honey (optional, for a touch of sweetness)",
      "Salt and freshly ground black pepper"
    ],
    "steps": [
      "Prepare the greens: Wash the mixed greens thoroughly and soak briefly in cold water to refresh them. Spin or pat dry very well so the leaves are not wet, then tear or cut into bite-sized pieces. Place in a large salad bowl.",
      "Prep the vegetables: Wash the cucumber and slice it into rounds or half-moons. Rinse the cherry tomatoes and cut them in half. Peel the carrot, then cut into thin sticks or grate into long shreds. Set all the vegetables aside.",
      "Prepare the avocado: Cut the avocado in half, remove the pit, and scoop out the flesh. Slice or dice it into bite-sized pieces and set aside in a small bowl. Do this close to serving time to avoid browning.",
      "Make a simple dressing: In a small bowl or jar, combine the olive oil (3 tbsp), lemon juice (1–2 tbsp), honey (1 tsp, if using), a pinch of salt, and some black pepper. Whisk or shake until the dressing is emulsified and smooth. Taste and adjust with more lemon juice or salt if needed.",
      "Assemble the salad: Add the cucumber, cherry tomatoes, and carrot to the bowl of greens. Pour most of the dressing over the salad and toss gently with salad tongs until the leaves and vegetables are lightly coated.",
      "Finish and serve: Add the avocado pieces on top and crumble goat cheese or feta over the salad. Drizzle with a little extra dressing if desired. Serve immediately while the greens are crisp."
    ]
  },
  {
    "id": "caesar_salad",
    "title": "Caesar Salad",
    "prep_time": "20 mins",
    "cook_time": "10 mins",
    "total_time": "30 mins",
    "image": "assets/images/categories/salad_and_healthy/caesar_salad.jpg",
    "ingredients": [
      "2–3 cups Cubed bread (for croutons)",
      "2–3 tbsp Olive oil (for croutons)",
      "Salt and freshly ground black pepper (for seasoning)",
      "1/3 cup Mayonnaise",
      "2–3 tbsp Olive oil (for dressing)",
      "1–2 tbsp Lemon juice",
      "1 tsp Dijon mustard",
      "1–2 cloves Garlic, finely minced",
      "1/4 cup Grated Parmesan (for dressing) plus extra for topping",
      "1 large or 2 small heads Romaine lettuce, washed and torn into bite-sized pieces"
    ],
    "steps": [
      "Make the croutons: Preheat the oven to 180°C (350°F). Place the bread cubes in a bowl and drizzle with 2–3 tbsp olive oil. Season with a pinch of salt and pepper and toss to coat. Spread the bread out in a single layer on a baking tray and bake for 8–10 minutes, turning once, until golden and crisp. Remove and let cool.",
      "Prepare the lettuce: Wash the romaine leaves well and soak briefly in cold water to make them crisp. Drain and dry thoroughly, then tear or cut into bite-sized pieces. Place in a large salad bowl.",
      "Make the Caesar dressing: In a bowl, combine the mayonnaise (1/3 cup), olive oil (2–3 tbsp), lemon juice (1–2 tbsp), Dijon mustard (1 tsp), minced garlic (1–2 cloves), and 1/4 cup grated Parmesan. Whisk until smooth and creamy. If the dressing is too thick, thin it with a little warm water or extra lemon juice. Season with salt and pepper to taste.",
      "Dress the lettuce: Pour most of the dressing over the romaine leaves (reserve a little to adjust later). Toss gently with salad tongs until all the leaves are lightly coated and glossy. Taste and add more dressing if needed.",
      "Finish and serve: Top the salad with the cooled croutons and extra grated Parmesan. Toss lightly once more if you like, then serve immediately so the lettuce stays crisp and the croutons remain crunchy."
    ]
  },
  {
    "id": "sweet_potato_salad",
    "title": "Sweet Potato Salad",
    "prep_time": "20 mins",
    "cook_time": "25 mins",
    "total_time": "45 mins",
    "image": "assets/images/categories/salad_and_healthy/sweet_potato_salad.jpg",
    "ingredients": [
      "2 Medium sweet potatoes",
      "3–4 cups Arugula (rocket)",
      "1/2–3/4 cup Feta cheese, crumbled",
      "1 Avocado",
      "2–3 tbsp Roasted pumpkin seeds",
      "Tahini dressing (homemade or store-bought)",
      "1–2 tbsp Olive oil (for roasting the sweet potatoes)",
      "Salt and freshly ground black pepper",
      "1–2 tbsp Lemon juice"
    ],
    "steps": [
      "Roast the sweet potatoes (if not already roasted): Preheat the oven to 200°C (400°F). Peel the sweet potatoes and cut them into cubes or thick slices about 1.5–2cm. Place them in a bowl, drizzle with 1–2 tbsp olive oil, season with salt and pepper, and toss to coat. Spread in a single layer on a baking tray and roast for 20–25 minutes, turning once halfway, until tender and lightly caramelised at the edges. Let cool to room temperature.",
      "Prepare the salad components: Wash and dry the arugula and place it in a large serving bowl or platter. Crumble the feta. Cut the avocado in half, remove the pit, scoop out the flesh, and dice or slice it. If the pumpkin seeds are not yet roasted, toast them in a dry pan over low heat for 3–5 minutes until fragrant.",
      "If making tahini dressing at home: Whisk together tahini with a little lemon juice, warm water, honey or maple syrup, salt, and a small amount of minced garlic until smooth and pourable. Adjust the thickness with more water as needed.",
      "Assemble the salad: Arrange the arugula in a generous layer on the serving dish and season lightly with salt and pepper. Scatter the cooled roasted sweet potato pieces evenly over the greens.",
      "Add toppings: Sprinkle the crumbled feta and diced avocado over the sweet potatoes. Squeeze 1–2 tbsp fresh lemon juice over the salad to brighten the flavours.",
      "Dress and serve: Drizzle the tahini dressing over the salad (start with a modest amount and add more if desired), then finish with a generous handful of roasted pumpkin seeds on top. Serve immediately so the greens stay fresh and the sweet potatoes do not become soggy."
    ]
  },
  {
    "id": "tortilla_pizza",
    "title": "Tortilla Pizza",
    "prep_time": "<30 mins",
    "cook_time": "<10 mins",
    "total_time": "20–30 mins",
    "image": "assets/images/categories/salad_and_healthy/tortilla_pizza.jpg",
    "ingredients": [
      "4 Tortillas",
      "1–1.5 cups Canned chopped tomatoes, drained",
      "1–2 cups Grated Pecorino or Cheddar cheese",
      "Roasted peppers, sliced into strips or bite-sized pieces",
      "Rocket (arugula) for topping",
      "1–2 tbsp Balsamic vinegar (for drizzling)",
      "A little Olive oil (for brushing the tortillas)",
      "Salt and freshly ground black pepper"
    ],
    "steps": [
      "Preheat the oven: Heat the oven to 220°C (430°F). Line 1–2 baking trays with baking paper.",
      "Prepare the tortilla bases: Place the tortillas on the baking trays. Lightly brush both sides with a little olive oil, especially the underside, to help them become crisp. Spread a thin layer of drained chopped tomatoes over each tortilla, leaving a small border around the edges. Season the tomato lightly with salt and pepper.",
      "Add cheese and toppings: Sprinkle the grated cheese generously over the tomato layer. Distribute the roasted pepper strips evenly on top so each slice will get some topping.",
      "Bake: Place the trays in the hot oven and bake for 4–6 minutes, or until the edges of the tortillas are crisp and the cheese is melted and bubbling. For extra crispness, you can leave them in the oven a minute or two longer, watching carefully so they don’t burn.",
      "Garnish and serve: Remove the tortilla pizzas from the oven. Top with fresh rocket leaves and drizzle with balsamic vinegar in thin streaks over the top. Cut into wedges or squares and serve immediately while hot and crispy."
    ]
  },
  {
    "id": "vegetarian_burritos",
    "title": "Vegetarian Burritos",
    "prep_time": "<30 mins",
    "cook_time": "10–30 mins",
    "total_time": "40–60 mins",
    "image": "assets/images/categories/salad_and_healthy/vegetarian_burritos.jpg",
    "ingredients": [
      "2–3 cloves Garlic, minced",
      "1 Red chili, finely chopped (or use dried chili flakes to taste)",
      "1 can Borlotti beans, rinsed and drained",
      "1–1.5 cups Cherry tomatoes, halved or chopped",
      "1 Avocado",
      "1 cup Feta cheese or Tofu, crumbled or cut into small cubes",
      "6–8 Tortillas",
      "1–2 tbsp Olive or Vegetable oil",
      "1 tsp Ground cumin",
      "1 tsp Paprika (or more to taste)",
      "Salt and freshly ground black pepper",
      "1–2 tbsp Lemon or Lime juice"
    ],
    "steps": [
      "Prep the ingredients: Rinse and drain the borlotti beans. Halve or chop the cherry tomatoes. Cut the avocado in half, remove the pit, and dice the flesh; toss with a little lemon or lime juice to prevent browning. Crumble the feta or cut the tofu into small cubes.",
      "Sauté garlic and chili: Heat 1–2 tbsp oil in a frying pan over medium heat. Add the minced garlic and chopped red chili and cook for 1–2 minutes, stirring, until fragrant but not browned.",
      "Make the bean filling: Add the borlotti beans and cherry tomatoes to the pan. Reduce the heat slightly. Sprinkle in the ground cumin and paprika, and stir so the spices coat the beans and tomatoes evenly. Cook for 5–7 minutes, stirring occasionally, until the tomatoes release their juices and the beans are hot through. If the mixture becomes too dry, add a splash of water. Season with salt and pepper to taste, then remove from the heat and let cool slightly.",
      "Warm the tortillas: Warm the tortillas one at a time in a dry pan over low heat for 20–30 seconds per side, or wrap them together in foil and warm in the oven for 3–5 minutes until soft and pliable.",
      "Assemble the burritos: Lay a warm tortilla on a board. Spoon a line of the warm bean filling down the centre, then top with diced avocado and crumbled feta or tofu cubes. Drizzle with a little lemon or lime juice if desired and adjust seasoning with a pinch of salt and pepper.",
      "Wrap tightly: Fold the sides of the tortilla inwards over the filling, then fold up the bottom edge and roll upwards tightly to form a neat cylinder with the seam on the underside.",
      "Optional toasting: For a slightly crisp exterior, place the wrapped burritos seam-side down in a dry pan over medium heat and toast for 1–2 minutes per side until lightly browned. Serve immediately with salsa, sour cream, or fresh salad on the side."
    ]
  }
]
