[
  {
    "id": "garlic_parmesan_bread_bites",
    "title": "Garlic Parmesan Bread Bites",
    "prep_time": "10 mins",
    "cook_time": "15 mins",
    "total_time": "25 mins",
    "image": "assets/images/categories/snack_and_appetizers/garlic_parmesan_bread_bites.jpg",
    "ingredients": [
      "1 Medium bread loaf or baguette",
      "4 tbsp Melted butter",
      "3 cloves Garlic, minced",
      "1/2–3/4 cup Grated Parmesan (to taste)",
      "2–3 tbsp Chopped parsley",
      "A pinch of salt (to season the butter)"
    ],
    "steps": [
      "Preheat the oven: Heat the oven to 180–190°C (350–375°F). Line a baking tray with baking paper or lightly grease it with butter/oil to prevent sticking.",
      "Prepare the bread: Cut the loaf or baguette into bite-sized pieces about 2cm thick. You can cut cubes or slices and then halve them. Place the pieces into a large mixing bowl.",
      "Make the garlic butter: In a small bowl, combine the 4 tbsp melted butter, 3 minced garlic cloves, 2–3 tbsp chopped parsley, and a pinch of salt. Stir until the garlic and parsley are evenly distributed throughout the butter.",
      "Coat the bread: Pour the garlic butter mixture over the bread pieces. Gently toss with a spoon or clean hands until every piece is coated.",
      "Arrange and top with cheese: Spread the coated bread pieces out in a single layer on the prepared baking tray, leaving a little space between pieces. Sprinkle grated Parmesan generously over the top of each piece.",
      "Bake: Place the tray in the oven and bake for 12–15 minutes, or until the bread is crisp and the cheese is melted and light golden. For extra crispness, bake for an additional 2–3 minutes, keeping an eye on them so they don’t burn.",
      "Serve: Remove from the oven and let cool slightly (they should still be warm). Transfer to a serving plate and serve as a snack or as a side to soups and pasta."
    ]
  },
  {
    "id": "honey_mustard_pretzel_bites",
    "title": "Honey Mustard Pretzel Bites",
    "prep_time": "15 mins",
    "cook_time": "10 mins",
    "total_time": "25 mins",
    "image": "assets/images/categories/snack_and_appetizers/honey_mustard_pretzel_bites.jpg",
    "ingredients": [
      "3 cups Mini pretzels",
      "3 tbsp Melted butter",
      "1 tbsp Honey",
      "1 tbsp Dijon mustard"
    ],
    "steps": [
      "Preheat the oven: Heat the oven to 160–180°C (320–350°F). Line a baking tray with baking paper.",
      "Make the honey mustard butter: In a small bowl, whisk together the melted butter (3 tbsp), honey (1 tbsp), and Dijon mustard (1 tbsp) until smooth and well combined.",
      "Coat the pretzels: Place the mini pretzels in a large mixing bowl. Pour the honey-mustard butter mixture over them and toss thoroughly until all the pretzels are evenly coated.",
      "Bake: Spread the coated pretzels out in a single layer on the prepared tray. Bake for 8–10 minutes, stirring or shaking the tray once halfway through, until the pretzels are dry to the touch and the coating is slightly set and fragrant.",
      "Cool and serve: Remove from the oven and let the pretzels cool on the tray for 5–10 minutes so the coating firms up. Transfer to a bowl and serve as a sweet-and-tangy snack."
    ]
  },
  {
    "id": "crispy_baked_potato_wedges",
    "title": "Crispy Baked Potato Wedges",
    "prep_time": "10 mins",
    "cook_time": "35 mins",
    "total_time": "45 mins",
    "image": "assets/images/categories/snack_and_appetizers/crispy_baked_potato_wedges.jpg",
    "ingredients": [
      "3 Large potatoes",
      "2–3 tbsp Olive oil",
      "1 tsp Chili powder (or paprika for a milder heat)",
      "1 tsp Garlic powder",
      "1/2–1 tsp Salt (to taste)",
      "A little freshly ground black pepper",
      "Chopped parsley, for garnish"
    ],
    "steps": [
      "Preheat the oven: Heat the oven to 200–220°C (400–430°F). Line a baking tray with baking paper or lightly grease it.",
      "Prepare the potatoes: Wash the potatoes well, scrubbing off any dirt. Peel them if you prefer, or leave the skin on for extra texture. Cut each potato in half lengthways, then cut each half into 3–4 wedges, making 6–8 wedges per potato of similar size.",
      "Optional soaking for extra crispness: Place the wedges in a bowl of cold water and soak for 10–15 minutes to remove excess starch. Drain and pat very dry with paper towels; removing moisture helps them crisp up in the oven.",
      "Season the wedges: Put the dried wedges into a large bowl. Add the olive oil (2–3 tbsp), chili powder or paprika (1 tsp), garlic powder (1 tsp), salt (1/2–1 tsp), and a little black pepper. Toss thoroughly so every wedge is evenly coated in oil and seasonings.",
      "Arrange and bake: Spread the wedges out in a single layer on the prepared tray, cut side down where possible, without crowding. Bake for 30–35 minutes, turning the wedges once halfway through (after about 15–20 minutes), until they are golden and crisp on the outside and tender on the inside.",
      "Garnish and serve: Remove from the oven and sprinkle with chopped parsley. Serve hot with ketchup, mayonnaise, or your favourite dipping sauce."
    ]
  },
  {
    "id": "mini_chicken_quesadilla_bites",
    "title": "Mini Chicken Quesadilla Bites",
    "prep_time": "15 mins",
    "cook_time": "10 mins",
    "total_time": "25 mins",
    "image": "assets/images/categories/snack_and_appetizers/mini_chicken_quesadilla_bites.jpg",
    "ingredients": [
      "4–6 Medium or large tortillas",
      "1–1.5 cups Shredded chicken breast (cooked)",
      "1–1.5 cups Grated Cheddar cheese",
      "1/2–1 cup Salsa",
      "A little oil or butter, for greasing the pan",
      "Sour cream, for serving (optional)"
    ],
    "steps": [
      "Prepare the chicken filling: If you don’t already have shredded chicken, cook chicken breast by boiling, baking, or roasting until done, then shred it into small pieces. Season lightly with salt and pepper if desired.",
      "Cut the tortillas: Using a round cutter or the rim of a glass, cut small circles from the tortillas (about 7–8cm in diameter). Stack and reserve the scraps for another use if you like.",
      "Assemble the mini quesadillas: Lay a tortilla circle on a board. Sprinkle a little grated cheese over half of the circle, then add some shredded chicken and a small spoonful of salsa on top. Add another light sprinkle of cheese over the filling, then fold the tortilla over to form a half-moon. Press the edges gently to help them stick.",
      "Cook in a pan: Heat a non-stick or cast-iron skillet over medium heat and brush with a little oil or butter. Place the folded mini quesadillas in the pan in a single layer. Cook for about 2–3 minutes per side until the tortillas are golden and crisp and the cheese inside is melted.",
      "Serve: Remove from the pan and place on a serving plate. Serve hot with extra salsa and sour cream on the side for dipping."
    ]
  },
  {
    "id": "creamy_cucumber_dill_bites",
    "title": "Creamy Cucumber Dill Bites",
    "prep_time": "10 mins",
    "cook_time": "0 mins",
    "total_time": "10 mins",
    "image": "assets/images/categories/snack_and_appetizers/creamy_cucumber_dill_bites.jpg",
    "ingredients": [
      "1–2 Cucumbers, sliced into 1cm thick rounds (20–24 slices total)",
      "120–150g Cream cheese, softened to room temperature",
      "2–3 tbsp Chopped fresh dill",
      "1–2 tsp Lemon juice",
      "Paprika, for sprinkling on top",
      "A pinch of salt",
      "A little freshly ground black pepper"
    ],
    "steps": [
      "Prepare the cucumber: Wash the cucumbers and peel partly or fully if desired. Slice into rounds about 1cm thick. Arrange the slices on a serving plate and pat the tops dry with paper towels so the cream cheese mixture will adhere well.",
      "Make the creamy dill mixture: Place the softened cream cheese in a mixing bowl. Beat with a fork or spatula until smooth. Add the chopped dill (2–3 tbsp), lemon juice (1–2 tsp), a pinch of salt, and a little black pepper. Mix until the mixture is smooth and evenly combined. Taste and adjust seasoning with more lemon juice or salt if needed.",
      "Top the cucumber rounds: Using a small spoon, dollop a little of the cream cheese mixture onto each cucumber slice, or pipe it on using a piping bag fitted with a decorative tip for a nicer presentation.",
      "Garnish and serve: Lightly sprinkle paprika over the top of each piece for colour. Add a tiny sprig of dill on each if you like. Serve immediately, or chill briefly in the refrigerator before serving as a cool, refreshing snack."
    ]
  }
]
