[
  {
    "id": "tom_yum_goong",
    "title": "Tom Yum Goong",
    "prep_time": "20 mins",
    "cook_time": "20 mins",
    "total_time": "40 mins",
    "image": "assets/images/categories/soap_and_curry/tom_yum_goong.jpg",
    "ingredients": [
      "Heads and shells from 12–15 prawns (for stock)",
      "5–6 cups Water (reduced to about 4 cups of stock)",
      "12–15 Medium prawns, peeled and deveined (leave tails on if desired)",
      "2 stalks Lemongrass (cut into 3–4cm pieces and lightly bruised)",
      "8 slices Galangal",
      "6 Kaffir lime leaves (torn and stem removed)",
      "200g Oyster or straw mushrooms (halved or sliced)",
      "6–10 Bird’s eye chilies, lightly bruised (to taste)",
      "2–3 tbsp Thai chili paste (nam prik pao) for tom yum",
      "3–4 tbsp Fish sauce (to taste)",
      "3–4 tbsp Fresh lime juice (added off the heat)",
      "1–2 tsp Sugar",
      "Chopped coriander or sawtooth coriander (for garnish)"
    ],
    "steps": [
      "Make the shrimp stock: Place the shrimp heads and shells in a pot and add 5–6 cups of water. Bring to a boil over medium heat, then reduce to a gentle simmer. Skim off any foam and simmer for 20–30 minutes until the liquid is fragrant and sweet. Strain the stock and discard the solids. You should end up with about 4 cups of shrimp stock. If there is more, simmer a bit longer to reduce.",
      "Prepare the prawns and aromatics: Peel and devein the prawns if not already done, rinsing and patting them dry. Prepare the lemongrass, galangal, and kaffir lime leaves as described in the ingredients. Rinse and cut the mushrooms into bite-sized pieces.",
      "Simmer the herbs and mushrooms: Pour the 4 cups of shrimp stock into a clean pot and bring to a boil over medium heat. Add the lemongrass, galangal, and kaffir lime leaves. Let the stock simmer gently for 3–5 minutes to infuse the flavours. Add the mushrooms and cook for another 2–3 minutes until they start to soften.",
      "Mix in the chili paste: Ladle out 1–2 scoops of the hot soup into a small bowl. Add the Thai chili paste (2–3 tbsp) to the bowl and stir until completely dissolved. Pour the mixture back into the pot and stir well so the chili paste is evenly distributed and not clumpy.",
      "Add the prawns: Bring the soup back to a boil, then add the prawns along with the lightly bruised bird’s eye chilies. Cook for about 1–2 minutes, just until the prawns turn pink and opaque. Avoid overcooking or they will become tough.",
      "Season (without lime juice yet): Reduce the heat to low and taste the soup. Season with 3–4 tbsp fish sauce and 1–2 tsp sugar, adjusting to your preferred balance of salty, spicy, and slightly sweet. Once the seasoning is balanced, turn off the heat.",
      "Add lime juice and serve: After turning off the heat, add the fresh lime juice (3–4 tbsp) and stir. Adding lime juice off the heat keeps the flavour bright and prevents bitterness. Taste and adjust with a little more fish sauce or lime juice if needed. Ladle into serving bowls, garnish with chopped coriander or sawtooth coriander, and serve hot with steamed rice."
    ]
  },
  {
    "id": "green_thai_curry",
    "title": "Green Thai Curry",
    "prep_time": "20 mins",
    "cook_time": "15 mins",
    "total_time": "35 mins",
    "image": "assets/images/categories/soap_and_curry/green_thai_curry.jpg",
    "ingredients": [
      "2 cans Coconut milk (about 800ml total, divided into thick and thin parts)",
      "1–1.5 cups Chicken stock (adjust for desired thickness)",
      "400–500g Chicken thighs, cut into bite-sized pieces",
      "3–4 tbsp Green curry paste (to taste)",
      "6–8 Thai eggplants, quartered",
      "4–6 Kaffir lime leaves, torn",
      "1 small bunch Thai sweet basil, leaves picked and washed",
      "1–2 Red spur chilies, sliced (for garnish)",
      "2–3 tbsp Fish sauce (to taste)",
      "1–2 tbsp Palm sugar"
    ],
    "steps": [
      "Separate the coconut milk: Scoop off about 1 cup of the thickest part of the coconut milk (the cream) and set aside for frying the curry paste. Mix the remaining coconut milk with the chicken stock to form the cooking liquid.",
      "Simmer coconut cream until it splits: In a pot or deep pan, add the 1 cup of coconut cream and heat over medium heat. Simmer for 3–5 minutes, stirring occasionally, until the coconut milk thickens and the oil begins to separate and appear on the surface. This is called “splitting” the coconut milk and builds flavour.",
      "Fry the curry paste: Add the green curry paste (3–4 tbsp) to the split coconut cream. Fry over medium heat for 2–3 minutes, stirring constantly, until very fragrant and slightly darker in colour. If the mixture becomes too dry or starts to stick, add a spoonful of coconut milk or water.",
      "Add the chicken: Add the chicken thigh pieces to the pan and stir to coat them thoroughly with the curry paste. Cook for 3–4 minutes until the outside of the chicken changes colour and begins to firm up, but does not need to be fully cooked through yet.",
      "Add coconut milk and stock: Pour in the remaining coconut milk and chicken stock mixture. Stir to combine. Bring to a gentle boil, then reduce the heat to medium and simmer for about 5 minutes to cook the chicken and develop the flavour.",
      "Add eggplants and kaffir lime leaves: Add the quartered Thai eggplants and torn kaffir lime leaves. Simmer for another 5–7 minutes until the eggplants are tender but not falling apart. If the curry becomes too thick, add a little more stock or water.",
      "Season the curry: Season with fish sauce (2–3 tbsp) and palm sugar (1–2 tbsp). Stir until the palm sugar dissolves completely. Taste and adjust the seasoning to find a good balance of salty, sweet, rich, and spicy. You can add more curry paste if you prefer a hotter curry.",
      "Finish with basil and serve: When the eggplants are tender and the chicken is cooked through, turn off the heat. Stir in the Thai sweet basil leaves and sliced red chilies. Let the residual heat wilt the basil. Serve the curry hot with steamed jasmine rice."
    ]
  },
  {
    "id": "japanese_miso_soup",
    "title": "Japanese Miso Soup",
    "prep_time": "5 mins",
    "cook_time": "10 mins",
    "total_time": "15 mins",
    "image": "assets/images/categories/soap_and_curry/japanese_miso_soup.jpg",
    "ingredients": [
      "4 cups Water",
      "2–3 tsp Dashi powder (adjust to taste)",
      "3–4 tbsp White or mixed miso paste",
      "1/2 Onion, sliced into wedges (optional)",
      "1/2 block Soft tofu, cut into small cubes (optional)",
      "Sliced spring onions, for garnish"
    ],
    "steps": [
      "Make the dashi: Pour 4 cups of water into a medium saucepan and place over medium heat. When the water is warm, add 2–3 tsp dashi powder and stir to dissolve. If using onion, add the sliced onion as well. Bring to a gentle simmer and cook for about 10 minutes until the broth is fragrant and the onion is tender.",
      "Add tofu (if using): If you are using tofu, gently add the tofu cubes to the simmering dashi. Cook for another 1–2 minutes to warm the tofu through, taking care not to stir too vigorously so the tofu does not break apart.",
      "Dissolve the miso: Ladle about 1 cup of the hot broth into a small bowl. Add 3–4 tbsp miso paste to the bowl and whisk or stir until completely smooth with no lumps. Then pour the dissolved miso back into the pot, ideally through a fine strainer or using a ladle and chopsticks to help it disperse evenly.",
      "Avoid boiling after adding miso: Once the miso is added, keep the heat very low and do not let the soup boil vigorously, as this can damage the delicate flavour and aroma of the miso. Warm gently until the soup is hot but not boiling, then turn off the heat.",
      "Serve: Ladle the miso soup into bowls and garnish with sliced spring onions. Serve immediately while hot."
    ]
  },
  {
    "id": "italian_tomato_basil_soup",
    "title": "Italian Tomato Basil Soup",
    "prep_time": "15 mins",
    "cook_time": "55 mins",
    "total_time": "1 hr 10 mins",
    "image": "assets/images/categories/soap_and_curry/italian_tomato_basil_soup.jpg",
    "ingredients": [
      "3 lbs Fresh tomatoes (about 1.3–1.5kg, halved or quartered)",
      "1 Medium carrot, sliced or chopped",
      "1 Onion, diced",
      "3–4 cloves Garlic, minced",
      "1 can Crushed tomatoes (about 400g)",
      "3–4 tbsp Olive oil",
      "2–3 cups Vegetable or chicken stock (adjust for desired thickness)",
      "A handful of fresh basil leaves, roughly torn",
      "2–3 sprigs Fresh thyme or 1/2 tsp dried thyme",
      "1/2–1 tsp Dried oregano",
      "Salt and freshly ground black pepper",
      "A pinch of sugar (optional, to balance acidity)"
    ],
    "steps": [
      "Roast the tomatoes and carrot: Preheat the oven to 200°C (400°F). Arrange the fresh tomato halves/quarters and sliced carrot on a baking tray. Drizzle with 1–2 tbsp olive oil and season lightly with salt and pepper. Toss to coat and spread out in a single layer. Roast for 30–40 minutes until the vegetables are soft and the tomatoes have slightly charred edges. Remove from the oven and let cool briefly.",
      "Blend the roasted vegetables: Transfer the roasted tomatoes and carrot to a blender. Add a little stock to help blend if needed. Blend until smooth or leave slightly chunky, depending on your preference. Set aside.",
      "Sauté onion and garlic: Heat the remaining olive oil (about 1–2 tbsp) in a large pot over medium heat. Add the diced onion and sauté for 5–7 minutes until soft and translucent. Add the minced garlic and cook for 1 minute more, stirring, until fragrant.",
      "Combine tomatoes and stock: Add the canned crushed tomatoes to the pot, followed by the blended roasted vegetables. Pour in enough stock (2–3 cups) to reach your desired soup consistency. Add thyme and oregano and stir to combine. Bring the soup to a boil, then reduce the heat to low and simmer gently for 20–25 minutes, stirring occasionally.",
      "Adjust texture and seasoning: If you want a smoother soup, use an immersion blender directly in the pot to blend to your preferred consistency (take care with hot liquids). Taste and season with salt, pepper, and a pinch of sugar if the tomatoes are very acidic.",
      "Add basil and serve: A few minutes before turning off the heat, add the torn basil leaves and let them wilt into the soup. Turn off the heat, ladle into bowls, and serve hot with crusty bread or toasted baguette slices."
    ]
  },
  {
    "id": "indian_chicken_curry",
    "title": "Indian Chicken Curry",
    "prep_time": "20 mins",
    "cook_time": "25 mins",
    "total_time": "45 mins",
    "image": "assets/images/categories/soap_and_curry/indian_chicken_curry.jpg",
    "ingredients": [
      "2–3 tbsp Olive oil or vegetable oil",
      "1 Onion, finely chopped",
      "3–4 cloves Garlic, minced",
      "1 tbsp Grated ginger",
      "2 tsp Curry powder",
      "1–2 tsp Paprika",
      "1/2 tsp Ground cinnamon or 1 small cinnamon stick",
      "500–600g Chicken pieces (breast or thigh, cut into bite-sized pieces)",
      "1/2 cup Plain yogurt",
      "1 can Coconut milk (about 400ml)",
      "2–3 tbsp Tomato paste",
      "1/2–1 cup Water or chicken stock (if needed to adjust thickness)",
      "1–2 tbsp Lime juice",
      "Fresh or dried chili, to taste",
      "Salt and freshly ground black pepper",
      "Chopped fresh coriander (cilantro), for garnish"
    ],
    "steps": [
      "Prepare the chicken and aromatics: Cut the chicken into bite-sized pieces and pat dry. In a small bowl, mix the yogurt with a pinch of salt and about 1 tsp of the curry powder. Toss the chicken pieces in this mixture and let marinate for 10–15 minutes while you prepare the rest.",
      "Cook the onions: Heat the olive oil (2–3 tbsp) in a large pot or deep pan over medium heat. Add the chopped onion and cook for 5–7 minutes, stirring occasionally, until soft and lightly golden brown. This step adds natural sweetness and depth to the curry.",
      "Add garlic, ginger, and dry spices: Add the minced garlic and grated ginger to the pot and cook for 1–2 minutes until fragrant. Stir in the remaining curry powder, paprika, and ground cinnamon (or cinnamon stick). Cook for a further minute, stirring, to toast the spices gently and release their aroma. If the pan looks too dry or the spices begin to stick, add a splash of water.",
      "Add the chicken and tomato paste: Add the marinated chicken pieces to the pot and cook over medium heat for about 4–5 minutes, stirring, until the outside of the chicken turns opaque and starts to brown in spots. Stir in the tomato paste (2–3 tbsp) and cook for another minute so it blends with the spices.",
      "Add coconut milk and simmer: Pour in the coconut milk (about 400ml) and stir to combine. If the curry looks very thick, add 1/2–1 cup of water or chicken stock to reach your preferred consistency. Bring to a gentle boil, then reduce the heat to low-medium and simmer for 20–25 minutes, uncovered or partially covered, until the chicken is tender and the sauce has thickened slightly.",
      "Season and finish: Taste the curry and season with salt and pepper. Stir in the lime juice (1–2 tbsp) to brighten the flavour. Add fresh or dried chili to taste if you prefer more heat. Simmer for another 1–2 minutes to allow the flavours to meld.",
      "Serve: Turn off the heat and sprinkle the curry with chopped fresh coriander. Serve hot with steamed rice, naan, or roti."
    ]
  }
]
