[
  {
    "id": "pandoro_tiramisu",
    "title": "ทีรามิสุแพนโดโร",
    "prep_time": "15 นาที",
    "cook_time": null,
    "total_time": "ทำล่วงหน้า 1 คืน",
    "image": "assets/images/categories/dessert/pandoro_tiramisu.jpg",
    "ingredients": [
      "ไข่แดง 5 ฟอง",
      "น้ำตาลทราย 150 กรัม",
      "มาสคาร์โพเน่ 700 กรัม",
      "ไข่ขาว 3 ฟอง",
      "กาแฟดำ 400 มล.",
      "มาร์ซาล่า 2 ช้อนโต๊ะ",
      "ขนมปัง pandoro 600 กรัม",
      "ผงโกโก้สำหรับโรย"
    ],
    "steps": [
      "เตรียมกาแฟโดยชงกาแฟดำให้เข้มข้นประมาณ 400 มล. แล้วพักให้เย็นสนิท จากนั้นคนให้เข้ากันกับมาร์ซาล่า วางพักไว้ (สามารถชงกาแฟเตรียมไว้ล่วงหน้าได้)",
      "แยกไข่แดง 5 ฟอง และไข่ขาว 3 ฟองลงคนละชาม ระวังไม่ให้ไข่แดงปนลงไปในไข่ขาวเพราะจะตีขึ้นฟูยาก",
      "ใส่น้ำตาลทราย 150 กรัมลงในชามไข่แดง ใช้เครื่องตีไฟฟ้าความเร็วปานกลาง ตีประมาณ 3–5 นาทีจนส่วนผสมสีอ่อนลง เนื้อข้นขึ้นเป็นริ้วและฟูเล็กน้อย",
      "ใส่มาสคาร์โพเน่ 700 กรัมลงในส่วนผสมไข่แดงทีละส่วน (แบ่งใส่ 2–3 ครั้ง) ตีพอให้เนียนเข้ากันเป็นครีม ไม่ควรตีแรงหรือนานเกินไปเพื่อไม่ให้ครีมแตกตัว",
      "ในชามอีกใบ ใช้เครื่องตีไฟฟ้าความเร็วปานกลาง–สูง ตีไข่ขาวจนขึ้นฟูเป็นยอดอ่อน (soft peak) คือยกหัวตีขึ้นแล้วปลายยอดเอนเล็กน้อย ใช้เวลาประมาณ 3–5 นาที ระวังไม่ตีจนแห้ง",
      "ตักไข่ขาวที่ตีฟูแล้วลงในส่วนผสมมาสคาร์โพเน่ทีละ 1/3 ส่วน ใช้พายยางตะล่อมเบา ๆ จากล่างขึ้นบนจนเข้ากัน ทำซ้ำจนใส่ไข่ขาวหมด จะได้ครีมที่ฟูเบาและยังเก็บอากาศไว้",
      "หั่นขนมปัง pandoro หนาแผ่นละประมาณ 1.5–2 ซม. ถ้ามีผิวด้านนอกแข็งมากสามารถเล็มออกเล็กน้อยเพื่อให้เรียบและจัดเรียงง่าย",
      "เตรียมภาชนะสำหรับจัดเสิร์ฟ (ถาดแก้วหรือพิมพ์เค้ก) จากนั้นนำแผ่น pandoro ชุบลงในส่วนผสมกาแฟผสมมาร์ซาล่าอย่างรวดเร็วด้านละประมาณ 1–2 วินาที ไม่ควรแช่นานเกินไปเพื่อไม่ให้ขนมแฉะ แล้วเรียงลงเป็นชั้นแรกให้เต็มก้นพิมพ์",
      "ปาดครีมมาสคาร์โพเน่ลงบนชั้น pandoro ให้ทั่วหนาประมาณ 1–2 ซม. จากนั้นทำซ้ำเป็นชั้น ๆ โดยสลับระหว่าง pandoro ชุบกาแฟและครีมจนหมด วางชั้นสุดท้ายเป็นครีมและเกลี่ยหน้าให้เรียบ",
      "คลุมภาชนะด้วยพลาสติกแรปให้แนบสนิท แล้วแช่เย็นช่องธรรมดาอย่างน้อย 8 ชั่วโมงหรือข้ามคืนเพื่อให้เนื้อเซ็ตตัวและรสชาติกลมกล่อมขึ้น ก่อนเสิร์ฟโรยหน้าด้วยผงโกโก้ผ่านกระชอนให้เป็นฝุ่นบาง ๆ แล้วตัดเป็นชิ้นเสิร์ฟ"
    ]
  },
  {
    "id": "choc_hazelnut_fudge_brownie_cake",
    "title": "เค้กช็อกโกแลตบราวนี่ฟัดจ์ถั่วเฮเซลนัท",
    "prep_time": "20 นาที",
    "cook_time": "35 นาที",
    "total_time": "55 นาที",
    "image": "assets/images/categories/dessert/choc_hazelnut_fudge_brownie_cake.jpg",
    "ingredients": [
      "เฮเซลนัทอบ 110 กรัม",
      "เนยเค็ม 185 กรัม",
      "ช็อกโกแลตดาร์ก 300 กรัม",
      "น้ำตาลทรายแดง 220 กรัม",
      "น้ำตาลทรายขาว 110 กรัม",
      "ผงโกโก้ 25 กรัม",
      "ไข่ 4 ฟอง",
      "แป้งอเนกประสงค์ 200 กรัม",
      "นูเทลล่า 1/3 ถ้วย"
    ],
    "steps": [
      "วอร์มเตาอบที่อุณหภูมิ 180°C ไฟบน–ล่าง เตรียมพิมพ์สี่เหลี่ยมขนาดประมาณ 20×20 ซม. โดยทาเนยหรือรองกระดาษรองอบให้ทั่วด้านล่างและข้างพิมพ์",
      "เทเฮเซลนัทลงบนถาดอบ เกลี่ยให้เป็นชั้นเดียว นำเข้าอบในเตา 8–10 นาทีจนหอมและผิวเริ่มเป็นสีน้ำตาลทอง จากนั้นพักให้เย็นแล้วสับหยาบ ๆ แยกไว้ (เก็บบางส่วนไว้โรยหน้าเค้ก)",
      "หั่นเนยเค็ม 185 กรัมและช็อกโกแลตดาร์ก 300 กรัมเป็นชิ้นเล็ก ๆ ใส่ลงในชามทนความร้อน วางชามบนหม้อน้ำร้อนเดือดอ่อน ๆ (วิธี double boiler) คนเป็นระยะจนเนยและช็อกโกแลตละลายเนียนเข้ากัน แล้วยกลงจากเตาพักให้เย็นลงเล็กน้อยประมาณ 5–10 นาที",
      "ในชามผสมใบใหญ่ ตอกไข่ 4 ฟอง ใส่น้ำตาลทรายแดง 220 กรัม และน้ำตาลทรายขาว 110 กรัม ใช้ตะกร้อมือหรือเครื่องตีไฟฟ้าความเร็วปานกลาง ตีประมาณ 3–5 นาทีจนส่วนผสมสีอ่อนลงและข้นขึ้นเล็กน้อย",
      "ค่อย ๆ เทส่วนผสมช็อกโกแลตที่ยังอุ่นแต่ไม่ร้อนจัดลงในชามไข่และน้ำตาล ขณะเทให้ตีหรือคนด้วยความเร็วต่ำอย่างต่อเนื่องจนเข้ากันดี",
      "ร่อนแป้งอเนกประสงค์ 200 กรัมและผงโกโก้ 25 กรัมลงในชามส่วนผสม ใช้พายยางตะล่อมเบา ๆ จากล่างขึ้นบนจนไม่เห็นผงแป้งแห้ง ระวังไม่คนแรงหรือนานเกินไปเพื่อให้เนื้อบราวนี่เนียนและยังคงความหนึบ",
      "ตักเฮเซลนัทสับส่วนใหญ่ (เก็บไว้โรยหน้าเล็กน้อย) ใส่ลงไปในแบตเทอร์แล้วพอคนให้กระจายตัว เทแบตเทอร์ลงในพิมพ์ที่เตรียมไว้ เกลี่ยหน้าให้เรียบ จากนั้นตักนูเทลล่า 1/3 ถ้วย หยอดเป็นจุด ๆ บนหน้าเค้ก ใช้ปลายมีดลากเป็นลายวนตามต้องการ แล้วโรยด้วยเฮเซลนัทที่เหลือ",
      "นำเข้าอบในเตา 30–35 นาที หรือจนผิวหน้าขึ้นเงาเกิดเปลือกบาง ๆ ตรงกลางยังดูชุ่มเล็กน้อย เมื่อลองเสียบไม้จิ้มฟันลงไปตรงกลางจะมีเศษเค้กชื้น ๆ ติดออกมา ไม่ควรแห้งสนิท",
      "นำพิมพ์ออกจากเตา พักเค้กไว้ในพิมพ์บนตะแกรงอย่างน้อย 1 ชั่วโมงจนเย็นและเนื้อเซ็ตตัวดีจึงยกออกจากพิมพ์ ตัดเป็นชิ้นสี่เหลี่ยม โรยผงโกโก้เพิ่มเล็กน้อยก่อนเสิร์ฟได้ตามชอบ"
    ]
  },
  {
    "id": "brown_butter_brown_sugar_cheesecake",
    "title": "ชีสเค้กบราวน์บัตเตอร์และน้ำตาลทรายแดง",
    "prep_time": "เริ่มทำล่วงหน้า 1 วัน",
    "cook_time": "1 ชั่วโมง",
    "total_time": "ข้ามคืน",
    "image": "assets/images/categories/dessert/brown_butter_brown_sugar_cheesecake.jpg",
    "ingredients": [
      "เนยจืด 100 กรัม (สำหรับฐานบิสกิต)",
      "เนยจืด 65 กรัม (สำหรับทำเนยสีน้ำตาล)",
      "บิสกิตบด 500 กรัม",
      "ครีมชีส 1 กก.",
      "น้ำตาลทรายแดง 300 กรัม",
      "ไข่ 5 ฟอง",
      "ไข่แดง 3 ฟอง",
      "วิปปิ้งครีม 125 มล."
    ],
    "steps": [
      "เตรียมพิมพ์ถอดก้นขนาดประมาณ 23 ซม. โดยรองก้นพิมพ์ด้วยกระดาษรองอบและทาเนยบาง ๆ ที่ขอบด้านข้าง ถ้าต้องการอบแบบรองน้ำ (water bath) ให้ห่อด้านนอกของพิมพ์ด้วยฟอยล์กันน้ำรั่ว",
      "ทำฐานบิสกิต: ละลายเนยจืด 100 กรัมในหม้อใบเล็กด้วยไฟอ่อนจนเนยละลายหมด จากนั้นเทลงในบิสกิตบด 500 กรัม คนให้ชุ่มทั่วกันจนบิสกิตมีลักษณะชื้นคล้ายทรายเปียก แล้วเทลงก้นพิมพ์ กดให้แน่นและเรียบด้วยหลังช้อนหรือก้นแก้ว",
      "นำฐานบิสกิตเข้าอบในเตาอุณหภูมิ 170°C ประมาณ 8–10 นาทีจนหอมและเซ็ตตัว จากนั้นนำออกมาพักให้เย็นลงจนถึงอุณหภูมิห้อง",
      "ทำเนยสีน้ำตาล: ใส่เนยจืด 65 กรัมลงในหม้อหรือกระทะก้นหนา เปิดไฟกลางค่อนอ่อน คอยคนเป็นระยะจนเนยละลายและเริ่มมีฟอง จากนั้นจะเห็นตะกอนนมสีขาวนอนก้น ค่อย ๆ เปลี่ยนเป็นสีน้ำตาลทองและมีกลิ่นหอมคล้ายถั่ว (ใช้เวลาประมาณ 4–5 นาที) เมื่อได้สีตามต้องการให้ยกลงจากเตาทันทีแล้วเทใส่ชามพักให้เย็นลง",
      "เปิดเตาอบที่อุณหภูมิ 150–160°C เตรียมถาดอบใบใหญ่สำหรับใส่น้ำร้อนหากต้องการใช้วิธี water bath ลดโอกาสหน้าเค้กแตก",
      "เตรียมไส้ชีสเค้ก: ใส่ครีมชีส 1 กก. ที่อุณหภูมิห้องลงในโถผสม ใช้เครื่องตีไฟฟ้าความเร็วต่ำ–ปานกลาง ตีประมาณ 2–3 นาทีจนเนียนไม่มีเม็ดและนุ่มฟูเล็กน้อย จากนั้นใส่น้ำตาลทรายแดง 300 กรัม ตีต่ออีก 2–3 นาทีจนเข้ากันดีและเนื้อข้นขึ้น",
      "ใส่ไข่ทั้งฟอง 5 ฟองและไข่แดง 3 ฟองลงไปทีละฟอง ตีด้วยความเร็วต่ำให้พอเข้ากันในแต่ละฟอง ระวังไม่ตีแรงหรือนานเกินไปเพื่อลดฟองอากาศในเนื้อเค้ก ขูดขอบโถเป็นระยะ",
      "เทวิปปิ้งครีม 125 มล. และเนยสีน้ำตาลที่เย็นแล้วลงในส่วนผสมครีมชีส ใช้ความเร็วต่ำตีจนเข้ากันดีและเนื้อเนียน จากนั้นเคาะโถเบา ๆ 2–3 ครั้งเพื่อไล่ฟองอากาศ",
      "เทไส้ชีสเค้กลงบนฐานบิสกิตที่เย็นแล้ว เกลี่ยหน้าให้เรียบ วางพิมพ์ลงในถาดอบใบใหญ่ เทน้ำร้อนลงในถาดให้สูงประมาณครึ่งหนึ่งของความสูงพิมพ์เพื่อทำ water bath",
      "นำเข้าอบในเตา 1 ชั่วโมงหรือจนขอบด้านนอกเซ็ตตัวดีแต่ตรงกลางยังสั่นเยิ้มเล็กน้อยเมื่อเขย่าพิมพ์เบา ๆ จากนั้นปิดเตาอบ เปิดประตูเตาแง้มไว้เล็กน้อย ปล่อยให้ชีสเค้กเย็นในเตาอีกประมาณ 1 ชั่วโมง",
      "ยกพิมพ์ออกจากถาดน้ำ วางบนตะแกรงให้เย็นจนถึงอุณหภูมิห้อง (ประมาณ 1–2 ชั่วโมง) จากนั้นแช่เย็นทั้งพิมพ์อย่างน้อย 6 ชั่วโมงหรือข้ามคืนจนเนื้อเซ็ตตัวเต็มที่ ก่อนเสิร์ฟให้ใช้มีดบาง ๆ แซะรอบขอบพิมพ์แล้วค่อย ๆ แกะออก ตัดเป็นชิ้นเสิร์ฟ"
    ]
  },
  {
    "id": "lemon_finger_lime_tart",
    "title": "ทาร์ตเลมอนและฟิงเกอร์ไลม์",
    "prep_time": "อย่างน้อย 7 ชั่วโมง",
    "cook_time": "20–30 นาที",
    "total_time": "ประมาณ 7 ชั่วโมง 30 นาที",
    "image": "assets/images/categories/dessert/lemon_finger_lime_tart.jpg",
    "ingredients": [
      "แป้งอเนกประสงค์ 250 กรัม",
      "น้ำตาลไอซิ่ง 85 กรัม",
      "เนยจืด 125 กรัม หั่นเต๋าเย็นจัด",
      "ไข่แดง 2 ฟอง",
      "วิปปิ้งครีม 300 มล.",
      "มาสคาร์โพเน่ 250 กรัม",
      "น้ำเลมอน 200 มล.",
      "น้ำตาลทราย 80 กรัม (สำหรับไส้เลมอน)",
      "ไข่มะนาว Finger Lime 4 ลูก"
    ],
    "steps": [
      "ทำแป้งทาร์ต: ใส่แป้งอเนกประสงค์ 250 กรัมและน้ำตาลไอซิ่ง 85 กรัมลงในชามผสม คนให้เข้ากัน จากนั้นใส่เนยจืดหั่นเต๋าเย็นจัด 125 กรัมลงไป ใช้นิ้วมือบี้เนยให้คลุกกับแป้งจนมีลักษณะเป็นเม็ดร่วนคล้ายทรายหยาบ ทำงานให้เร็วเพื่อไม่ให้เนยละลาย",
      "ใส่ไข่แดง 2 ฟองลงไป ใช้ส้อมหรือตะเกียบคนให้ส่วนผสมเริ่มเกาะตัว จากนั้นใช้มือรวบแป้งให้เป็นก้อน (ถ้าแป้งแห้งมากสามารถพรมน้ำเย็นทีละ 1 ช้อนโต๊ะเล็กน้อยได้) ปั้นเป็นก้อนแบนหนาประมาณ 2–3 ซม. ห่อด้วยพลาสติกแรปแล้วแช่เย็นอย่างน้อย 1 ชั่วโมงเพื่อให้กลูเตนคลายตัวและเนยเซ็ตตัว",
      "นำแป้งออกจากตู้เย็น พักที่อุณหภูมิห้อง 5–10 นาทีให้คลายตัวเล็กน้อย จากนั้นโรยแป้งนวลบนโต๊ะ ใช้ไม้คลึงแป้งคลึงให้เป็นแผ่นหนาประมาณ 3 มม. กว้างพอที่จะกรุพิมพ์ทาร์ต",
      "กรุแป้งลงในพิมพ์ทาร์ต กดให้แนบกับก้นและขอบพิมพ์ ตัดขอบส่วนเกินออก ใช้ส้อมจิ้มก้นแป้งให้ทั่วเพื่อป้องกันไม่ให้พองตัว จากนั้นแช่พิมพ์ที่กรุแป้งแล้วในตู้เย็นอีก 30 นาทีเพื่อให้แป้งเซ็ตตัว",
      "วอร์มเตาอบที่อุณหภูมิ 180°C ใช้กระดาษรองอบปูทับบนแป้งทาร์ตแล้วใส่ลูกเซรามิกสำหรับอบ (baking beans) หรือถั่วเมล็ดแห้งทับให้ทั่ว เพื่ออบแบบถ่วงน้ำหนัก (blind bake)",
      "นำแป้งทาร์ตเข้าอบ 15–20 นาที จากนั้นนำกระดาษและลูกถั่วออก อบต่ออีก 5–10 นาทีจนขอบและก้นแป้งเป็นสีทองอ่อนและกรอบ นำออกจากเตา พักให้เย็นสนิทในพิมพ์ (ใช้เวลาประมาณ 30–60 นาที)",
      "ระหว่างรอให้ฐานทาร์ตเย็น เตรียมไส้เลมอน: ใส่วิปปิ้งครีม 300 มล. และมาสคาร์โพเน่ 250 กรัมลงในชามผสม ใช้เครื่องตีไฟฟ้าความเร็วปานกลาง ตีประมาณ 3–4 นาทีจนเนื้อเนียนและข้นขึ้นเล็กน้อย",
      "ค่อย ๆ ใส่น้ำเลมอน 200 มล. ลงในส่วนผสมครีมทีละน้อย พร้อมกับใส่น้ำตาลทราย 80 กรัม ตีด้วยความเร็วต่ำให้เข้ากันช้า ๆ จนน้ำตาลละลายและส่วนผสมมีรสเปรี้ยวหวานกลมกล่อม ชิมและปรับรสเพิ่มเติมได้ตามชอบ (หากเนื้อเหลวเกินไปสามารถแช่เย็นให้เซ็ตตัวเล็กน้อยก่อนเทใส่ฐาน)",
      "เทไส้เลมอนลงในฐานทาร์ตที่เย็นแล้ว เกลี่ยหน้าให้เรียบ นำไปแช่เย็นอย่างน้อย 4 ชั่วโมงหรือจนไส้เซ็ตตัวพอหั่นได้สวย",
      "ก่อนเสิร์ฟ ผ่าครึ่งไข่มะนาว finger lime 4 ลูก บีบเบา ๆ ให้ไข่มุกใส ๆ ดันออกมา ใช้ตกแต่งบนหน้าทาร์ตพร้อมกับปาดมาสคาร์โพเน่เพิ่มเป็นจุด ๆ หรือบีบเป็นลาย ให้ดูสวยงาม จากนั้นนำออกจากพิมพ์และตัดเสิร์ฟ"
    ]
  },
  {
    "id": "cheats_mille_feuille",
    "title": "มิลล์เฟยแบบง่าย",
    "prep_time": "30 นาที",
    "cook_time": "20 นาที",
    "total_time": "50 นาที",
    "image": "assets/images/categories/dessert/cheats_mille_feuille.jpg",
    "ingredients": [
      "แป้งพัฟ 375 กรัม",
      "น้ำตาลไอซิ่งสำหรับโรยและเพิ่มความกรอบ",
      "วิปปิ้งครีม 300 มล.",
      "คัสตาร์ดวานิลลา 200 กรัม",
      "เบอร์รี่รวม ตามชอบ (เช่น สตรอว์เบอร์รี่ บลูเบอร์รี่ ราสป์เบอร์รี่)"
    ],
    "steps": [
      "วอร์มเตาอบที่อุณหภูมิ 200°C เตรียมถาดอบรองด้วยกระดาษรองอบ",
      "คลี่แป้งพัฟ 375 กรัมออกบนโต๊ะ โรยแป้งนวลเล็กน้อยถ้าจำเป็น ใช้มีดคมตัดเป็นแผ่นสี่เหลี่ยมหรือสี่เหลี่ยมผืนผ้าขนาดเท่า ๆ กันตามขนาดที่ต้องการของชิ้นขนม (เช่น 4×10 ซม.)",
      "ย้ายแป้งพัฟที่ตัดแล้วไปวางบนถาดอบ ใช้ส้อมจิ้มให้ทั่วแผ่นเพื่อป้องกันไม่ให้แป้งพองตัวมากเกินไป จากนั้นโรยน้ำตาลไอซิ่งบาง ๆ ให้ทั่วแผ่นเพื่อช่วยให้ผิวหน้ากรอบและคาราเมลเล็กน้อยเมื่ออบ",
      "วางกระดาษรองอบอีกแผ่นทับด้านบนของแป้ง แล้ววางถาดอบอีกใบทับเพื่อถ่วงน้ำหนัก (ช่วยให้แป้งพัฟพองน้อยและกรอบเป็นแผ่นเรียบ) นำเข้าอบประมาณ 15–20 นาทีจนแป้งสุกกรอบและเป็นสีทอง นำถาดทับออกและอบต่ออีก 2–3 นาทีหากต้องการให้กรอบมากขึ้น จากนั้นนำออกจากเตา พักให้เย็นสนิทบนตะแกรง",
      "ระหว่างอบแป้งพัฟ เตรียมไส้ครีม: ใส่วิปปิ้งครีม 300 มล. ที่เย็นจัดลงในชาม ใช้เครื่องตีไฟฟ้าความเร็วปานกลาง–สูง ตีจนขึ้นฟูเป็นยอดอ่อน จากนั้นใส่คัสตาร์ดวานิลลา 200 กรัมลงไป ใช้ความเร็วต่ำตีต่อจนส่วนผสมเข้ากันเนียนดี (ระวังไม่ตีแรงเกินไปเพื่อไม่ให้ครีมแยกตัว)",
      "ล้างและซับเบอร์รี่รวมให้แห้ง หั่นสตรอว์เบอร์รี่เป็นชิ้นพอดีคำ หากใช้ผลไม้ลูกเล็กเช่นบลูเบอร์รี่หรือราสป์เบอร์รี่สามารถใช้ทั้งลูกได้",
      "ประกอบชั้นขนม: วางแผ่นแป้งพัฟชั้นแรกบนจานเสิร์ฟ บีบหรือปาดครีมคัสตาร์ดลงเป็นชั้นหนา ๆ วางเบอร์รี่เรียงด้านบน จากนั้นวางแผ่นแป้งพัฟแผ่นที่สองทับ ทำซ้ำอีก 2–3 ชั้นตามต้องการ โดยจบชั้นสุดท้ายด้วยแป้งพัฟ",
      "ก่อนเสิร์ฟ โรยน้ำตาลไอซิ่งบนหน้าชั้นบนสุดผ่านกระชอนให้เป็นฝุ่นบาง ๆ สามารถตกแต่งด้วยเบอร์รี่เพิ่มด้านบนสุดเพื่อความสวยงาม เสิร์ฟทันทีเพื่อให้สัมผัสกรอบของแป้งพัฟและครีมนุ่มฟู"
    ]
  }
]
