[
  {
    "id": "iced_lemon_tea",
    "title": "ชามะนาวเย็น",
    "prep_time": "10 นาที",
    "cook_time": null,
    "total_time": "1 ชั่วโมง 10 นาที",
    "image": "assets/images/categories/drink/iced_lemon_tea.jpg",
    "ingredients": [
      "ชาดำ 1 ซอง",
      "น้ำร้อน 150 มล.",
      "น้ำเลมอน 1 ช้อนโต๊ะ",
      "น้ำเชื่อม (ตามชอบ)",
      "น้ำแข็ง",
      "เลมอนฝาน"
    ],
    "steps": [
      "ชงชา: ต้มน้ำให้เดือดแล้วตักน้ำร้อน 150 มล. ใส่ลงในแก้วหรือเหยือกทนความร้อน ใส่ชาดำ 1 ซองลงไป แช่ทิ้งไว้ประมาณ 3–5 นาที (ถ้าชอบเข้มให้แช่นานขึ้นเล็กน้อย แต่ไม่เกิน 7 นาทีเพื่อไม่ให้ชาออกขม) จากนั้นนำถุงชาออกและพักไว้ให้เย็นลงที่อุณหภูมิห้อง ประมาณ 10–15 นาที",
      "ทำชาหวานเลมอน: เมื่อน้ำชาเริ่มเย็น ใส่น้ำเลมอน 1 ช้อนโต๊ะลงไป คนให้เข้ากัน จากนั้นเติมน้ำเชื่อมทีละ 1 ช้อนโต๊ะ ชิมและปรับรสให้ได้ความหวาน–เปรี้ยวตามชอบ คนจนน้ำเชื่อมละลายดี",
      "แช่เย็น: เทชาหวานเลมอนใส่ภาชนะที่มีฝาปิด (เช่น ขวดแก้วหรือเหยือก) ปิดฝา นำไปแช่ตู้เย็นช่องธรรมดาประมาณ 1 ชั่วโมง หรือจนชาดำเย็นจัด",
      "จัดเสิร์ฟ: เตรียมแก้วใส่น้ำแข็งให้เต็มแก้ว เทชาดำเลมอนเย็นจัดลงไปจนเกือบเต็ม ตกแต่งด้วยเลมอนฝานที่ขอบแก้วหรือลอยในแก้ว สามารถเติมน้ำเลมอนหรือน้ำเชื่อมเพิ่มเล็กน้อยแล้วคนเบา ๆ ก่อนดื่มได้ตามชอบ"
    ]
  },
  {
    "id": "mango_smoothie",
    "title": "สมูทตี้มะม่วง",
    "prep_time": "5 นาที",
    "cook_time": null,
    "total_time": "5 นาที",
    "image": "assets/images/categories/drink/mango_smoothie.jpg",
    "ingredients": [
      "มะม่วงแช่แข็ง 2 ถ้วย",
      "กล้วย 1 ลูก (หั่นเป็นชิ้น)",
      "กรีกโยเกิร์ต 1/2 ถ้วย",
      "นม 1/2 ถ้วย",
      "น้ำผึ้ง 1 ช้อนโต๊ะ (หรือปรับตามชอบ)",
      "น้ำมะนาว 1 ช้อนชา"
    ],
    "steps": [
      "เตรียมส่วนผสม: หากใช้มะม่วงสดให้หั่นมะม่วงเป็นชิ้นแล้วนำไปแช่แข็งจนแข็ง เพื่อให้ได้เนื้อสมูทตี้ที่ข้นและเย็น จัดเตรียมกล้วยปอกเปลือกแล้วหั่นเป็นชิ้น ๆ",
      "ปั่นสมูทตี้: ใส่มะม่วงแช่แข็ง 2 ถ้วย กล้วย 1 ลูก กรีกโยเกิร์ต 1/2 ถ้วย นม 1/2 ถ้วย น้ำผึ้ง 1 ช้อนโต๊ะ และน้ำมะนาว 1 ช้อนชาลงในโถปั่น ปิดฝาให้สนิท จากนั้นปั่นด้วยความเร็วสูงประมาณ 30–60 วินาที หรือจนส่วนผสมเนียนละเอียดและข้น",
      "ปรับรสและความข้น: เปิดฝากดชิมรส หากต้องการหวานเพิ่มให้ใส่น้ำผึ้งเพิ่มทีละเล็กน้อยแล้วปั่นต่อ หากเนื้อข้นเกินไปให้เติมนมเพิ่มเล็กน้อยแล้วปั่นอีกครั้งจนได้ความข้นตามต้องการ",
      "เสิร์ฟ: เทสมูทตี้ลงในแก้วทันที สามารถโรยมะม่วงหั่นเต๋าเล็ก ๆ หรือกล้วยฝานตกแต่งด้านบน และเสิร์ฟทันทีขณะยังเย็นจัด"
    ]
  },
  {
    "id": "iced_caramel_latte",
    "title": "คาราเมลลาเต้เย็น",
    "prep_time": "2 นาที",
    "cook_time": "3 นาที",
    "total_time": "5 นาที",
    "image": "assets/images/categories/drink/iced_caramel_latte.jpg",
    "ingredients": [
      "กาแฟเข้ม 1/2 ถ้วย (เช่น เอสเพรสโซ่ช็อตหรือกาแฟดริปเข้มข้น)",
      "คาราเมลซอส 1 ช้อนโต๊ะ",
      "น้ำตาล (ตามชอบ)",
      "นมสด 1/2 ถ้วย",
      "วิปปิ้งครีม (ตัวเลือก)",
      "น้ำแข็ง"
    ],
    "steps": [
      "เตรียมกาแฟ: ชงกาแฟให้ได้ปริมาณประมาณ 1/2 ถ้วย (เช่น เอสเพรสโซ่ 1–2 ช็อต หรือกาแฟดริปเข้มข้น) หากกาแฟยังร้อน ให้พักไว้ 2–3 นาทีให้เย็นลงเล็กน้อยเพื่อไม่ให้น้ำแข็งละลายเร็วเกินไป",
      "ปรุงกาแฟคาราเมล: ใส่คาราเมลซอส 1 ช้อนโต๊ะลงในแก้วหรือเหยือกใบเล็ก ตามด้วยน้ำตาลปริมาณเล็กน้อย (เช่น 1 ช้อนชา) ตามระดับความหวานที่ต้องการ เทกาแฟร้อนหรืออุ่นลงไป คนให้คาราเมลและน้ำตาลละลายเข้ากันดี จากนั้นพักไว้ให้เย็นลงอีกเล็กน้อย (ถ้าต้องการเย็นเร็วสามารถเติมน้ำแข็ง 2–3 ก้อนแล้วคน แล้วค่อยคัดน้ำแข็งออก)",
      "จัดแก้ว: เตรียมแก้วใส่น้ำแข็งประมาณ 3/4 ของแก้ว เทส่วนผสมกาแฟคาราเมลลงไปบนก้อนน้ำแข็ง",
      "เติมนม: เทนมสด 1/2 ถ้วยลงไปในแก้วกาแฟคาราเมล คนให้เข้ากัน ชิมรส ถ้าชอบหวานเพิ่มสามารถใส่คาราเมลซอสหรือน้ำตาลเพิ่มเล็กน้อยแล้วคนให้เข้ากันอีกครั้ง",
      "ตกแต่งและเสิร์ฟ: หากต้องการ ให้บีบวิปปิ้งครีมลงบนด้านบนของกาแฟเย็น และราดคาราเมลซอสเป็นลวดลายด้านบน จากนั้นเสิร์ฟทันที"
    ]
  },
  {
    "id": "strawberry_milkshake",
    "title": "มิลค์เชคสตรอว์เบอร์รี่",
    "prep_time": "5 นาที",
    "cook_time": null,
    "total_time": "5 นาที",
    "image": "assets/images/categories/drink/strawberry_milkshake.jpg",
    "ingredients": [
      "สตรอว์เบอร์รี่ 1/2 ถ้วย (สดหรือแช่แข็ง)",
      "นม 120 มล.",
      "ไอศกรีมวานิลลา 1 สกู๊ปใหญ่",
      "น้ำตาล (ตามชอบ)"
    ],
    "steps": [
      "เตรียมสตรอว์เบอร์รี่: ล้างสตรอว์เบอร์รี่ให้สะอาด ตัดขั้วออก หากใช้ลูกใหญ่ให้หั่นเป็นชิ้นเล็กเพื่อปั่นง่าย ถ้าใช้สตรอว์เบอร์รี่แช่แข็งสามารถใช้ได้โดยไม่ต้องละลายน้ำแข็ง เพื่อให้มิลค์เชคเย็นจัดและข้น",
      "ปั่นมิลค์เชค: ใส่สตรอว์เบอร์รี่ 1/2 ถ้วย นม 120 มล. และไอศกรีมวานิลลา 1 สกู๊ป ลงในโถปั่น ปิดฝาแล้วปั่นด้วยความเร็วสูงประมาณ 30–45 วินาทีจนส่วนผสมเนียนละเอียด หากใช้สตรอว์เบอร์รี่สดและต้องการมิลค์เชคที่เย็นจัดสามารถเติมน้ำแข็งก้อนเล็กน้อยแล้วปั่นรวมได้",
      "ปรับรส: เปิดฝากดชิม หากต้องการหวานเพิ่มให้ใส่น้ำตาลทีละ 1 ช้อนชาแล้วปั่นต่อให้เข้ากันจนได้ระดับความหวานตามต้องการ",
      "เสิร์ฟ: เทมิลค์เชคลงในแก้ว สามารถตกแต่งด้วยสตรอว์เบอร์รี่หั่นครึ่งบนขอบแก้ว หรือโรยเศษคุกกี้/เกล็ดน้ำตาลเพิ่มเล็กน้อย แล้วเสิร์ฟทันที"
    ]
  },
  {
    "id": "lime_soda",
    "title": "โซดามะนาว",
    "prep_time": "10 นาที",
    "cook_time": null,
    "total_time": "10 นาที",
    "image": "assets/images/categories/drink/lime_soda.jpg",
    "ingredients": [
      "น้ำมะนาว 1 ช้อนโต๊ะ",
      "น้ำเชื่อม 1–2 ช้อนโต๊ะ",
      "โซดา 150 มล.",
      "น้ำแข็ง",
      "มะนาวฝาน/ใบมิ้นต์"
    ],
    "steps": [
      "เตรียมแก้ว: ใส่น้ำแข็งลงในแก้วให้เต็มประมาณ 3/4 ของแก้ว หรือมากน้อยตามต้องการ",
      "ผสมส่วนฐาน: ในแก้วอีกใบหรือในก้นแก้วเสิร์ฟ ใส่น้ำมะนาว 1 ช้อนโต๊ะ ตามด้วยน้ำเชื่อม 1–2 ช้อนโต๊ะ (เริ่มจาก 1 ช้อนโต๊ะก่อนแล้วค่อยปรับเพิ่ม) คนให้น้ำเชื่อมละลายเข้ากับน้ำมะนาว หากต้องการให้เย็นจัดสามารถคนกับน้ำแข็งเล็กน้อย",
      "เติมโซดา: เทส่วนผสมน้ำมะนาว–น้ำเชื่อมลงในแก้วที่ใส่น้ำแข็ง แล้วค่อย ๆ เติมโซดา 150 มล. ลงไปอย่างเบามือ เพื่อรักษาฟองของโซดาไม่ให้หายเร็ว จากนั้นใช้ช้อนยาวคนเบา ๆ 1–2 รอบให้ส่วนผสมเข้ากัน",
      "ตกแต่งและเสิร์ฟ: ตกแต่งด้านบนด้วยมะนาวฝานหรือใบมิ้นต์เล็กน้อย ชิมรส หากต้องการหวานหรือเปรี้ยวเพิ่มสามารถเติมน้ำเชื่อมหรือน้ำมะนาวเพิ่มเล็กน้อยแล้วคนเบา ๆ ก่อนดื่ม เสิร์ฟทันทีขณะยังมีฟองโซดา"
    ]
  }
]
