[
  {
    "id": "spanish_seafood_paella",
    "title": "ปาเอญ่าทะเลสเปน",
    "prep_time": "20 นาที",
    "cook_time": "40 นาที",
    "total_time": "1 ชั่วโมง",
    "image": "assets/images/categories/maincourse/spanish_seafood_paella.jpg",
    "ingredients": [
      "น้ำมันมะกอก 1/4 ถ้วย",
      "หอมใหญ่สับ 1 ลูก",
      "พริกหยวกสับ 1 ลูก",
      "กระเทียม 4 กลีบ",
      "มะเขือเทศรม่า 3 ลูก หรือ ซอสมะเขือเทศ 8 oz",
      "ใบกระวาน 1 ใบ",
      "ปาปริก้า 1 ช้อนชา",
      "หญ้าฝรั่น 1 หยิบมือ",
      "เกลือและพริกไทย",
      "ไวน์ขาว 1/4 ถ้วย",
      "ไก่น่องไร้กระดูก 4 ชิ้น",
      "พาร์สลีย์สับ 1/4 ถ้วย",
      "ข้าวสเปน 2 ถ้วย",
      "น้ำสต๊อกไก่ 5 ถ้วย",
      "ถั่วลันเตา 1/2 ถ้วย",
      "กุ้ง 12 ตัว",
      "หอยแมลงภู่ 10–12 ตัว",
      "ปลาหมึกหั่นแหวน 8 oz"
    ],
    "steps": [
      "เตรียมวัตถุดิบ: ซับไก่น่องไร้กระดูกให้แห้งด้วยกระดาษทิชชู่ แล้วหั่นเป็นชิ้นพอดีคำ (หรือจะใส่ทั้งชิ้นก็ได้ตามชอบ) โรยเกลือและพริกไทยเล็กน้อยพักไว้ ขูดหรือสับมะเขือเทศให้ละเอียด (ถ้าใช้ผลสด) หรือเตรียมซอสมะเขือเทศให้พร้อม",
      "ตั้งกระทะแบนก้นตื้นแบบพาเอญ่า (หรือกระทะก้นแบนใหญ่) ใส่น้ำมันมะกอก 1/4 ถ้วย เปิดไฟกลางค่อนแรง รอให้น้ำมันร้อน จากนั้นใส่ไก่ลงไปจี่ให้ผิวด้านนอกเกรียมนิด ๆ ประมาณด้านละ 3–4 นาที (ยังไม่ต้องสุกถึงข้างใน) ตักไก่ขึ้นพักไว้",
      "ลดไฟลงเป็นไฟกลาง ใส่หอมใหญ่สับและพริกหยวกสับลงในกระทะใบเดิม ผัดประมาณ 5–7 นาทีจนหอมใหญ่เริ่มใสและนิ่ม จากนั้นใส่กระเทียมสับลงไป ผัดต่ออีก 1–2 นาทีจนหอม (ระวังไม่ให้กระเทียมไหม้)",
      "เติมมะเขือเทศสับหรือซอสมะเขือเทศลงในกระทะ คนให้เข้ากัน ใส่ใบกระวาน ปาปริก้า หญ้าฝรั่น เกลือ และพริกไทย ผัดต่ออีกประมาณ 3–5 นาทีให้มะเขือเทศเริ่มข้นขึ้นและเครื่องเทศหอมขึ้น",
      "เทไวน์ขาว 1/4 ถ้วยลงไป ใช้พายไม้ขูดก้นกระทะเบา ๆ เพื่อดึงคราบสีน้ำตาลจากการจี่ไก่ให้ละลายเข้ากับซอส ลดไฟลงเป็นไฟกลาง–อ่อน เคี่ยวให้ส่วนผสมเดือดปุด ๆ เบา ๆ ประมาณ 10 นาทีจนกลิ่นแอลกอฮอล์จางและซอสเริ่มงวดเล็กน้อย",
      "ใส่ไก่ที่จี่ไว้กลับลงกระทะ พร้อมพาร์สลีย์สับ 1/4 ถ้วย คลุกให้ตัวไก่เคลือบด้วยซอสอย่างทั่วถึง",
      "ใส่ข้าวสเปน 2 ถ้วยลงไป กระจายให้ทั่วกระทะ ใช้พายคนให้ข้าวสัมผัสซอสทุกเม็ด ผัดประมาณ 1–2 นาทีเพื่อให้ข้าวเคลือบด้วยน้ำมันและซอส แต่ไม่ต้องผัดนาน",
      "เทน้ำสต๊อกไก่ 5 ถ้วยลงไปในกระทะ คนครั้งสุดท้ายเพื่อให้ข้าวกระจายตัวให้ทั่ว แล้วปล่อยให้เดือด จากนั้นลดไฟลงเป็นไฟกลางค่อนอ่อน เคี่ยวให้เดือดเบา ๆ โดย **ไม่ต้องคน** ประมาณ 15–18 นาที ระหว่างนี้ถ้าน้ำงวดเร็วเกินไปสามารถเติมน้ำสต๊อกร้อนทีละน้อยที่ขอบกระทะได้",
      "เมื่อข้าวเริ่มบานและน้ำงวดเหลือเพียงเล็กน้อย ให้เรียงกุ้ง หอยแมลงภู่ (วางด้านเปลือกโค้งลงด้านล่าง) ปลาหมึกหั่นแหวน และโรยถั่วลันเตา 1/2 ถ้วยลงบนหน้า ขยับไฟให้เท่ากันทั่วกระทะ ปิดฝา (หรือใช้ฟอยล์คลุม) แล้วเคี่ยวต่ออีกประมาณ 5–8 นาทีจนกุ้งเปลี่ยนเป็นสีส้ม หอยแมลงภู่เปิดฝา และปลาหมึกสุกนิ่ม",
      "ปิดไฟแล้วพักพาเอญ่าทั้งกระทะทิ้งไว้ 10 นาทีโดยยังปิดฝาอยู่ เพื่อให้ข้าวเซ็ตตัวและด้านล่างเกิด socarrat (ข้าวเกรียมบาง ๆ หอม ๆ) จากนั้นโรยพาร์สลีย์สับเพิ่มตามชอบ เสิร์ฟร้อน ๆ ในกระทะ"
    ]
  },
  {
    "id": "moroccan_lamb_tagine",
    "title": "ทาจีนเนื้อแกะโมร็อกโก",
    "prep_time": "15 นาที",
    "cook_time": "2 ชั่วโมง",
    "total_time": "2 ชั่วโมง 15 นาที",
    "image": "assets/images/categories/maincourse/moroccan_lamb_tagine.jpg",
    "ingredients": [
      "เนื้อแกะ 1–1.6 กก. (หั่นชิ้น)",
      "ผงผักชี 1 ช้อนโต๊ะ",
      "ผงยี่หร่า 1 ช้อนโต๊ะ",
      "กระวานป่น 2 ช้อนชา",
      "ขมิ้นผง 2 ช้อนชา",
      "ผงเฟนเนล 1.5 ช้อนชา",
      "ปาปริก้าเผ็ด 1 ช้อนชา",
      "เกลือ",
      "น้ำมัน 3 ช้อนโต๊ะ",
      "กระเทียม 3 กลีบ",
      "หอมใหญ่ 2 ลูก",
      "ซอสมะเขือเทศ 1.5 ช้อนโต๊ะ",
      "ขิงขูด 2 ช้อนชา",
      "อบเชย 2 แท่ง",
      "น้ำสต๊อกไก่ 2.5 ถ้วย",
      "แอปริคอตแห้ง 1 ถ้วย",
      "อัลมอนด์อบ 1/2 ถ้วย",
      "ผิวเลมอนขูดและผักชีสำหรับตกแต่ง"
    ],
    "steps": [
      "เตรียมเครื่องเทศ: ผสมผงผักชี ผงยี่หร่า กระวานป่น ขมิ้นผง ผงเฟนเนล ปาปริก้าเผ็ด และเกลือ 1–1.5 ช้อนชา ลงในชามเล็ก คนให้เข้ากันดี",
      "ซับเนื้อแกะให้แห้งด้วยกระดาษทิชชู่ แล้วใส่ลงในชามใบใหญ่ โรยส่วนผสมเครื่องเทศทั้งหมดลงไป ใช้มือลูบคลุกให้เครื่องเทศเคลือบเนื้อแกะทุกชิ้นให้ทั่ว พักไว้ประมาณ 10–15 นาทีให้เครื่องเทศซึมเข้าเนื้อ",
      "ตั้งหม้อ tagine หรือหม้อเหล็กหนา (แบบก้นหนา) ใส่น้ำมัน 2–3 ช้อนโต๊ะ เปิดไฟกลางค่อนแรง รอให้น้ำมันร้อน จากนั้นนำเนื้อแกะลงไปทอดทีละชุดไม่ให้แออัด จี่ให้ด้านนอกเป็นสีน้ำตาลทุกด้าน ใช้เวลาชุดละประมาณ 5–7 นาที ตักเนื้อขึ้นพัก ทำซ้ำจนหมด",
      "ลดไฟลงเป็นไฟกลาง ใส่หอมใหญ่หั่นบางหรือสับลงในหม้อใบเดิม ผัดประมาณ 5–7 นาทีจนหอมนิ่มใส ใส่กระเทียมสับและขิงขูดลงไป ผัดต่ออีก 1–2 นาทีจนหอม",
      "ใส่ซอสมะเขือเทศ 1.5 ช้อนโต๊ะลงไป ผัดให้กลิ่นดิบของซอสหายไปเล็กน้อย (ประมาณ 1–2 นาที) จากนั้นใส่แท่งอบเชย 2 แท่งลงในหม้อ คนให้เข้ากัน",
      "คืนเนื้อแกะที่ทอดไว้ลงในหม้อ เติมน้ำสต๊อกไก่ 2.5 ถ้วย หรือให้ท่วมเนื้อพอประมาณ คนเล็กน้อยให้ทุกอย่างกระจายตัว ปิดฝาหม้อ เปิดไฟให้เดือด จากนั้นลดไฟลงเป็นไฟอ่อน เคี่ยวตุ๋นเบา ๆ ประมาณ 45 นาที โดยระหว่างเคี่ยวให้คอยเช็กว่าของเหลวไม่งวดจนแห้งเกินไป ถ้าจำเป็นสามารถเติมน้ำสต๊อกหรือน้ำร้อนเล็กน้อย",
      "เมื่อครบ 45 นาที ใส่แอปริคอตแห้ง 1 ถ้วยลงในหม้อ คนให้กระจายตัว ปิดฝาเคี่ยวต่อด้วยไฟอ่อนอีกประมาณ 45–60 นาที หรือจนกว่าเนื้อแกะจะนุ่มมาก ใช้ส้อมจิ้มแล้วเนื้อหลุดออกง่าย ซอสข้นขึ้นและเคลือบเนื้อและแอปริคอต",
      "ชิมและปรับรสด้วยเกลือเพิ่มตามชอบ ปิดไฟ ตักอบเชยออกก่อนเสิร์ฟ โรยหน้าด้วยอัลมอนด์อบ ผิวเลมอนขูด และใบผักชีสับ เสิร์ฟร้อน ๆ คู่กับคูสคูส ข้าว หรือขนมปังแผ่นตามชอบ"
    ]
  },
  {
    "id": "miso_glazed_black_cod",
    "title": "ปลาค็อดดำซอสมิโสะ",
    "prep_time": "10 นาที",
    "cook_time": "10–14 นาที",
    "total_time": "2–3 วัน + 20 นาที",
    "image": "assets/images/categories/maincourse/miso_glazed_black_cod.jpg",
    "ingredients": [
      "สาเก 1/4 ถ้วย",
      "มิริน 1/4 ถ้วย",
      "มิโสะขาว 1/4 ถ้วย",
      "น้ำตาล 3 ช้อนโต๊ะ",
      "เนื้อปลาคอดดำ 4 ชิ้น"
    ],
    "steps": [
      "เตรียมน้ำหมัก: ใส่สาเก 1/4 ถ้วย และมิริน 1/4 ถ้วยลงในหม้อเล็ก ๆ ตั้งไฟกลาง–อ่อน รอจนเดือดเบา ๆ แล้วเคี่ยวต่อประมาณ 30 วินาที–1 นาทีเพื่อให้แอลกอฮอล์ระเหยออก ปิดไฟแล้วยกหม้อออกจากเตา",
      "ขณะส่วนผสมยังอุ่นอยู่ ใส่มิโสะขาว 1/4 ถ้วย และน้ำตาล 3 ช้อนโต๊ะลงไป ใช้ตะกร้อมือคนจนมิโสะและน้ำตาลละลายเข้ากันดี ได้ส่วนผสมน้ำหมักเนื้อข้นเนียน ปล่อยให้เย็นลงจนถึงอุณหภูมิห้อง",
      "เตรียมปลา: ซับเนื้อปลาคอดดำ 4 ชิ้นให้แห้งด้วยกระดาษทิชชู่ หากชิ้นหนามากสามารถกรีดบั้งตื้น ๆ ที่ผิวหนัง 1–2 รอยเพื่อให้ความร้อนเข้าได้ดีและน้ำหมักซึมเข้าเล็กน้อย",
      "หมักปลา: ใช้ภาชนะตื้นที่มีฝาปิด หรือถุงซิปล็อก ใส่น้ำหมักที่เย็นแล้วลงไปประมาณครึ่งหนึ่ง วางชิ้นปลาคอดลงในภาชนะ จากนั้นเทน้ำหมักที่เหลือทับด้านบน ใช้ช้อนหรือมือสะอาดทาน้ำหมักให้เคลือบเนื้อปลาโดยรอบ ปิดฝาภาชนะหรือปิดปากถุงให้สนิท วางในตู้เย็นช่องธรรมดา หมักอย่างน้อย 2 วัน และไม่เกิน 3 วัน ระหว่างหมักสามารถกลับด้านปลา 1 ครั้งต่อวันเพื่อให้น้ำหมักซึมทั่วถึง",
      "วันจะย่างปลา: เปิดเตาอบที่อุณหภูมิ 200°C หรือเปิดโหมดย่าง/กริลล์ (ถ้ามี) ปูถาดอบด้วยกระดาษรองอบหรือฟอยล์แล้วทาน้ำมันบาง ๆ เพื่อกันติดตะแกรง นำปลาคอดออกจากตู้เย็น ใช้มือปาดน้ำหมักส่วนเกินออกเบา ๆ (ไม่ต้องล้างน้ำ) เพราะน้ำหมักที่หนาเกินไปจะไหม้เร็ว",
      "วางปลาคอดบนถาดโดยให้ด้านหนังคว่ำลง (ถ้าต้องการให้หนังกรอบ สามารถเริ่มย่างด้านหนังขึ้นก่อนแล้วพลิกทีหลัง) นำเข้าอบหรือย่างประมาณ 10–14 นาที ขึ้นกับความหนาของชิ้นปลา โดยในช่วงท้ายให้คอยสังเกตผิวด้านบน ถ้าใช้โหมดกริลล์ผิวจะเกรียมเป็นสีน้ำตาลทอง มีรอยไหม้เล็กน้อยแต่ไม่ไหม้ดำ เนื้อปลาจะสุกเมื่อใช้ส้อมจิ้มแล้วเนื้อแยกเป็นแผ่นได้ง่ายและตรงกลางไม่ใส",
      "เมื่อตัวปลาสุกดี นำออกจากเตา พักบนถาด 2–3 นาที แล้วจัดเสิร์ฟทันที สามารถเสิร์ฟคู่กับข้าวญี่ปุ่นร้อน ๆ ผักนึ่ง หรือผักย่างตามชอบ"
    ]
  },
  {
    "id": "chicken_tikka_masala",
    "title": "ไก่ติกก้ามาซาลา",
    "prep_time": "15 นาที",
    "cook_time": "45 นาที",
    "total_time": "1 ชั่วโมง",
    "image": "assets/images/categories/maincourse/chicken_tikka_masala.jpg",
    "ingredients": [
      "ไก่น่อง 600 กรัม",
      "โยเกิร์ต 1/2 ถ้วย",
      "กระเทียม 6 กลีบ",
      "ขิงขูด 1 ช้อนโต๊ะ",
      "garam masala, cumin, coriander, paprika, cayenne",
      "ซอสมะเขือเทศ 400 มล.",
      "ครีม 100 มล.",
      "เนย 50 กรัม"
    ],
    "steps": [
      "หั่นไก่น่อง 600 กรัมเป็นชิ้นพอดีคำ ซับให้แห้งด้วยกระดาษทิชชู่ เตรียมชามผสมสำหรับหมัก ใส่โยเกิร์ต 1/2 ถ้วย กระเทียมสับละเอียดจาก 6 กลีบ ขิงขูด 1 ช้อนโต๊ะ เกลือประมาณ 1 ช้อนชา และเครื่องเทศแห้ง เช่น garam masala, cumin, coriander, paprika, cayenne อย่างละ 1–2 ช้อนชา (ปรับเพิ่มหรือลดความเผ็ดตามชอบ) คนให้เข้ากัน",
      "ใส่ไก่ลงในชามหมัก คลุกให้เนื้อไก่เคลือบส่วนผสมโยเกิร์ตและเครื่องเทศทั่วทุกชิ้น ปิดด้วยพลาสติกแรปหรือฝาปิด นำเข้าตู้เย็นอย่างน้อย 3 ชั่วโมง หรือข้ามคืนเพื่อให้รสซึมเข้าเนื้อ",
      "เมื่อถึงเวลาปรุง ตั้งเตาอบที่อุณหภูมิ 220°C หรือเตรียมเตาย่าง/กระทะย่าง วางไก่หมักลงบนถาดอบที่รองกระดาษรองอบหรือทาน้ำมันบาง ๆ เรียงให้ไม่ซ้อนกัน อบประมาณ 15–20 นาทีจนไก่สุกและขอบด้านนอกเริ่มเกรียมนิด ๆ (ถ้าใช้เตาย่าง ให้ย่างด้านละประมาณ 5–7 นาที) จากนั้นนำออกพักไว้ น้ำที่ไหลออกมาสามารถเก็บใส่ซอสได้",
      "เตรียมซอส: ตั้งหม้อหรือกระทะก้นหนา ใส่เนยครึ่งหนึ่ง (ประมาณ 25 กรัม) เปิดไฟกลาง ใส่หอมใหญ่สับ (แม้ไม่ได้ระบุในส่วนผสม คุณสามารถใส่หอมใหญ่ 1 ลูกสับเพื่อเพิ่มรสชาติได้) ผัดประมาณ 5–7 นาทีจนหอมใส จากนั้นใส่ขิงขูดเพิ่ม 1 ช้อนชาและกระเทียมสับ 2 กลีบ (ถ้าชอบ) ผัดต่ออีก 1–2 นาที",
      "เติมเครื่องเทศแห้ง (garam masala, cumin, coriander, paprika, cayenne อย่างละ 1 ช้อนชา หรือตามชอบ) ลงไปในหม้อ ผัดเร็ว ๆ ประมาณ 30 วินาที–1 นาทีจนหอม เพื่อคั่วกลิ่นเครื่องเทศแต่ไม่ให้ไหม้",
      "เทซอสมะเขือเทศ 400 มล. ลงในหม้อ ใช้พายคนขูดก้นหม้อให้คราบที่ติดอยู่ละลายออกมา ลดไฟลงเป็นไฟกลาง–อ่อน เคี่ยวซอสให้เดือดปุด ๆ เบา ๆ ประมาณ 10–15 นาทีจนซอสข้นขึ้นเล็กน้อย",
      "หากต้องการซอสเนียน สามารถใช้เครื่องปั่นมือถือปั่นซอสในหม้อให้เนียน (หรือยกใส่โถปั่นแล้วปั่นแล้วค่อยเทกลับหม้อ) จากนั้นเติมครีม 100 มล. กับเนยที่เหลือ 25 กรัมลงไป คนให้เข้ากันจนซอสมีสีส้มครีมข้น ชิมและปรับรสด้วยเกลือและน้ำตาลเล็กน้อยตามชอบ",
      "ใส่ไก่ย่างที่เตรียมไว้ (พร้อมน้ำจากถาดอบถ้ามี) ลงในหม้อซอส คนให้ไก่เคลือบซอสอย่างทั่วถึง เคี่ยวต่อด้วยไฟอ่อนอีก 10–15 นาทีจนไก่นุ่มดีและซอสข้นเคลือบเนื้อไก่",
      "ปิดไฟ โรยหน้าด้วยผักชีสดสับ เสิร์ฟร้อน ๆ คู่กับข้าวบาสมาติ นาน หรือโรตีก็ได้ตามชอบ"
    ]
  },
  {
    "id": "pan_seared_steak",
    "title": "สเต็กย่างกระทะ",
    "prep_time": "5 นาที (+พักเนื้อ 30 นาที)",
    "cook_time": "15 นาที",
    "total_time": "50 นาที",
    "image": "assets/images/categories/maincourse/pan_seared_steak.jpg",
    "ingredients": [
      "สเต็ก 1 ปอนด์ (NY Strip/Ribeye/Sirloin)",
      "น้ำมันพืช",
      "เกลือทะเล",
      "พริกไทยดำ",
      "เนย",
      "กระเทียม",
      "โรสแมรี"
    ],
    "steps": [
      "นำสเต็กออกจากตู้เย็น วางพักที่อุณหภูมิห้องประมาณ 30 นาที เพื่อให้เนื้อไม่เย็นจัดจะช่วยให้สุกสม่ำเสมอ จากนั้นใช้กระดาษทิชชู่ซับทั้งสองด้านให้แห้งสนิท เนื้อที่แห้งจะช่วยให้เกิดครัสต์สวย",
      "โรยเกลือทะเลและพริกไทยดำบดสดให้ทั่วทั้งสองด้านของสเต็ก ค่อนข้างเยอะหน่อย (เพราะส่วนหนึ่งจะหลุดออกตอนย่าง) กดเบา ๆ ให้เครื่องปรุงติดกับผิวเนื้อ แล้วพักไว้ระหว่างที่เตรียมกระทะ",
      "ตั้งกระทะเหล็กหล่อหรือกระทะก้นหนาบนไฟกลางค่อนแรง ปล่อยให้กระทะร้อนจัด 2–3 นาที จากนั้นเติมน้ำมันพืชประมาณ 1–2 ช้อนโต๊ะ กลิ้งให้เคลือบพื้นกระทะ บริเวณใกล้ผิวกระทะจะเริ่มมีควันบาง ๆ แสดงว่าพร้อมย่าง",
      "วางสเต็กลงในกระทะอย่างระมัดระวัง ให้ด้านที่มีมันอยู่ด้านล่างก่อน (ถ้ามี) ย่างโดยไม่ขยับประมาณ 2–3 นาที จนผิวด้านล่างเป็นสีน้ำตาลเข้มหอมและเกิดครัสต์ พลิกด้านแล้วย่างอีก 2–3 นาทีในลักษณะเดียวกัน",
      "ลดไฟลงเป็นไฟกลาง ใส่เนยประมาณ 2 ช้อนโต๊ะลงในกระทะ พร้อมกระเทียมทุบทั้งกลีบ 2–3 กลีบ และกิ่งโรสแมรี 1–2 กิ่ง เมื่ิอเนยละลายให้เอียงกระทะเล็กน้อย ใช้ช้อนตักเนยร้อน ๆ ราดบนสเต็กซ้ำ ๆ (baste) ประมาณ 1–2 นาทีต่อด้าน จะช่วยเพิ่มกลิ่นหอมและความชุ่มฉ่ำ",
      "ระยะเวลาการย่างขึ้นกับความหนาของสเต็กและความสุกที่ต้องการ: โดยทั่วไปสำหรับสเต็กหนา 2.5 ซม. จะใช้เวลารวมประมาณ 6–8 นาทีเพื่อได้ระดับ medium-rare หากต้องการสุกมากขึ้นให้ย่างต่อด้านละ 1–2 นาที หรือใช้เทอร์โมมิเตอร์วัดอุณหภูมิภายใน (ประมาณ 52–54°C สำหรับ medium-rare, 57–60°C สำหรับ medium)",
      "เมื่อสเต็กสุกในระดับที่ต้องการ ยกออกจากกระทะวางลงบนเขียงหรือจาน แล้วใช้ฟอยล์คลุมหลวม ๆ ปล่อยให้พักอย่างน้อย 5–7 นาที เพื่อให้น้ำในเนื้อกระจายตัวและไม่ไหลออกมามากเวลาแล่",
      "หลังพักครบเวลา ใช้มีดคมแล่สเต็กเป็นชิ้นหนาตามชอบ (ถ้าเป็นชิ้นที่มีเส้นใยชัด ให้แล่ขวางเส้นใย) ราดน้ำเนยและน้ำจากกระทะซอสลงบนเนื้ออีกเล็กน้อย เสิร์ฟทันทีคู่กับมันบด ผักย่าง หรือสลัดตามชอบ"
    ]
  }
]
