[
  {
    "id": "walnut_miso_noodles",
    "title": "เส้นมิโสะวอลนัท",
    "prep_time": "10 นาที",
    "cook_time": "10 นาที",
    "total_time": "20 นาที",
    "image": "assets/images/categories/noodles/walnut_miso_noodles.jpg",
    "ingredients": [
      "เส้นโซบะ 200 กรัม",
      "มิโสะขาว 2 ช้อนโต๊ะ",
      "วอลนัตคั่ว 1/3 ถ้วย",
      "ซีอิ๊ว (สำหรับปรุงรส)",
      "น้ำผึ้ง (สำหรับปรุงรส)",
      "น้ำมันงา (สำหรับปรุงรส)",
      "น้ำอุ่นหรือน้ำต้มเส้น (สำหรับปรับความข้นของซอส)",
      "ต้นหอมซอย (สำหรับโรยหน้า)",
      "งาคั่ว (สำหรับโรยหน้า)"
    ],
    "steps": [
      "เตรียมเส้น: ต้มน้ำในหม้อใบใหญ่ให้เดือด ใส่เกลือเล็กน้อย จากนั้นใส่เส้นโซบะ 200 กรัมลงไป ต้มตามเวลาที่ระบุบนซอง (ประมาณ 5–7 นาที) จนเส้นนุ่มแต่ยังเด้งเล็กน้อย (al dente) ระหว่างต้มใช้ตะเกียบคนเบา ๆ ไม่ให้เส้นติดกัน ตักน้ำต้มเส้นเก็บไว้ประมาณ 1/4 ถ้วย จากนั้นเทเส้นลงตะแกรง ล้างด้วยน้ำเย็นและคลุกเบา ๆ เพื่อล้างแป้งและหยุดความร้อน แล้วพักให้สะเด็ดน้ำ",
      "เตรียมซอสวอลนัตมิโสะ: หากวอลนัตยังไม่คั่ว ให้นำไปคั่วในกระทะแห้งไฟอ่อน–กลางประมาณ 3–5 นาทีจนหอมและสีเข้มขึ้นเล็กน้อย พักให้เย็น ใส่วอลนัตคั่ว 1/3 ถ้วย และมิโสะขาว 2 ช้อนโต๊ะลงในโถปั่นหรือครก เติมน้ำอุ่นหรือน้ำต้มเส้นที่เก็บไว้ทีละ 1–2 ช้อนโต๊ะ แล้วปั่นหรือโขลกจนได้เนื้อซอสเนียนข้น",
      "ปรุงรสซอส: เติมซีอิ๊วประมาณ 1–2 ช้อนชา น้ำผึ้ง 1–2 ช้อนชา และน้ำมันงา 1 ช้อนชา ลงในซอสวอลนัตมิโสะ คนหรือปั่นให้เข้ากัน ชิมรสให้ได้เค็ม–หวาน–มันตามชอบ หากซอสข้นเกินไปให้เติมน้ำอุ่นหรือน้ำต้มเส้นเพิ่มทีละน้อยจนได้ความข้นที่ราดหรือคลุกกับเส้นได้ง่าย",
      "คลุกเส้น: ใส่เส้นโซบะที่สะเด็ดน้ำแล้วลงในชามผสมขนาดใหญ่ ราดซอสวอลนัตมิโสะลงไป (เริ่มจากประมาณครึ่งหนึ่งก่อน) ใช้ตะเกียบหรือตะหลิวคลุกเบา ๆ ให้ซอสเคลือบเส้นทั่วกัน ชิมและเพิ่มซอสที่เหลือหรือปรุงเพิ่มด้วยซีอิ๊ว/น้ำผึ้งตามต้องการ หากรู้สึกแห้งให้เติมน้ำต้มเส้นเล็กน้อยแล้วคลุกต่อ",
      "จัดเสิร์ฟ: ตักเส้นใส่จานหรือชาม โรยหน้าด้วยต้นหอมซอยและงาคั่วเพิ่มเติม เสิร์ฟได้ทันที จะกินแบบอุ่น ๆ หรืออุณหภูมิห้องก็ได้"
    ]
  },
  {
    "id": "sesame_noodles",
    "title": "เส้นงา",
    "prep_time": "10 นาที",
    "cook_time": "10 นาที",
    "total_time": "20 นาที",
    "image": "assets/images/categories/noodles/sesame_noodles.jpg",
    "ingredients": [
      "เส้นบะหมี่ 200 กรัม (เส้นไข่หรือเส้นบะหมี่จีน/ญี่ปุ่น)",
      "งาคั่วบด 3–4 ช้อนโต๊ะ",
      "ซีอิ๊วญี่ปุ่น 2–3 ช้อนโต๊ะ",
      "น้ำมันงา 1–2 ช้อนชา",
      "น้ำส้มสายชูข้าว 1–2 ช้อนโต๊ะ",
      "น้ำตาลหรือน้ำผึ้ง 1–2 ช้อนชา (ปรับตามชอบ)",
      "แตงกวาหั่นเส้น (สำหรับเสิร์ฟคู่)",
      "ต้นหอมซอย (สำหรับโรยหน้า)",
      "งาคั่วเพิ่ม (สำหรับโรยหน้า)"
    ],
    "steps": [
      "ต้มเส้น: ต้มน้ำในหม้อให้เดือด ใส่เส้นบะหมี่ 200 กรัมลงไป ต้มตามเวลาที่ระบุบนซอง (ประมาณ 4–6 นาที) จนเส้นนุ่มแต่ยังเด้ง เมื่อสุกแล้วเทลงตะแกรง สะบัดน้ำร้อนออก สามารถล้างด้วยน้ำอุ่นหรือน้ำเย็นเร็ว ๆ เพื่อหยุดความร้อนและไม่ให้เส้นติดกัน จากนั้นคลุกเส้นด้วยน้ำมันงาเล็กน้อย (ประมาณ 1 ช้อนชา) แล้วพักให้สะเด็ดน้ำ",
      "เตรียมซองา: ในชามผสม ใส่งาคั่วบด 3–4 ช้อนโต๊ะ ซีอิ๊วญี่ปุ่น 2–3 ช้อนโต๊ะ น้ำส้มสายชูข้าว 1–2 ช้อนโต๊ะ น้ำมันงา 1 ช้อนชา และน้ำตาลหรือน้ำผึ้ง 1–2 ช้อนชา คนให้เข้ากัน ชิมรสให้ได้เค็ม–เปรี้ยว–หวาน–หอมงาตามชอบ หากซอสข้นมากให้เติมน้ำเล็กน้อย (1–2 ช้อนโต๊ะ) เพื่อให้คลุกกับเส้นได้ง่าย",
      "คลุกเส้นกับซอส: ใส่เส้นบะหมี่ที่สะเด็ดน้ำแล้วลงในชามผสมซองา ใช้ตะเกียบหรือตะหลิวคลุกเบา ๆ จนซอสเคลือบเส้นทั่วถึง ชิมอีกครั้ง หากต้องการเค็มเพิ่มใส่ซีอิ๊วเพิ่มเล็กน้อย หากต้องการเปรี้ยวสดชื่นเพิ่มใส่น้ำส้มสายชูข้าวเพิ่มได้",
      "จัดเสิร์ฟ: ตักเส้นใส่จานหรือชาม วางแตงกวาหั่นเส้นด้านบนหรือด้านข้าง โรยต้นหอมซอยและงาคั่วเพิ่มเล็กน้อย เสิร์ฟเป็นเมนูเส้นเย็นหรืออุณหภูมิห้องก็ได้"
    ]
  },
  {
    "id": "rainbow_noodle_salad",
    "title": "สลัดเส้นเรนโบว์",
    "prep_time": "15 นาที",
    "cook_time": "10 นาที",
    "total_time": "25 นาที",
    "image": "assets/images/categories/noodles/rainbow_noodle_salad.jpg",
    "ingredients": [
      "เส้นข้าวหรือเส้นโซบะ 200 กรัม",
      "แครอทซอย",
      "กะหล่ำม่วงซอย",
      "แตงกวาหั่นเส้น",
      "พริกหวานหั่นเส้น (สีแดง/เหลือง/เขียวตามชอบ)",
      "ถั่วลิสงคั่ว 2–3 ช้อนโต๊ะ",
      "ซีอิ๊วญี่ปุ่น 2–3 ช้อนโต๊ะ",
      "น้ำส้มสายชูข้าวหรือน้ำมะนาว 2–3 ช้อนโต๊ะ",
      "น้ำมันงา 1 ช้อนชา",
      "น้ำผึ้งหรือน้ำตาล 1–2 ช้อนชา",
      "น้ำมันพริก (ตัวเลือก ตามชอบ)"
    ],
    "steps": [
      "เตรียมเส้น: ต้มน้ำในหม้อให้เดือด ใส่เส้นข้าวหรือเส้นโซบะ 200 กรัมลงไป ต้มตามเวลาที่ระบุบนซองจนเส้นนุ่มแต่ยังเด้งเล็กน้อย จากนั้นเทลงตะแกรง ล้างด้วยน้ำเย็นจัดเพื่อหยุดความร้อนและล้างแป้งส่วนเกิน คลุกเบา ๆ ให้เส้นไม่จับเป็นก้อน พักให้สะเด็ดน้ำ",
      "เตรียมผัก: ซอยแครอท กะหล่ำม่วง หั่นแตงกวาและพริกหวานเป็นเส้นยาวบาง ๆ เตรียมไว้ให้ได้ปริมาณรวมของผักประมาณ 2–3 ถ้วย เพื่อให้สลัดดูหลากสีและมีผักเยอะ",
      "ทำน้ำสลัด: ในชามใบเล็ก ผสมซีอิ๊วญี่ปุ่น 2–3 ช้อนโต๊ะ น้ำส้มสายชูข้าวหรือน้ำมะนาว 2–3 ช้อนโต๊ะ น้ำมันงา 1 ช้อนชา น้ำผึ้งหรือน้ำตาล 1–2 ช้อนชา และน้ำมันพริกเล็กน้อยถ้าชอบเผ็ด คนให้เข้ากันจนน้ำผึ้งหรือน้ำตาลละลาย ชิมและปรับรสตามชอบ",
      "คลุกสลัด: ใส่เส้นที่สะเด็ดน้ำแล้วลงในชามผสมขนาดใหญ่ ตามด้วยผักที่เตรียมไว้ทั้งหมด ราดน้ำสลัดลงไป ใช้คีมหรือตะเกียบใหญ่คลุกเบา ๆ ให้เส้นและผักเคลือบด้วยน้ำสลัดทั่วกัน",
      "เสิร์ฟ: ตักสลัดเส้นใส่จาน โรยหน้าด้วยถั่วลิสงคั่ว 2–3 ช้อนโต๊ะ (จะสับหยาบก่อนก็ได้) เพื่อเพิ่มความกรุบกรอบ สามารถเสิร์ฟแบบเย็นหรืออุณหภูมิห้อง เป็นเมนูสลัดเส้นสีสันสดใส"
    ]
  },
  {
    "id": "spicy_tahini_noodles",
    "title": "เส้นซอสทาฮินีเผ็ด",
    "prep_time": "10 นาที",
    "cook_time": "10 นาที",
    "total_time": "20 นาที",
    "image": "assets/images/categories/noodles/spicy_tahini_noodles.jpg",
    "ingredients": [
      "เส้นอุด้งหรือเส้นข้าว 200 กรัม",
      "ทาฮินี 2 ช้อนโต๊ะ",
      "ซอสพริก (เช่น ศรีราชา หรือซอสพริกเผ็ดอื่น ๆ)",
      "ซีอิ๊วญี่ปุ่น 1–2 ช้อนโต๊ะ",
      "น้ำอุ่นหรือน้ำต้มเส้น (สำหรับปรับความข้นของซอส)",
      "น้ำตาลหรือน้ำผึ้งเล็กน้อย (ตัวเลือก สำหรับบาลานซ์รส)",
      "ต้นหอมซอย (สำหรับโรยหน้า)",
      "งาคั่ว (สำหรับโรยหน้า)"
    ],
    "steps": [
      "ต้มเส้น: ต้มน้ำให้เดือดในหม้อใบใหญ่ ใส่เส้นอุด้งหรือเส้นข้าว 200 กรัมลงไป ต้มตามเวลาบนซองจนเส้นนุ่ม (อุด้งประมาณ 8–10 นาที เส้นข้าวประมาณ 5–7 นาที) เมื่อสุกแล้วเทลงตะแกรง ล้างด้วยน้ำอุ่นหรือเย็นเร็ว ๆ หากต้องการหยุดความร้อน พักให้สะเด็ดน้ำ",
      "ทำซอสทาฮินีเผ็ด: ในชามผสม ใส่ทาฮินี 2 ช้อนโต๊ะ ตามด้วยซอสพริกประมาณ 1–2 ช้อนชา (หรือมากกว่านั้นตามระดับความเผ็ดที่ต้องการ) และซีอิ๊วญี่ปุ่น 1–2 ช้อนโต๊ะ เติมน้ำอุ่นหรือน้ำต้มเส้นทีละ 1–2 ช้อนโต๊ะ แล้วใช้ตะกร้อมือหรือตะเกียบคนจนซอสเนียนและข้น ชิมรสและปรับด้วยน้ำตาลหรือน้ำผึ้งเล็กน้อยหากต้องการรสกลมขึ้น",
      "คลุกเส้นกับซอส: ใส่เส้นที่สะเด็ดน้ำแล้วลงในชามผสมขนาดใหญ่ ราดซอสทาฮินีเผ็ดลงไป ใช้ตะเกียบหรือคีมคลุกเบา ๆ ให้ซอสเคลือบเส้นทั่วกัน หากซอสดูข้นไปหรือเส้นแห้ง ให้เติมน้ำอุ่นหรือน้ำต้มเส้นเพิ่มทีละน้อยแล้วคลุกต่อจนได้ความข้นที่ชอบ",
      "จัดเสิร์ฟ: ตักเส้นใส่ชาม โรยหน้าด้วยต้นหอมซอยและงาคั่วเพิ่มเพื่อความหอมและกรุบเล็กน้อย สามารถเสิร์ฟแบบอุ่น ๆ หรืออุณหภูมิห้องก็ได้"
    ]
  },
  {
    "id": "slurptastic_herb_noodles",
    "title": "เส้นสมุนไพรซดเพลิน",
    "prep_time": "10 นาที",
    "cook_time": "10 นาที",
    "total_time": "20 นาที",
    "image": "assets/images/categories/noodles/slurptastic_herb_noodles.jpg",
    "ingredients": [
      "เส้นบะหมี่ 200 กรัม",
      "ผักชี",
      "มิ้นต์ (สะระแหน่)",
      "ใบกะเพรา หรือโหระพา",
      "ต้นหอม",
      "ซีอิ๊วญี่ปุ่น 2–3 ช้อนโต๊ะ",
      "น้ำปลา 1 ช้อนโต๊ะ (ตัวเลือก)",
      "น้ำมะนาว 1–2 ช้อนโต๊ะ",
      "น้ำมันงา 1 ช้อนชา",
      "น้ำมันพริก 1 ช้อนชา (หรือตามชอบ)",
      "น้ำตาล 1–2 ช้อนชา (สำหรับปรับรส)"
    ],
    "steps": [
      "ต้มเส้น: ต้มน้ำในหม้อให้เดือด ใส่เส้นบะหมี่ 200 กรัมลงไป ต้มตามเวลาบนซองจนเส้นนุ่มแต่ยังเด้ง เทลงตะแกรง ล้างด้วยน้ำอุ่นหรือเย็นเร็ว ๆ เพื่อหยุดความร้อนและลดความมัน/แป้งส่วนเกิน สะบัดให้สะเด็ดน้ำ",
      "เตรียมสมุนไพร: ล้างผักชี มิ้นต์ ใบกะเพรา (หรือโหระพา) และต้นหอมให้สะอาด ซับให้แห้ง จากนั้นหั่นหรือซอยหยาบ ๆ ให้ได้ปริมาณรวมประมาณ 1–1.5 ถ้วย เพื่อให้เส้นมีกลิ่นหอมสมุนไพรชัดเจน",
      "เตรียมซอสสมุนไพร: ในชามผสม ใส่ซีอิ๊วญี่ปุ่น 2–3 ช้อนโต๊ะ น้ำปลา 1 ช้อนโต๊ะ (ถ้าชอบรสนัวร์) น้ำมะนาว 1–2 ช้อนโต๊ะ น้ำมันงา 1 ช้อนชา น้ำมันพริก 1 ช้อนชา และน้ำตาล 1–2 ช้อนชา คนให้เข้ากันจนน้ำตาลละลาย ชิมรสให้ได้เค็ม–เปรี้ยว–หวาน–เผ็ดตามชอบ",
      "คลุกเส้นกับสมุนไพร: ใส่เส้นบะหมี่ที่สะเด็ดน้ำแล้วลงในชามผสมขนาดใหญ่ ใส่สมุนไพรที่เตรียมไว้ทั้งหมดลงไป ราดซอสสมุนไพรลงบนเส้น ใช้คีมหรือตะเกียบคลุกเบา ๆ ให้เส้นเคลือบซอสและสมุนไพรผสมกระจายทั่วกัน",
      "เสิร์ฟ: ตักเส้นสมุนไพรใส่จานหรือชาม เสิร์ฟทันทีขณะยังอุ่นหรืออุณหภูมิห้อง เป็นเมนูเส้นเบา ๆ หอมสดชื่นจากสมุนไพร เหมาะทั้งเป็นจานเดี่ยวหรือกินคู่กับอาหารอื่น"
    ]
  }
]
