[
  {
    "id": "mexican_chicken_stew_quinoa_beans",
    "title": "สตูไก่เม็กซิกันกับควินัวและถั่ว",
    "prep_time": "10 นาที",
    "cook_time": "35 นาที",
    "total_time": "45 นาที",
    "image": "assets/images/categories/protein/mexican_chicken_stew_quinoa_beans.jpg",
    "ingredients": [
      "อกไก่ 400 กรัม หั่นเป็นชิ้นพอดีคำ",
      "ควินัว 150 กรัม (ล้างน้ำให้สะอาด)",
      "ถั่วแดง 1 กระป๋อง (ล้างและสะเด็ดน้ำ)",
      "มะเขือเทศสับ 1 กระป๋อง หรือมะเขือเทศสดสับ 2–3 ลูก",
      "หอมใหญ่ 1 หัว (สับ)",
      "กระเทียม 3–4 กลีบ (สับ)",
      "น้ำสต๊อกไก่ 750 มล. (ประมาณ 3 ถ้วย)",
      "ผงปาปริก้า ผงยี่หร่า ผงพริกป่น (ปรุงตามชอบ รวมกันประมาณ 1–2 ช้อนชา)",
      "เกลือและพริกไทยดำป่น",
      "น้ำมันพืช 1–2 ช้อนโต๊ะ"
    ],
    "steps": [
      "เตรียมวัตถุดิบ: ล้างควินัวผ่านกระชอนตาถี่ใต้น้ำไหลประมาณ 1–2 นาทีเพื่อล้างสารขม จากนั้นสะเด็ดน้ำให้ดี ล้างถั่วแดงกระป๋องและสะเด็ดน้ำ หั่นอกไก่เป็นชิ้นพอดีคำ ซับให้แห้งด้วยกระดาษทิชชู่ สับหอมใหญ่และกระเทียมให้เรียบร้อย",
      "ผัดหอมและกระเทียม: ตั้งหม้อก้นหนาหรือหม้อซุปบนไฟกลาง ใส่น้ำมันพืช 1–2 ช้อนโต๊ะ รอให้น้ำมันร้อน จากนั้นใส่หอมใหญ่สับลงไป ผัดประมาณ 3–4 นาทีจนหอมใหญ่ใสและนิ่ม แล้วใส่กระเทียมสับลงไป ผัดต่ออีก 1 นาทีจนหอม ระวังไม่ให้ไหม้",
      "ผัดไก่และเครื่องเทศ: ใส่อกไก่ลงในหม้อ เกลี่ยให้กระจายตัว ผัดประมาณ 4–5 นาทีจนผิวด้านนอกของไก่เปลี่ยนเป็นสีขาวและเริ่มเกรียมนิด ๆ ใส่ผงปาปริก้า ผงยี่หร่า และผงพริกป่นรวมกันประมาณ 1–2 ช้อนชา โรยเกลือและพริกไทยเล็กน้อย คลุกให้เครื่องเทศเคลือบไก่และหอมกระเทียมทั่วกัน ผัดต่ออีก 1–2 นาทีจนเครื่องเทศหอม",
      "เติมมะเขือเทศ ถั่ว และควินัว: ใส่มะเขือเทศสับลงไปในหม้อ คนให้เข้ากันแล้วปล่อยให้เดือดอ่อน ๆ ประมาณ 2–3 นาที จากนั้นใส่ควินัวที่ล้างแล้วและถั่วแดงที่สะเด็ดน้ำลงไป คลุกให้ส่วนผสมกระจายตัวทั่วถึง",
      "เคี่ยวกับน้ำสต๊อก: เทน้ำสต๊อกไก่ 750 มล. ลงไป คนให้เข้ากัน เพิ่มไฟให้เดือด จากนั้นลดไฟลงเป็นไฟกลาง–อ่อน ปิดฝากึ่งเปิด เคี่ยวให้เดือดปุด ๆ เบา ๆ ประมาณ 20–25 นาที ระหว่างเคี่ยวให้คนก้นหม้อเป็นครั้งคราวเพื่อไม่ให้ควินัวติดก้นหม้อ",
      "ตรวจความสุกและปรับรส: เมื่อครบเวลาควินัวจะพองตัวและใสขึ้น น้ำในหม้อควรข้นขึ้นเล็กน้อยเป็นลักษณะสตู ถ้าดูข้นเกินไปสามารถเติมน้ำสต๊อกหรือน้ำร้อนเพิ่มทีละเล็กน้อย ชิมรสและปรับด้วยเกลือ พริกไทย หรือผงพริกตามชอบ ปิดไฟแล้วพักสตูว์สัก 5 นาทีก่อนตักเสิร์ฟ เพื่อให้รสชาติเข้ากันดี"
    ]
  },
  {
    "id": "bean_enchiladas",
    "title": "เอนชิลาดาถั่ว",
    "prep_time": "15 นาที",
    "cook_time": "20 นาที",
    "total_time": "35 นาที",
    "image": "assets/images/categories/protein/bean_enchiladas.jpg",
    "ingredients": [
      "ถั่วบด 400 กรัม (refried beans หรือถั่วดำบด/ถั่วแดงบด)",
      "แผ่นตอร์ติญ่า 8–10 แผ่น (แป้งข้าวสาลีหรือข้าวโพด)",
      "ซอสเอนชิลาดา 2–3 ถ้วย",
      "ข้าวโพดเมล็ด 1 ถ้วย (สด แช่แข็ง หรือกระป๋องสะเด็ดน้ำ)",
      "ชีสขูด 1–2 ถ้วย (เช่น เชดดาร์ มอซซาเรลลา หรือผสม)",
      "หอมใหญ่สับ 1/2 หัว (ตัวเลือก)",
      "น้ำมันพืชเล็กน้อยสำหรับผัด/ทาถาด",
      "เกลือและพริกไทย (สำหรับปรุงรสไส้)"
    ],
    "steps": [
      "วอร์มเตาอบ: เปิดเตาอบที่อุณหภูมิ 180°C ทาน้ำมันบาง ๆ หรือพ่นสเปรย์น้ำมันลงบนถาดอบหรือพิมพ์อบสี่เหลี่ยมที่มีขอบ (ขนาดประมาณ 20×30 ซม.)",
      "เตรียมไส้ถั่ว: ตั้งกระทะบนไฟกลาง ใส่น้ำมันเล็กน้อย ถ้าใช้หอมใหญ่ให้ใส่หอมใหญ่สับลงไปผัดประมาณ 3–4 นาทีจนใสและหอม จากนั้นใส่ถั่วบด 400 กรัมลงไป ตามด้วยข้าวโพดเมล็ด คนให้เข้ากัน ถ้าถั่วข้นเกินไปสามารถเติมน้ำเล็กน้อยหรือน้ำซอสเอนชิลาดา 2–3 ช้อนโต๊ะเพื่อให้คลุกง่าย ปรุงรสด้วยเกลือและพริกไทยตามชอบ ผัดจนร้อนทั่วแล้วปิดไฟ พักไว้ให้อุ่น",
      "อุ่นแผ่นตอร์ติญ่า: เพื่อให้ตอร์ติญ่านุ่มและม้วนง่าย สามารถห่อแผ่นตอร์ติญ่าด้วยฟอยล์แล้วนำเข้าเตาอบ 3–5 นาที หรือนำไปวางในกระทะแห้งไฟอ่อนทีละแผ่นด้านละ 20–30 วินาทีจนพออุ่น",
      "ประกอบเอนชิลาดา: ตักซอสเอนชิลาดาเล็กน้อย (ประมาณ 1/2 ถ้วย) ราดก้นถาดอบให้ทั่วเพื่อกันติด วางตอร์ติญ่าลงบนเขียง ตักไส้ถั่วประมาณ 2–3 ช้อนโต๊ะวางตามแนวยาวตรงกลางแผ่น โรยชีสขูดเล็กน้อยด้านบน แล้วม้วนจากด้านหนึ่งไปอีกด้านให้แน่นพอดี วางลงในถาดอบโดยให้ด้านรอยต่อคว่ำลง ทำซ้ำจนใช้ตอร์ติญ่าและไส้จนหมด เรียงให้แนบชิดกัน",
      "ราดซอสและชีส: เทซอสเอนชิลาดาที่เหลือให้ทั่วด้านบนของเอนชิลาดา ให้ซอสเคลือบทั่วทุกชิ้น จากนั้นโรยชีสขูดที่เหลือให้ทั่วด้านบน",
      "อบ: นำถาดเข้าเตาอบที่อุณหภูมิ 180°C อบประมาณ 15–20 นาที หรือจนชีสละลายและผิวหน้าฟูเป็นฟองและมีสีทองเล็กน้อย นำออกจากเตา พักสัก 5 นาทีให้เซ็ตตัวก่อนใช้มีดตักเสิร์ฟ สามารถเสิร์ฟพร้อมซัลซ่า ครีมเปรี้ยว หรือผักชีโรยหน้าได้ตามชอบ"
    ]
  },
  {
    "id": "chicken_stroganoff",
    "title": "ไก่สโตรกานอฟ",
    "prep_time": "10 นาที",
    "cook_time": "20 นาที",
    "total_time": "30 นาที",
    "image": "assets/images/categories/protein/chicken_stroganoff.jpg",
    "ingredients": [
      "อกไก่ 400 กรัม หั่นเป็นเส้นหรือชิ้นพอดีคำ",
      "เห็ด 250 กรัม (เช่น เห็ดแชมปิญอง หั่นแผ่น)",
      "หอมใหญ่ 1 หัว (หั่นเสี้ยวหรือสับหยาบ)",
      "มัสตาร์ด 1–2 ช้อนโต๊ะ (เช่น Dijon)",
      "ซาวครีม 150–200 กรัม",
      "น้ำสต๊อกไก่ 250 มล.",
      "เกลือและพริกไทยดำป่น",
      "เนยหรือ น้ำมันพืช 2–3 ช้อนโต๊ะ",
      "พาร์สลีย์สับ สำหรับโรยหน้า (ตัวเลือก)"
    ],
    "steps": [
      "เตรียมวัตถุดิบ: หั่นอกไก่เป็นเส้นหรือชิ้นพอดีคำ ซับให้แห้งเล็กน้อย หั่นเห็ดเป็นแผ่นบาง หั่นหอมใหญ่เป็นเสี้ยวหรือสับหยาบ",
      "ผัดเห็ดและหอม: ตั้งกระทะก้นหนาหรือหม้อบนไฟกลาง ใส่เนยหรือน้ำมัน 1 ช้อนโต๊ะ ใส่เห็ดลงไปผัดประมาณ 4–5 นาทีจนเห็ดปล่อยน้ำและเริ่มเป็นสีน้ำตาลเล็กน้อย ตักเห็ดขึ้นพักไว้ จากนั้นใส่เนยหรือน้ำมันเพิ่มอีกเล็กน้อย ใส่หอมใหญ่ลงผัดประมาณ 3–4 นาทีจนหอมนิ่มและใส ตักพักไว้รวมกับเห็ด",
      "ผัดไก่: ในกระทะใบเดิม เพิ่มน้ำมันหรือเนยเล็กน้อยถ้าจำเป็น เปิดไฟกลาง–แรง ใส่อกไก่ลงไปผัดจนผิวด้านนอกเปลี่ยนสีเป็นขาวและเริ่มเกรียมนิด ๆ ประมาณ 4–5 นาที โรยเกลือและพริกไทยเล็กน้อย",
      "คืนเห็ดและหอมลงกระทะ: ใส่เห็ดและหอมที่ผัดไว้กลับลงในกระทะกับไก่ คนให้เข้ากัน จากนั้นใส่มัสตาร์ด 1–2 ช้อนโต๊ะลงไป คนให้เคลือบเนื้อไก่และเห็ดทั่วกัน",
      "เคี่ยวกับน้ำสต๊อก: เทน้ำสต๊อกไก่ 250 มล. ลงไปในกระทะ คนให้เข้ากัน ลดไฟลงเป็นไฟกลาง–อ่อน เคี่ยวให้เดือดปุด ๆ เบา ๆ ประมาณ 8–10 นาที จนปริมาณซอสลดลงและข้นขึ้นเล็กน้อย และเนื้อไก่สุกนุ่ม",
      "ใส่ซาวครีมและปรับรส: ลดไฟให้เบาที่สุดหรือปิดไฟชั่วครู่ จากนั้นใส่ซาวครีม 150–200 กรัมลงไป คนให้เข้ากันจนซอสมีเนื้อเนียนครีม ห้ามให้เดือดแรงหลังใส่ซาวครีมเพราะอาจแยกตัวได้ ชิมรสแล้วปรับด้วยเกลือและพริกไทยตามชอบ",
      "เสิร์ฟ: โรยพาร์สลีย์สับด้านบนเล็กน้อย เสิร์ฟร้อน ๆ คู่กับข้าว มันบด หรือเส้นพาสต้าตามชอบ"
    ]
  },
  {
    "id": "basa_fillet_garlic_paprika_butter",
    "title": "ปลาบาซ่าราดเนยกระเทียมและปาปริก้า",
    "prep_time": "10 นาที",
    "cook_time": "12 นาที",
    "total_time": "22 นาที",
    "image": "assets/images/categories/protein/basa_fillet_garlic_paprika_butter.jpg",
    "ingredients": [
      "เนื้อปลาบาซ่า 2 ชิ้น (ประมาณ 150–180 กรัมต่อชิ้น)",
      "เนย 40 กรัม",
      "กระเทียมสับ 2–3 กลีบ",
      "ปาปริก้า 1–2 ช้อนชา",
      "เกลือและพริกไทยดำป่น",
      "น้ำมันพืชเล็กน้อยสำหรับทาถาด"
    ],
    "steps": [
      "วอร์มเตาอบ: เปิดเตาอบที่อุณหภูมิ 200°C รองถาดอบด้วยกระดาษรองอบหรือฟอยล์แล้วทาน้ำมันบาง ๆ เพื่อกันปลาไม่ให้ติดถาด",
      "เตรียมปลา: ซับเนื้อปลาบาซ่าให้แห้งด้วยกระดาษทิชชู่ โรยเกลือและพริกไทยดำป่นบาง ๆ ทั้งสองด้าน แล้วโรยปาปริก้าอย่างสม่ำเสมอ ใช้มือลูบเบา ๆ ให้เครื่องปรุงเคลือบผิวปลา",
      "อบปลา: วางเนื้อปลาบาซ่าลงบนถาดอบที่เตรียมไว้ นำเข้าเตาอบที่ร้อนแล้ว อบประมาณ 10–12 นาที ขึ้นอยู่กับความหนาของชิ้นปลา ปลาจะสุกเมื่อเนื้อขาวทึบและใช้ส้อมแซะแล้วแยกเป็นชั้นได้ง่าย",
      "ทำซอสเนยกระเทียม: ระหว่างที่ปลาอยู่ในเตา ตั้งหม้อเล็กหรือกระทะเล็กบนไฟอ่อน ใส่เนย 40 กรัมลงไป พอเนยละลาย ใส่กระเทียมสับ 2–3 กลีบลงผัดเบา ๆ ประมาณ 1–2 นาทีจนหอมและกระเทียมเริ่มเป็นสีทองอ่อน จากนั้นใส่ปาปริก้า 1/2–1 ช้อนชาเพิ่มในซอส คนให้เข้ากันแล้วปิดไฟ (ระวังไม่ให้กระเทียมไหม้)",
      "เสิร์ฟ: นำปลาบาซ่าออกจากเตา วางลงบนจานเสิร์ฟ ราดซอสเนยกระเทียมปาปริก้าลงบนปลาขณะยังร้อน เสิร์ฟคู่กับผักลวก มันบด หรือสลัดตามชอบ"
    ]
  },
  {
    "id": "herb_garlic_baked_cod_romesco_spinach",
    "title": "ปลาคอดอบสมุนไพรและกระเทียมกับซอสรอเมสโกและผักโขม",
    "prep_time": "15 นาที",
    "cook_time": "20 นาที",
    "total_time": "35 นาที",
    "image": "assets/images/categories/protein/herb_garlic_baked_cod_romesco_spinach.jpg",
    "ingredients": [
      "เนื้อปลาคอด 2 ชิ้น (ประมาณ 150–180 กรัมต่อชิ้น)",
      "กระเทียมสับ 2 กลีบ",
      "สมุนไพรสับ 2–3 ช้อนโต๊ะ (เช่น พาร์สลีย์ ไทม์ โรสแมรี อย่างใดอย่างหนึ่งหรือผสม)",
      "น้ำมันมะกอก 3–4 ช้อนโต๊ะ",
      "ผักโขมสด 200–250 กรัม",
      "ซอสโรเมสโกสำเร็จรูปหรือโฮมเมด สำหรับเสิร์ฟ",
      "เกลือและพริกไทยดำป่น"
    ],
    "steps": [
      "วอร์มเตาอบ: เปิดเตาอบที่อุณหภูมิ 190–200°C รองถาดอบด้วยกระดาษรองอบหรือฟอยล์",
      "เตรียมปลาคอด: ซับเนื้อปลาคอดให้แห้งด้วยกระดาษทิชชู่ โรยเกลือและพริกไทยดำป่นทั้งสองด้าน พักไว้ในจาน",
      "ทำส่วนผสมสมุนไพร: ในชามเล็ก ผสมน้ำมันมะกอก 2–3 ช้อนโต๊ะกับกระเทียมสับ 2 กลีบ และสมุนไพรสับ 2–3 ช้อนโต๊ะ คนให้เข้ากันจนเป็นน้ำมันสมุนไพรหอม ๆ",
      "อบปลา: วางปลาคอดลงบนถาดอบที่เตรียมไว้ ทาน้ำมันสมุนไพรที่ผสมไว้ลงบนผิวปลาทั้งด้านบนและด้านข้างให้ทั่ว นำเข้าอบประมาณ 15–20 นาที (ขึ้นกับความหนาของชิ้นปลา) จนเนื้อปลาสุกขาวทึบและใช้ส้อมแซะแล้วแยกเป็นชั้นได้ง่าย หากต้องการให้หน้าปลาเกรียมเล็กน้อย สามารถเปิดไฟบน/โหมดกริลล์ในช่วง 1–2 นาทีสุดท้าย (คอยดูไม่ให้ไหม้)",
      "ผัดผักโขม: ระหว่างรอปลา ตั้งกระทะก้นลึกบนไฟกลาง ใส่น้ำมันมะกอกที่เหลือ (ประมาณ 1 ช้อนโต๊ะ) ใส่กระเทียมสับเล็กน้อยเพิ่มได้ถ้าชอบ ผัดจนหอม จากนั้นใส่ผักโขมสดลงไป ผัดประมาณ 2–3 นาทีจนผักยุบตัวและนิ่ม โรยเกลือและพริกไทยเล็กน้อย ปิดไฟ",
      "จัดเสิร์ฟ: ตักผักโขมผัดวางเป็นฐานในจาน วางปลาคอดอบสมุนไพรบนผักโขม ตักหรือราดซอสโรเมสโกลงบนหรือข้าง ๆ ปลา ปิดท้ายด้วยสมุนไพรสดสับเล็กน้อยด้านบน เสิร์ฟทันที"
    ]
  }
]
