[
  {
    "id": "simple_green_salad",
    "title": "สลัดผักใบเขียว",
    "prep_time": "15 นาที",
    "cook_time": "0 นาที",
    "total_time": "15 นาที",
    "image": "assets/images/categories/salad_and_healthy/simple_green_salad.jpg",
    "ingredients": [
      "ผักสลัดรวม 6 ถ้วย (เช่น กรีนโอ๊ค เรดโอ๊ค ร็อกเก็ต ฯลฯ)",
      "แตงกวาอังกฤษ 1 ลูก",
      "มะเขือเทศเชอร์รี่ 1 ถ้วย",
      "แครอท 1 หัว",
      "อะโวคาโด 1 ลูก",
      "ชีสนมแพะหรือเฟต้า (ตามชอบ)",
      "น้ำมันมะกอก 3 ช้อนโต๊ะ",
      "น้ำเลมอน 1–2 ช้อนโต๊ะ",
      "น้ำผึ้ง 1 ช้อนชา (ตัวเลือก สำหรับเพิ่มรสหวานเล็กน้อย)",
      "เกลือและพริกไทยดำป่นเล็กน้อย"
    ],
    "steps": [
      "เตรียมผัก: ล้างผักสลัดรวมให้สะอาด แช่ในน้ำเย็นสักครู่เพื่อให้ผักกรอบ จากนั้นสะเด็ดน้ำและซับให้แห้งด้วยกระดาษทิชชู่หรือใช้ที่หมุนผักสลัด แล้วฉีกหรือหั่นเป็นชิ้นพอดีคำ ใส่ลงในชามสลัดใบใหญ่",
      "เตรียมผักอื่น ๆ: ล้างแตงกวาอังกฤษ ปอกเปลือกบางส่วนถ้าต้องการ แล้วหั่นเป็นแว่นหรือครึ่งวงกลม ล้างมะเขือเทศเชอร์รี่และผ่าครึ่ง ปอกแครอท ล้างให้สะอาด แล้วใช้มีดหั่นแท่งหรือใช้ที่ขูดเป็นเส้นยาว ๆ เตรียมทั้งหมดไว้",
      "เตรียมอะโวคาโด: ผ่าอะโวคาโดครึ่งหนึ่ง แกะเมล็ดออก ใช้ช้อนตักเนื้อออกมาวางบนเขียง แล้วหั่นเป็นชิ้นเต๋าหรือสไลซ์ ใส่ลงในชามเล็ก ๆ แยกไว้ (ทำขั้นตอนนี้ใกล้เวลาจะเสิร์ฟเพื่อลดการดำ)",
      "ทำน้ำสลัดแบบง่าย: ในถ้วยหรือขวดโหลเล็ก ๆ ใส่น้ำมันมะกอก 3 ช้อนโต๊ะ น้ำเลมอน 1–2 ช้อนโต๊ะ น้ำผึ้ง 1 ช้อนชา (ถ้าใช้) เกลือ และพริกไทยดำป่นเล็กน้อย ปิดฝาแล้วเขย่าให้เข้ากัน หรือใช้ตะกร้อมือคนจนเป็นเนื้อเดียวกัน ชิมและปรับรสตามชอบ (เพิ่มน้ำเลมอนถ้าต้องการเปรี้ยวมากขึ้น หรือเพิ่มเกลืออีกเล็กน้อย)",
      "ประกอบสลัด: ใส่แตงกวา มะเขือเทศเชอร์รี่ และแครอทที่เตรียมไว้ลงในชามผักสลัด ราดน้ำสลัดที่ทำไว้ลงไปทีละส่วน แล้วใช้คีมหรือตะหลิวไม้คลุกเบา ๆ ให้ผักเคลือบด้วยน้ำสลัดทั่วกัน",
      "ใส่อะโวคาโดและชีส: ใส่อะโวคาโดหั่นชิ้นลงบนหน้าสลัด แล้วโรยชีสนมแพะหรือเฟต้าชีสแตกเป็นก้อนเล็ก ๆ ด้านบน หากต้องการสามารถราดน้ำสลัดเพิ่มเล็กน้อยบนอะโวคาโดและชีส แล้วเสิร์ฟทันทีขณะผักยังกรอบ"
    ]
  },
  {
    "id": "caesar_salad",
    "title": "ซีซาร์สลัด",
    "prep_time": "20 นาที",
    "cook_time": "10 นาที",
    "total_time": "30 นาที",
    "image": "assets/images/categories/salad_and_healthy/caesar_salad.jpg",
    "ingredients": [
      "ขนมปังหั่นเต๋า (ครูตอง) 2–3 ถ้วย",
      "น้ำมันมะกอก 2–3 ช้อนโต๊ะ (สำหรับครูตอง)",
      "เกลือและพริกไทยดำป่นเล็กน้อย (สำหรับครูตองและปรุงรส)",
      "มายองเนส 1/3 ถ้วย",
      "น้ำมันมะกอก 2–3 ช้อนโต๊ะ (สำหรับน้ำสลัด)",
      "น้ำเลมอน 1–2 ช้อนโต๊ะ",
      "มัสตาร์ดดิจอง 1 ช้อนชา",
      "กระเทียมสับละเอียด 1–2 กลีบ",
      "พาร์เมซานขูด 1/4 ถ้วย (ใส่ในน้ำสลัด) + สำหรับโรยหน้าเพิ่ม",
      "ผักโรเมน (Romaine) 1 หัวใหญ่ หรือ 2 หัวเล็ก ล้างและฉีกเป็นชิ้นพอดีคำ"
    ],
    "steps": [
      "ทำครูตอง: เปิดเตาอบที่อุณหภูมิ 180°C เตรียมถาดอบ วางขนมปังหั่นเต๋า 2–3 ถ้วยลงในชาม ราดน้ำมันมะกอก 2–3 ช้อนโต๊ะ โรยเกลือและพริกไทยเล็กน้อย คลุกให้เข้ากันแล้วเทลงบนถาดอบ เกลี่ยให้เป็นชั้นเดียว นำเข้าอบประมาณ 8–10 นาที หรือจนกรอบและเป็นสีทองอ่อน ระหว่างอบอาจกลับด้านสัก 1 ครั้ง นำออกมาพักให้เย็น",
      "เตรียมผัก: ล้างผักโรเมนให้สะอาด แช่ในน้ำเย็นสักครู่เพื่อให้กรอบ จากนั้นสะเด็ดน้ำและซับให้แห้ง ใช้มือฉีกใบผักเป็นชิ้นพอดีคำหรือหั่นหยาบ ๆ ใส่ลงในชามสลัดใบใหญ่",
      "ทำน้ำสลัดซีซาร์: ในชามผสม ใส่มายองเนส 1/3 ถ้วย น้ำมันมะกอก 2–3 ช้อนโต๊ะ น้ำเลมอน 1–2 ช้อนโต๊ะ มัสตาร์ดดิจอง 1 ช้อนชา กระเทียมสับละเอียด 1–2 กลีบ และพาร์เมซานขูด 1/4 ถ้วย คนให้เข้ากันจนเนื้อเนียน หากข้นเกินไปสามารถเติมน้ำอุ่นหรือน้ำเลมอนเพิ่มเล็กน้อย ชิมรสและปรับด้วยเกลือและพริกไทยตามชอบ",
      "คลุกผักกับน้ำสลัด: เทน้ำสลัดลงบนผักโรเมน (เริ่มจากประมาณ 2/3 ของทั้งหมดก่อน) ใช้คีมหรือช้อนส้อมขนาดใหญ่คลุกเบา ๆ ให้ผักเคลือบด้วยน้ำสลัดทั่วจนใบผักมีความเงา ชิมรสและเติมน้ำสลัดเพิ่มได้หากต้องการชุ่มมากขึ้น",
      "ประกอบและเสิร์ฟ: ใส่ครูตองที่เย็นแล้วลงบนสลัด คลุกเบา ๆ อีกครั้ง จากนั้นโรยหน้าด้วยพาร์เมซานขูดเพิ่มเติม เสิร์ฟทันทีเพื่อให้ผักกรอบและครูตองไม่ชื้น"
    ]
  },
  {
    "id": "sweet_potato_salad",
    "title": "สลัดมันหวาน",
    "prep_time": "20 นาที",
    "cook_time": "25 นาที",
    "total_time": "45 นาที",
    "image": "assets/images/categories/salad_and_healthy/sweet_potato_salad.jpg",
    "ingredients": [
      "มันเทศขนาดกลาง 2 หัว",
      "อารูกูลา (ร็อกเก็ต) 3–4 ถ้วย",
      "เฟต้าชีส บี้เป็นก้อนเล็ก ๆ 1/2–3/4 ถ้วย",
      "อะโวคาโด 1 ลูก",
      "เมล็ดฟักทองคั่ว 2–3 ช้อนโต๊ะ",
      "น้ำสลัดทาฮินี (โฮมเมดหรือสำเร็จรูป)",
      "น้ำมันมะกอก 1–2 ช้อนโต๊ะ (สำหรับอบมันเทศ)",
      "เกลือและพริกไทยดำป่น (สำหรับปรุงมันเทศและสลัด)",
      "น้ำเลมอน 1–2 ช้อนโต๊ะ"
    ],
    "steps": [
      "อบมันเทศ (ถ้ายังไม่อบ): เปิดเตาอบที่อุณหภูมิ 200°C ปอกเปลือกมันเทศแล้วหั่นเป็นชิ้นเต๋าหรือหั่นแว่นหนา 1.5–2 ซม. ใส่ลงในชาม ราดน้ำมันมะกอก 1–2 ช้อนโต๊ะ โรยเกลือและพริกไทย คลุกให้ทั่ว แล้วเทลงบนถาดอบ เกลี่ยให้เป็นชั้นเดียว นำเข้าอบประมาณ 20–25 นาที หรือจนมันเทศนุ่มและขอบเริ่มเกรียมเล็กน้อย กลางเวลาอบสามารถกลับด้านสัก 1 ครั้ง จากนั้นพักให้เย็นอุณหภูมิห้อง",
      "เตรียมผักและท็อปปิง: ล้างอารูกูลาให้สะอาดแล้วสะเด็ดน้ำ บี้เฟต้าชีสให้เป็นก้อนเล็ก ๆ ผ่าอะโวคาโดครึ่งหนึ่ง แกะเมล็ด ใช้ช้อนตักเนื้อออกมาแล้วหั่นเป็นชิ้นเต๋าหรือสไลซ์ เมล็ดฟักทองหากยังไม่คั่วให้นำไปคั่วในกระทะแห้งไฟอ่อน 3–5 นาทีจนหอม",
      "เตรียมน้ำสลัดทาฮินี (ถ้าใช้แบบโฮมเมด): ผสมทาฮินีกับน้ำเลมอนเล็กน้อย น้ำอุ่น น้ำผึ้ง/น้ำเชื่อมเมเปิล เกลือ และกระเทียมสับเล็กน้อย คนจนเนียนและข้น ปรับความข้นด้วยน้ำอุ่นตามชอบ",
      "ประกอบสลัด: วางอารูกูลา 3–4 ถ้วยลงในชามหรือจานสลัดขนาดใหญ่ โรยเกลือและพริกไทยเล็กน้อย จากนั้นวางมันเทศอบที่เย็นแล้วกระจายให้ทั่วด้านบน",
      "ใส่ท็อปปิง: โรยเฟต้าชีสบี้และอะโวคาโดหั่นชิ้นลงบนหน้ามันเทศ บีบน้ำเลมอน 1–2 ช้อนโต๊ะลงบนสลัดให้ทั่วเพื่อเพิ่มความสดชื่น",
      "ราดน้ำสลัดและเสิร์ฟ: ราดน้ำสลัดทาฮินีลงบนสลัด (เริ่มจากปริมาณไม่มากก่อนแล้วค่อยเพิ่ม) จากนั้นโรยเมล็ดฟักทองคั่วด้านบน เสิร์ฟทันที เพื่อให้ผักยังสดและมันเทศไม่แฉะ"
    ]
  },
  {
    "id": "tortilla_pizza",
    "title": "พิซซ่าแป้งตอร์ติญ่า",
    "prep_time": "<30 นาที",
    "cook_time": "<10 นาที",
    "total_time": "20–30 นาที",
    "image": "assets/images/categories/salad_and_healthy/tortilla_pizza.jpg",
    "ingredients": [
      "แผ่นตอร์ติญ่า 4 แผ่น",
      "มะเขือเทศสับกระป๋อง (ระบายน้ำแล้ว) ประมาณ 1–1.5 ถ้วย",
      "ชีสเพโคริโนหรือเชดดาร์ ขูด 1–2 ถ้วย",
      "พริกหวานอบ (หั่นเส้นหรือหั่นชิ้นพอดีคำ)",
      "ร็อกเก็ต (ใบอารูกูลา) สำหรับโรยหน้า",
      "บัลซามิก 1–2 ช้อนโต๊ะ (สำหรับราดตกแต่ง)",
      "น้ำมันมะกอกเล็กน้อย (สำหรับทาแผ่นตอร์ติญ่าให้กรอบ)",
      "เกลือและพริกไทยดำป่นเล็กน้อย"
    ],
    "steps": [
      "วอร์มเตาอบ: เปิดเตาอบที่อุณหภูมิ 220°C เตรียมถาดอบ 1–2 ถาด รองด้วยกระดาษรองอบ",
      "เตรียมฐานพิซซ่า: วางแผ่นตอร์ติญ่าลงบนถาด ทาน้ำมันมะกอกบาง ๆ ลงบนหน้าแผ่นทั้งสองด้าน (โดยเฉพาะด้านล่าง) เพื่อช่วยให้กรอบ จากนั้นตักมะเขือเทศสับที่ระบายน้ำแล้วลงบนแผ่นแต่ละแผ่น ใช้ช้อนเกลี่ยให้ทั่วแต่เว้นขอบไว้เล็กน้อย โรยเกลือและพริกไทยบาง ๆ ลงบนมะเขือเทศ",
      "ใส่ชีสและท็อปปิง: โรยชีสขูด (เพโคริโนหรือเชดดาร์) ให้ทั่วบนซอสมะเขือเทศ จากนั้นวางพริกหวานอบหั่นเส้นหรือชิ้นไว้ด้านบน กระจายให้ทั่วเพื่อให้ทุกคำมีท็อปปิง",
      "อบ: นำถาดเข้าเตาอบ อบประมาณ 4–6 นาที หรือจนขอบตอร์ติญ่าเริ่มกรอบและชีสละลายเป็นฟองเล็กน้อย หากต้องการให้กรอบมากขึ้นสามารถเพิ่มเวลาอบอีกเล็กน้อยโดยคอยสังเกตไม่ให้ไหม้",
      "ตกแต่งและเสิร์ฟ: นำพิซซ่าออกจากเตา โรยใบร็อกเก็ตสดลงบนหน้า ราดบัลซามิกเป็นลายเส้นบาง ๆ ด้านบน ใช้มีดตัดพิซซ่าเป็นชิ้นสามเหลี่ยมหรือชิ้นสี่เหลี่ยม เสิร์ฟทันทีขณะยังร้อนและแผ่นตอร์ติญ่ากรอบ"
    ]
  },
  {
    "id": "vegetarian_burritos",
    "title": "เบอร์ริโตมังสวิรัติ",
    "prep_time": "<30 นาที",
    "cook_time": "10–30 นาที",
    "total_time": "40–60 นาที",
    "image": "assets/images/categories/salad_and_healthy/vegetarian_burritos.jpg",
    "ingredients": [
      "กระเทียม 2–3 กลีบ (สับละเอียด)",
      "พริกแดงสด 1 เม็ด (หั่นเล็ก หรือใช้พริกแห้งบดตามชอบ)",
      "ถั่วบอร์ล็อตติ 1 กระป๋อง (ล้างและสะเด็ดน้ำ)",
      "มะเขือเทศเชอร์รี่ 1–1.5 ถ้วย (ผ่าครึ่งหรือหั่นเต๋า)",
      "อะโวคาโด 1 ลูก",
      "เฟต้าชีสหรือเต้าหู้ 1 ถ้วย (หั่นเต๋า/บี้เป็นก้อน)",
      "แผ่นตอร์ติญ่า 6–8 แผ่น",
      "น้ำมันมะกอกหรือน้ำมันพืช 1–2 ช้อนโต๊ะ",
      "ผงยี่หร่า 1 ช้อนชา",
      "ปาปริก้า 1 ช้อนชา (เพิ่มได้หากชอบรสจัด)",
      "เกลือและพริกไทยดำป่น",
      "น้ำเลมอนหรือน้ำมะนาว 1–2 ช้อนโต๊ะ"
    ],
    "steps": [
      "เตรียมวัตถุดิบ: ล้างถั่วบอร์ล็อตติแล้วสะเด็ดน้ำ ผ่าครึ่งหรือหั่นมะเขือเทศเชอร์รี่เป็นชิ้นเล็ก ๆ ปอกอะโวคาโด หั่นเป็นชิ้นเต๋าแล้วราดน้ำเลมอนเล็กน้อยกันดำ บี้เฟต้าชีสหรือหั่นเต้าหู้เป็นชิ้นเต๋าพอดีคำ",
      "ผัดกระเทียมและพริก: ตั้งกระทะบนไฟกลาง ใส่น้ำมันมะกอกหรือน้ำมันพืช 1–2 ช้อนโต๊ะ พอน้ำมันร้อนใส่กระเทียมสับและพริกแดงลงไปผัดประมาณ 1–2 นาทีจนหอม ระวังไม่ให้ไหม้",
      "ทำไส้ถั่ว: ใส่ถั่วบอร์ล็อตติลงในกระทะ ตามด้วยมะเขือเทศเชอร์รี่ หรี่ไฟลงเล็กน้อย โรยผงยี่หร่าและปาปริก้า คลุกให้เครื่องเทศเคลือบถั่วและมะเขือเทศทั่วกัน ผัดประมาณ 5–7 นาทีจนมะเขือเทศปล่อยน้ำและถั่วร้อนทั่ว หากแห้งเกินไปสามารถเติมน้ำเล็กน้อยได้ ปรุงรสด้วยเกลือและพริกไทย ชิมและปรับรสตามชอบ ปิดไฟแล้วพักให้ไส้ถั่วอุ่นลง",
      "อุ่นแผ่นตอร์ติญ่า: อุ่นแผ่นตอร์ติญ่าบนกระทะแห้งไฟอ่อนครั้งละ 1 แผ่น ด้านละประมาณ 20–30 วินาที หรือห่อรวมกันด้วยฟอยล์แล้วนำเข้าเตาอบ 3–5 นาทีจนแผ่นนุ่มและอุ่น",
      "ประกอบเบอร์ริโต: วางแผ่นตอร์ติญ่าบนเขียง วางไส้ถั่วลงกลางแผ่นตามแนวยาว ตามด้วยชิ้นอะโวคาโดและเฟต้าชีส/เต้าหู้ ราดน้ำเลมอนหรือน้ำมะนาวเล็กน้อยหากต้องการความสดชื่น เพิ่มเกลือ/พริกไทยเล็กน้อยถ้าชอบ",
      "ห่อให้แน่น: พับขอบด้านซ้ายและขวาเข้าหากันเล็กน้อยก่อน จากนั้นพับขอบด้านล่างขึ้นทับไส้ แล้วม้วนขึ้นไปด้านบนให้แน่นจนสุดแผ่น จะได้เบอร์ริโตทรงกระบอกแน่น ๆ",
      "อุ่นเบอร์ริโต (ตัวเลือก): หากต้องการให้ด้านนอกกรอบเล็กน้อย ให้วางเบอร์ริโตที่ห่อแล้วลงบนกระทะแห้งไฟกลาง คว่ำด้านรอยต่อ ลงย่างด้านละ 1–2 นาทีจนผิวกรอบนิด ๆ แล้วเสิร์ฟทันที สามารถเสิร์ฟคู่กับซัลซ่า ซาวครีม หรือผักสดตามชอบ"
    ]
  }
]
