[
  {
    "id": "garlic_butter_shrimp",
    "title": "กุ้งผัดเนยกระเทียม",
    "prep_time": "5 นาที",
    "cook_time": "5 นาที",
    "total_time": "10 นาที",
    "image": "assets/images/categories/seafood/garlic_butter_shrimp.jpg",
    "ingredients": [
      "กุ้งใหญ่ 1 ปอนด์ (ประมาณ 450 กรัม ปอกเปลือกและผ่าหลังเอาเส้นดำออก)",
      "เลมอนโซดา 1 กระป๋อง (หรือน้ำอัดลมรสเลมอน ประมาณ 330 มล. สำหรับหมัก)",
      "เนย 4 ช้อนโต๊ะ",
      "กระเทียมสับ 3–4 กลีบ",
      "เกลือเล็กน้อย",
      "พริกไทยดำป่นเล็กน้อย",
      "อิตาเลียนซีซันนิ่ง 1–2 ช้อนชา",
      "น้ำเลมอน 1–2 ช้อนโต๊ะ",
      "พาร์สลีย์สดสับ 2 ช้อนโต๊ะ (สำหรับโรยหน้า)"
    ],
    "steps": [
      "เตรียมกุ้ง: ล้างกุ้งให้สะอาด ปอกเปลือกและผ่าหลังเอาเส้นดำออก (ถ้ายังไม่ทำ) ซับให้แห้งด้วยกระดาษทิชชู่เล็กน้อย แล้วใส่กุ้งลงในชาม เทเลมอนโซดาให้ท่วมกุ้ง หมักทิ้งไว้ประมาณ 10 นาทีเพื่อช่วยดับกลิ่นคาวและทำให้เนื้อนุ่ม จากนั้นเทเลมอนโซดาทิ้งและซับกุ้งให้แห้งอีกครั้งก่อนนำไปผัด",
      "เตรียมกระทะ: ตั้งกระทะก้นหนาบนไฟกลาง ใส่เนย 4 ช้อนโต๊ะลงไป พอเนยเริ่มละลายและมีฟอง ให้ใส่กระเทียมสับลงไปผัดประมาณ 30 วินาที–1 นาทีจนหอมและเริ่มเป็นสีทองอ่อน ระวังไม่ให้กระเทียมไหม้เพราะจะขม",
      "ผัดกุ้ง: เพิ่มไฟเป็นไฟกลางค่อนไปทางแรง ใส่กุ้งที่หมักและสะเด็ดน้ำแล้วลงในกระทะ เรียงให้กุ้งสัมผัสกระทะให้มากที่สุด ผัดหรือพลิกกุ้งประมาณด้านละ 1–2 นาที จนกุ้งเปลี่ยนเป็นสีส้มอมชมพูและเนื้อทึบใสเล็กน้อย ไม่ควรผัดนานเกินไปเพราะกุ้งจะแข็ง",
      "ปรุงรส: เมื่อกุ้งเกือบสุกเต็มที่ ให้โรยเกลือ พริกไทย และอิตาเลียนซีซันนิ่งลงไป คลุกให้เข้าเนื้อ จากนั้นบีบน้ำเลมอนลงไป 1–2 ช้อนโต๊ะ ผัดอีกประมาณ 30 วินาทีให้ทุกอย่างเข้ากันและซอสเนยกระเทียมเคลือบตัวกุ้งทั่ว",
      "เสิร์ฟ: ปิดไฟ โรยพาร์สลีย์สดสับลงบนกุ้ง คลุกเบา ๆ ให้กระจาย จัดกุ้งและซอสเนยกระเทียมลงจาน เสิร์ฟร้อน ๆ คู่กับขนมปังกระเทียม ข้าวสวย หรือพาสต้าได้ตามชอบ"
    ]
  },
  {
    "id": "grilled_salmon_steak",
    "title": "สเต็กแซลมอนย่าง",
    "prep_time": "15 นาที",
    "cook_time": "4–5 นาที (ต่อด้าน)",
    "total_time": "19–20 นาที",
    "image": "assets/images/categories/seafood/grilled_salmon_steak.jpg",
    "ingredients": [
      "สเต็กแซลมอน 4 ชิ้น (ชิ้นหนาประมาณ 2–3 ซม.)",
      "เกลือทะเล",
      "พริกไทยดำบดสด",
      "น้ำมันมะกอก 1–2 ช้อนโต๊ะ (สำหรับทาชิ้นปลาและกระทะ/ตะแกรง)",
      "เนยหรือกี 2 ช้อนโต๊ะ (ตัวเลือก สำหรับราดตอนย่าง)",
      "เลมอน 1–2 ลูก (ผ่าซีกสำหรับเสิร์ฟ)"
    ],
    "steps": [
      "เตรียมปลา: ซับสเต็กแซลมอนให้แห้งด้วยกระดาษทิชชู่ทั้งสองด้าน จากนั้นทาน้ำมันมะกอกบาง ๆ ให้ทั่ว โรยเกลือทะเลและพริกไทยดำบดสดทั้งสองด้านในปริมาณค่อนข้างพอสมควร (เพราะบางส่วนจะหลุดไปตอนย่าง) ปล่อยให้ปลาอยู่ที่อุณหภูมิห้อง 10–15 นาทีในขณะเตรียมกระทะหรือเตาย่าง",
      "อุ่นกระทะ/เตาย่าง: ตั้งกระทะกริลล์หรือเตาย่างบนไฟกลางค่อนแรง ทาน้ำมันมะกอกบาง ๆ บนพื้นผิวกระทะ/ตะแกรง รอให้ร้อนจนเริ่มมีควันบาง ๆ (ประมาณ 3–5 นาที)",
      "ย่างด้านแรก: วางสเต็กแซลมอนลงบนกระทะโดยให้ด้านหนัง (ถ้ามี) หงายลงหรือคว่ำลงตามชอบ กดเบา ๆ ด้วยตะหลิวเพื่อให้ผิวสัมผัสกระทะดี ย่างโดยไม่ขยับประมาณ 4–5 นาที จนด้านล่างเป็นรอยกริลล์สวยและเนื้อปลาสุกขึ้นมาประมาณครึ่งหนึ่งของความหนา",
      "ย่างด้านสองและราดเนย: พลิกชิ้นปลาอย่างระมัดระวัง ย่างอีกด้านประมาณ 4–5 นาที สำหรับระดับสุกปานกลาง–ฉ่ำ ระหว่างย่างสามารถใส่เนยหรือกี 2 ช้อนโต๊ะลงบนกระทะ พอเนยละลายใช้ช้อนราดเนยร้อน ๆ ลงบนตัวปลาเป็นระยะเพื่อเพิ่มความหอมและความมัน",
      "เช็กความสุก: ปลาแซลมอนควรสุกแต่ยังฉ่ำด้านใน (สามารถใช้เทอร์โมมิเตอร์เสียบวัด อุณหภูมิภายในประมาณ 50–55°C สำหรับแบบยังฉ่ำ) หากต้องการสุกมากขึ้นให้ย่างเพิ่มด้านละ 1–2 นาที",
      "พักและเสิร์ฟ: ยกปลาออกจากกระทะ วางบนจานหรือเขียงแล้วพักไว้ 2–3 นาทีให้เนื้อเซ็ตตัว จากนั้นจัดใส่จาน เสิร์ฟพร้อมชิ้นเลมอนสำหรับบีบเพิ่มรส เปลี่ยนคู่กินได้ทั้งกับผักย่าง มันบด หรือสลัด"
    ]
  },
  {
    "id": "spicy_tuna_salad",
    "title": "สลัดทูน่าเผ็ด",
    "prep_time": "10 นาที",
    "cook_time": "5 นาที",
    "total_time": "15 นาที",
    "image": "assets/images/categories/seafood/spicy_tuna_salad.jpg",
    "ingredients": [
      "ทูน่าในน้ำมัน 2 กระป๋อง (สะเด็ดน้ำมัน)",
      "แครอทหั่นเต๋า 1/2 ถ้วย",
      "ถั่วลันเตา 1/2 ถ้วย (สดหรือแช่แข็ง)",
      "มายองเนส 1/3–1/2 ถ้วย (ปรับตามความข้นที่ต้องการ)",
      "น้ำเลมอน 1–2 ช้อนโต๊ะ",
      "ผักชีสดสับ 2–3 ช้อนโต๊ะ",
      "พริกฮาลาปินโยหรือเซอร์ราโนหั่นละเอียด 1–2 เม็ด (ปรับความเผ็ดตามชอบ)",
      "เกลือและพริกไทยดำป่นเล็กน้อย"
    ],
    "steps": [
      "ต้มผัก: ต้มน้ำในหม้อให้เดือด ใส่เกลือเล็กน้อย จากนั้นใส่แครอทหั่นเต๋าและถั่วลันเตาลงไปต้มประมาณ 3–5 นาที จนผักนิ่มแต่ยังมีความกรุบเล็กน้อย เทผักลงตะแกรงแล้วล้างด้วยน้ำเย็นเพื่อหยุดความร้อน สะเด็ดน้ำแล้วพักไว้ให้เย็น",
      "เตรียมทูน่า: เปิดกระป๋องทูน่า เทน้ำมันออกให้มากที่สุด ใช้ส้อมแหลกทูน่าในชามผสมให้เป็นชิ้นเล็ก ๆ แต่ไม่ต้องละเอียดจนเละ เวลาคลุกจะกระจายรสได้ดี",
      "ทำน้ำสลัดเผ็ด: ในชามผสมอีกใบ ใส่มายองเนส 1/3–1/2 ถ้วย น้ำเลมอน 1–2 ช้อนโต๊ะ ผักชีสับ และพริกฮาลาปินโยหรือเซอร์ราโนหั่นละเอียด คนให้เข้ากันจนเนียน ชิมรสแล้วปรับด้วยน้ำเลมอนเพิ่มถ้าต้องการเปรี้ยวขึ้น หรือเพิ่มพริกหากต้องการเผ็ดมากขึ้น",
      "คลุกสลัด: เททูน่าที่เตรียมไว้ลงในชามน้ำสลัดเผ็ด ใช้ช้อนหรือพายซิลิโคนคลุกเบา ๆ ให้มายองเนสเคลือบเนื้อทูน่าทั่ว จากนั้นใส่แครอทและถั่วลันเตาที่ต้มแล้วลงไป คลุกให้ส่วนผสมทุกอย่างกระจายตัวดี",
      "ปรุงรสและเสิร์ฟ: ชิมอีกครั้ง ปรุงด้วยเกลือและพริกไทยตามชอบ หากสลัดข้นเกินไปสามารถเติมมายองเนสอีกเล็กน้อยหรือหยดน้ำเลมอนเพิ่มเล็กน้อยเพื่อให้คลุกง่าย เสิร์ฟได้ทั้งแบบเดี่ยว ๆ บนจานสลัด กินคู่กับผักสด หรือทาบนขนมปัง/แครกเกอร์"
    ]
  },
  {
    "id": "fried_calamari",
    "title": "ปลาหมึกชุบแป้งทอด",
    "prep_time": "25 นาที",
    "cook_time": "5 นาที",
    "total_time": "30 นาที",
    "image": "assets/images/categories/seafood/fried_calamari.jpg",
    "ingredients": [
      "ปลาหมึก 1 ปอนด์ (ประมาณ 450 กรัม ล้างสะอาดและหั่นเป็นห่วง)",
      "นม 1–1.5 ถ้วย สำหรับแช่ปลาหมึก",
      "แป้งอเนกประสงค์ 1 ถ้วย",
      "แป้งข้าวโพด 1/2 ถ้วย",
      "ผงฟู 1 ช้อนชา",
      "ออริกาโนแห้ง 1 ช้อนชา",
      "พริกคาเยน 1/2–1 ช้อนชา (ปรับตามชอบ)",
      "เกลือและพริกไทยดำป่น",
      "น้ำมันสำหรับทอด (ปริมาณมากพอให้ท่วมปลาหมึก)",
      "เลมอนหั่นซีก (สำหรับเสิร์ฟ)"
    ],
    "steps": [
      "เตรียมปลาหมึก: ล้างปลาหมึกให้สะอาด เอาเยื่อด้านในและกระดูกใสออกให้หมด หั่นเป็นห่วงหนาประมาณ 1 ซม. ใส่ลงในชามแล้วเทนมลงไปให้ท่วม แช่ไว้ประมาณ 30 นาทีเพื่อช่วยให้เนื้อนุ่มและลดกลิ่นคาว จากนั้นสะเด็ดนมออกและซับให้แห้งด้วยกระดาษทิชชู่",
      "เตรียมแป้งชุบทอด: ในชามผสมใบใหญ่ ใส่แป้งอเนกประสงค์ 1 ถ้วย แป้งข้าวโพด 1/2 ถ้วย ผงฟู 1 ช้อนชา ออริกาโนแห้ง 1 ช้อนชา พริกคาเยน 1/2–1 ช้อนชา เกลือ 1/2–1 ช้อนชา และพริกไทยดำป่นเล็กน้อย คนให้ส่วนผสมเข้ากันดี",
      "เตรียมน้ำมันทอด: ใส่น้ำมันลงในหม้อหรือกระทะลึก ตั้งไฟกลาง–แรงให้น้ำมันร้อนถึงประมาณ 175–185°C (350–365°F) ถ้าไม่มีเทอร์โมมิเตอร์ทดสอบโดยโรยแป้งลงไปเล็กน้อย ถ้าแป้งฟูขึ้นมาผิวน้ำมันอย่างรวดเร็วแสดงว่าพร้อมทอด",
      "ชุบและทอด: นำห่วงปลาหมึกที่สะเด็ดน้ำแล้วลงคลุกในส่วนผสมแป้งให้เคลือบทั่ว เขย่าหรือสะบัดแป้งส่วนเกินออก แล้วทยอยหยอดปลาหมึกลงทอดในน้ำมันร้อนทีละชุด (อย่าใส่เยอะเกินไปจะทำให้อุณหภูมิน้ำมันตก) ทอดประมาณ 1–2 นาทีจนแป้งด้านนอกฟูกรอบและเป็นสีทองอ่อน",
      "พักสะเด็ดน้ำมันและเสิร์ฟ: ใช้กระชอนตักปลาหมึกขึ้น พักบนตะแกรงหรือตะแกรงวางบนกระดาษซับน้ำมัน โรยเกลือเพิ่มเล็กน้อยตอนยังร้อนเพื่อให้ซึมเข้าแป้ง เสิร์ฟทันทีพร้อมเลมอนหั่นซีกสำหรับบีบและซอสจิ้ม เช่น มายองเนสผสมกระเทียม หรือน้ำจิ้มซีฟู้ด"
    ]
  },
  {
    "id": "steamed_mussels_white_wine",
    "title": "หอยแมลงภู่นึ่งไวน์ขาว",
    "prep_time": "25 นาที",
    "cook_time": "15 นาที",
    "total_time": "40 นาที",
    "image": "assets/images/categories/seafood/steamed_mussels_white_wine.jpg",
    "ingredients": [
      "หอยแมลงภู่ 2 ปอนด์ (ประมาณ 900 กรัม)",
      "เนย 3–4 ช้อนโต๊ะ",
      "หอมแดงสับละเอียด 2 หัวเล็ก",
      "กระเทียมสับ 3–4 กลีบ",
      "น้ำสต๊อกไก่ 1 ถ้วย",
      "ไวน์ขาวแห้ง 1 ถ้วย",
      "ครีมสด 1/2 ถ้วย (ตัวเลือก)",
      "พาร์สลีย์สับ 2–3 ช้อนโต๊ะ",
      "เกลือและพริกไทยดำป่น",
      "ขนมปังฝรั่งเศสหรือขนมปังเปลือกกรอบ สำหรับเสิร์ฟ"
    ],
    "steps": [
      "ทำความสะอาดหอย: ล้างหอยแมลงภู่ทีละตัว ใต้ก๊อกน้ำไหล ใช้แปรงหรือฝอยเหล็กขัดเศษดินทรายออก ดึงเส้นใย (beard) ที่โผล่ออกจากเปลือกออกให้หมด หากเจอหอยที่เปลือกแตกหรือหอยที่เปิดปากแล้วเคาะเบา ๆ แล้วยังไม่ปิด ให้ทิ้งไป",
      "ผัดหอมแดงและกระเทียม: ตั้งหม้อก้นหนาขนาดใหญ่บนไฟกลาง ใส่เนย 2–3 ช้อนโต๊ะ พอเนยละลายให้ใส่หอมแดงสับลงไปผัดประมาณ 3–4 นาทีจนใสและหอม ตามด้วยกระเทียมสับ ผัดต่ออีก 1 นาที ระวังอย่าให้กระเทียมไหม้",
      "เติมไวน์และน้ำสต๊อก: เทไวน์ขาว 1 ถ้วยและน้ำสต๊อกไก่ 1 ถ้วยลงในหม้อ คนให้เข้ากัน เร่งไฟให้เดือด จากนั้นลดไฟลงเล็กน้อยให้เดือดปุด ๆ ชิมน้ำซอสเบื้องต้นและปรับรสด้วยเกลือและพริกไทยเล็กน้อย (แต่อย่าใส่เกลือเยอะเพราะหอยมีความเค็มธรรมชาติ)",
      "นึ่งหอย: ใส่หอยแมลงภู่ที่ล้างสะอาดแล้วลงในหม้อ ปิดฝาให้สนิท นึ่งด้วยไฟกลาง–แรงประมาณ 6–10 นาที เขย่าหม้อเบา ๆ สัก 1–2 ครั้งระหว่างนึ่ง เพื่อให้หอยด้านล่างขึ้นมาโดนไอน้ำ เมื่อหอยสุกเปลือกจะเปิดออก",
      "ทำซอสครีม (ถ้าต้องการ): เมื่อหอยสุกแล้ว ใช้กระบวยตักหอยที่เปิดเปลือกแล้วออกใส่จานเสิร์ฟ ทิ้งหอยที่ไม่ยอมเปิดฝา จากนั้นลดไฟลง ใส่เนยที่เหลือและครีมสด 1/2 ถ้วยลงในน้ำที่เหลือในหม้อ คนให้เข้ากัน เคี่ยวอีก 2–3 นาทีให้ซอสข้นเล็กน้อย ชิมและปรับรสด้วยเกลือและพริกไทย",
      "เสิร์ฟ: เทซอสไวน์ขาวครีมลงบนหอยที่จัดใส่จานอยู่แล้ว โรยพาร์สลีย์สับด้านบน เสิร์ฟทันทีพร้อมขนมปังฝรั่งเศสหรือขนมปังเปลือกกรอบสำหรับจิ้มซอส"
    ]
  }
]
