[
  {
    "id": "garlic_parmesan_bread_bites",
    "title": "ขนมปังกระเทียมพาร์เมซาน",
    "prep_time": "10 นาที",
    "cook_time": "15 นาที",
    "total_time": "25 นาที",
    "image": "assets/images/categories/snack_and_appetizers/garlic_parmesan_bread_bites.jpg",
    "ingredients": [
      "ขนมปังก้อนหรือบาแก็ต 1 แท่ง (ขนาดกลาง)",
      "เนยละลาย 4 ช้อนโต๊ะ",
      "กระเทียมสับ 3 กลีบ",
      "พาร์เมซานขูด 1/2–3/4 ถ้วย (ตามชอบ)",
      "ผักชีฝรั่งสับ 2–3 ช้อนโต๊ะ",
      "เกลือเล็กน้อย (สำหรับปรุงรสเนย)"
    ],
    "steps": [
      "วอร์มเตาอบ: เปิดเตาอบที่อุณหภูมิ 180–190°C เตรียมถาดอบรองด้วยกระดาษรองอบหรือทาเนย/น้ำมันบาง ๆ เพื่อกันติด",
      "เตรียมขนมปัง: หั่นขนมปังก้อนหรือบาแก็ตให้เป็นชิ้นพอดีคำ หนาประมาณ 2 ซม. สามารถหั่นเป็นชิ้นเต๋าหรือชิ้นแว่นแล้วผ่าครึ่งก็ได้ ใส่ลงในชามผสมใบใหญ่",
      "ทำส่วนผสมเนยกระเทียม: ในชามเล็ก ผสมเนยละลาย 4 ช้อนโต๊ะ กระเทียมสับ 3 กลีบ ผักชีฝรั่งสับ 2–3 ช้อนโต๊ะ และเกลือเล็กน้อย คนให้เข้ากันดีให้กระเทียมและผักชีฝรั่งกระจายทั่วในเนย",
      "คลุกขนมปัง: เทส่วนผสมเนยกระเทียมลงในชามขนมปัง ใช้ช้อนหรือมือสะอาดคลุกเบา ๆ ให้ขนมปังทุกชิ้นเคลือบด้วยเนยกระเทียมอย่างทั่วถึง",
      "เรียงและโรยชีส: เทขนมปังที่คลุกเนยแล้วลงบนถาดอบ เกลี่ยให้เป็นชั้นเดียวไม่ซ้อนกันมากเกินไป โรยพาร์เมซานขูดให้ทั่วด้านบนแต่ละชิ้นในปริมาณตามชอบ",
      "อบ: นำถาดเข้าเตาอบ อบประมาณ 12–15 นาที หรือจนขนมปังกรอบและชีสละลายเป็นสีทองอ่อน ๆ หากต้องการกรอบมากขึ้นสามารถอบเพิ่มอีก 2–3 นาที โดยคอยสังเกตไม่ให้ไหม้",
      "เสิร์ฟ: นำออกจากเตา พักให้เย็นลงเล็กน้อย (ยังอุ่น ๆ) แล้วจัดใส่จานเสิร์ฟทันที เป็นของกินเล่นหรือเสิร์ฟคู่กับซุป/พาสต้า"
    ]
  },
  {
    "id": "honey_mustard_pretzel_bites",
    "title": "เพรทเซลคำเล็กซอสฮันนี่มัสตาร์ด",
    "prep_time": "15 นาที",
    "cook_time": "10 นาที",
    "total_time": "25 นาที",
    "image": "assets/images/categories/snack_and_appetizers/honey_mustard_pretzel_bites.jpg",
    "ingredients": [
      "มินิพรีทเซล 3 ถ้วย",
      "เนยละลาย 3 ช้อนโต๊ะ",
      "น้ำผึ้ง 1 ช้อนโต๊ะ",
      "มัสตาร์ดดิจอง 1 ช้อนโต๊ะ"
    ],
    "steps": [
      "วอร์มเตาอบ: เปิดเตาอบที่อุณหภูมิ 160–180°C เตรียมถาดอบรองด้วยกระดาษรองอบ",
      "ผสมน้ำปรุง: ในชามผสมใบเล็ก ใส่เนยละลาย 3 ช้อนโต๊ะ น้ำผึ้ง 1 ช้อนโต๊ะ และมัสตาร์ดดิจอง 1 ช้อนโต๊ะ ใช้ตะกร้อมือหรือตะเกียบคนจนส่วนผสมเข้ากันดีเป็นเนื้อเดียว",
      "คลุกพรีทเซล: ใส่มินิพรีทเซล 3 ถ้วยลงในชามผสมใบใหญ่ เทส่วนผสมเนยน้ำผึ้งมัสตาร์ดลงไป ใช้พายหรือตะหลิวคลุกเบา ๆ ให้ซอสเคลือบพรีทเซลทุกชิ้นอย่างทั่วถึง",
      "อบ: เทพรีทเซลที่เคลือบซอสแล้วลงในถาดอบ เกลี่ยให้เป็นชั้นเดียว นำเข้าเตาอบประมาณ 8–10 นาที ระหว่างอบสามารถคนหรือเขย่าถาดสัก 1 ครั้งกลางเวลาเพื่อให้สุกและแห้งสม่ำเสมอ",
      "พักและเสิร์ฟ: เมื่อเนยและซอสเคลือบเริ่มแห้งเหนียวและหอม นำออกจากเตา พักให้เย็นลงบนถาดสัก 5–10 นาทีจนคลายร้อน จากนั้นตักใส่ชามเสิร์ฟ เป็นของกินเล่นกรุบกรอบรสหวานเปรี้ยวเค็มเล็กน้อย"
    ]
  },
  {
    "id": "crispy_baked_potato_wedges",
    "title": "มันฝรั่งเวดจ์อบกรอบ",
    "prep_time": "10 นาที",
    "cook_time": "35 นาที",
    "total_time": "45 นาที",
    "image": "assets/images/categories/snack_and_appetizers/crispy_baked_potato_wedges.jpg",
    "ingredients": [
      "มันฝรั่ง 3 หัวใหญ่",
      "น้ำมันมะกอก 2–3 ช้อนโต๊ะ",
      "พริกป่น 1 ช้อนชา (หรือพริกปาปริก้า สำหรับรสไม่เผ็ดมาก)",
      "กระเทียมผง 1 ช้อนชา",
      "เกลือ 1/2–1 ช้อนชา (ปรับตามชอบ)",
      "พริกไทยดำป่นเล็กน้อย",
      "ผักชีฝรั่งสับสำหรับโรยหน้า"
    ],
    "steps": [
      "วอร์มเตาอบ: เปิดเตาอบที่อุณหภูมิ 200–220°C เตรียมถาดอบรองด้วยกระดาษรองอบหรือพ่นสเปรย์น้ำมันบาง ๆ",
      "เตรียมันฝรั่ง: ล้างมันฝรั่งให้สะอาด ขูดดินออกให้หมด สามารถปอกเปลือกหรือเก็บเปลือกไว้ตามชอบ ผ่ามันฝรั่งแต่ละหัวครึ่งตามยาว จากนั้นหั่นเป็นชิ้นเวดจ์ (เสี้ยว) ขนาดเท่า ๆ กันประมาณหัวละ 6–8 ชิ้น",
      "แช่น้ำ (ตัวเลือกเพื่อความกรอบ): ใส่มันฝรั่งหั่นเสี้ยวลงในชามน้ำเย็น แช่ไว้ประมาณ 10–15 นาทีเพื่อล้างแป้งส่วนเกิน จะช่วยให้กรอบขึ้น จากนั้นสะเด็ดน้ำและซับให้แห้งด้วยกระดาษทิชชู่ให้มากที่สุด",
      "คลุกเครื่องปรุง: ใส่มันฝรั่งที่แห้งแล้วลงในชามผสม ราดน้ำมันมะกอก 2–3 ช้อนโต๊ะ โรยพริกป่นหรือปาปริก้า กระเทียมผง เกลือ และพริกไทย คลุกด้วยมือหรือพายจนเครื่องปรุงเคลือบชิ้นมันฝรั่งทั่วทุกด้าน",
      "เรียงและอบ: วางมันฝรั่งลงบนถาดอบให้ด้านตัดกว้างแนบกับถาดและไม่ซ้อนกันมากเกินไป นำเข้าเตาอบ อบประมาณ 30–35 นาที โดยครึ่งเวลาผ่านไป (ประมาณ 15–20 นาที) ให้พลิกชิ้นมันฝรั่งกลับด้านเพื่อให้กรอบทั้งสองด้าน",
      "เสิร์ฟ: เมื่อเวดจ์สุกกรอบเป็นสีทอง นำออกจากเตา โรยผักชีฝรั่งสับด้านบนทันที จัดใส่จาน เสิร์ฟร้อน ๆ คู่กับซอสมะเขือเทศ มายองเนส หรือซอสดิปอื่น ๆ ตามชอบ"
    ]
  },
  {
    "id": "mini_chicken_quesadilla_bites",
    "title": "เคซาดิญ่ามินิไก่",
    "prep_time": "15 นาที",
    "cook_time": "10 นาที",
    "total_time": "25 นาที",
    "image": "assets/images/categories/snack_and_appetizers/mini_chicken_quesadilla_bites.jpg",
    "ingredients": [
      "แผ่นตอร์ติญ่า (ขนาดกลางหรือใหญ่) 4–6 แผ่น",
      "อกไก่ฉีก 1–1.5 ถ้วย (อาจเป็นไก่ต้ม/ไก่อบเหลือใช้)",
      "ชีสเชดดาร์ขูด 1–1.5 ถ้วย",
      "ซัลซ่า 1/2–1 ถ้วย",
      "น้ำมันหรือเนยเล็กน้อยสำหรับย่างในกระทะ",
      "ครีมเปรี้ยวสำหรับเสิร์ฟ (ตัวเลือก)"
    ],
    "steps": [
      "เตรียมไส้ไก่: หากยังไม่มีไก่ฉีก สามารถใช้อกไก่ต้ม/อบ หั่นหรือฉีกเป็นเส้นพอดีคำ ปรุงรสด้วยเกลือและพริกไทยเล็กน้อยถ้าต้องการ",
      "ตัดแผ่นตอร์ติญ่า: ใช้พิมพ์วงกลมหรือปากแก้วกดลงบนแผ่นตอร์ติญ่าให้ได้วงกลมขนาดเล็ก (ประมาณเส้นผ่านศูนย์กลาง 7–8 ซม.) ซ้อนเศษที่เหลือไว้สามารถใช้ทำอย่างอื่นต่อได้",
      "ประกอบเคสดีย่าชิ้นเล็ก: วางแผ่นตอร์ติญ่าที่ตัดแล้วลงบนเขียง ใส่ชีสขูดเล็กน้อยลงบนครึ่งหนึ่งของแผ่น ตามด้วยไก่ฉีกและซัลซ่าปริมาณเล็กน้อยด้านบนไก่ แล้วโรยชีสเพิ่มอีกบาง ๆ ด้านบนสุด จากนั้นพับแผ่นตอร์ติญ่าให้เป็นครึ่งวงกลม กดขอบเบา ๆ ให้ติดกัน",
      "ย่างในกระทะ: ตั้งกระทะแบนหรือกระทะเทฟลอนบนไฟกลาง ทาน้ำมันหรือเนยบาง ๆ วางเคสดีย่าชิ้นเล็กลงในกระทะทีละชุด ย่างด้านละประมาณ 2–3 นาที จนแผ่นตอร์ติญ่าด้านนอกเป็นสีทองและกรอบ และชีสด้านในละลาย",
      "เสิร์ฟ: นำออกจากกระทะ จัดใส่จาน เสิร์ฟร้อน ๆ พร้อมซัลซ่าเพิ่มด้านข้างและครีมเปรี้ยวสำหรับจิ้ม เป็นของกินเล่นชิ้นพอดีคำ"
    ]
  },
  {
    "id": "creamy_cucumber_dill_bites",
    "title": "แตงกวาดิลล์ครีมคำพอดี",
    "prep_time": "10 นาที",
    "cook_time": "0 นาที",
    "total_time": "10 นาที",
    "image": "assets/images/categories/snack_and_appetizers/creamy_cucumber_dill_bites.jpg",
    "ingredients": [
      "แตงกวาหั่นแว่น หนาประมาณ 1 ซม. 1–2 ลูก (ให้ได้ชิ้น 20–24 ชิ้น)",
      "ครีมชีส 120–150 กรัม (อุณหภูมิห้องจะปาดง่าย)",
      "ดิลสดสับ 2–3 ช้อนโต๊ะ",
      "น้ำเลมอน 1–2 ช้อนชา",
      "ปาปริก้าป่น สำหรับโรยหน้า",
      "เกลือเล็กน้อย",
      "พริกไทยดำป่นเล็กน้อย"
    ],
    "steps": [
      "เตรียมแตงกวา: ล้างแตงกวาให้สะอาด ปอกบางส่วนหรือไม่ปอกตามชอบ หั่นเป็นแว่นหนาประมาณ 1 ซม. เรียงบนจานหรือถาดเสิร์ฟให้สวยงาม ใช้กระดาษทิชชู่ซับหน้าผิวแตงกวาเล็กน้อยให้แห้งเพื่อให้ครีมชีสเกาะได้ดี",
      "เตรียมครีมชีสดิล: ใส่ครีมชีสลงในชามผสม (ควรเป็นครีมชีสที่วางทิ้งไว้ให้นิ่มที่อุณหภูมิห้อง) ใช้ส้อมหรือพายยีให้เนียน จากนั้นใส่ดิลสดสับ 2–3 ช้อนโต๊ะ น้ำเลมอน 1–2 ช้อนชา เกลือ และพริกไทยเล็กน้อย คนให้เข้ากันจนเป็นครีมเนื้อเนียน ชิมรสแล้วปรับด้วยน้ำเลมอนหรือเกลือเพิ่มได้ตามชอบ",
      "แต่งหน้าบนแตงกวา: ใช้ช้อนเล็กปาดครีมชีสดิลลงบนแว่นแตงกวาทุกชิ้น หรือใช้ถุงบีบครีม (piping bag) ติดหัวบีบสวย ๆ บีบลงบนแตงกวาให้ดูน่ากิน",
      "โรยหน้าและเสิร์ฟ: โรยปาปริก้าป่นเล็กน้อยบนหน้าครีมชีสทุกชิ้นเพื่อเพิ่มสีสัน สามารถตกแต่งด้วยยอดดิลเล็กน้อยบนแต่ละชิ้น เสิร์ฟทันทีหรือแช่เย็นสักครู่ก่อนเสิร์ฟ เป็นของว่างเย็นสดชื่น"
    ]
  }
]
