[
  {
    "id": "tom_yum_goong",
    "title": "ต้มยำกุ้ง",
    "prep_time": "20 นาที",
    "cook_time": "20 นาที",
    "total_time": "40 นาที",
    "image": "assets/images/categories/soap_and_curry/tom_yum_goong.jpg",
    "ingredients": [
      "หัวกุ้งและเปลือกกุ้งจากกุ้ง 12–15 ตัว (สำหรับทำน้ำสต๊อก)",
      "น้ำ 5–6 ถ้วย (เคี่ยวแล้วให้เหลือประมาณ 4 ถ้วย)",
      "กุ้งสดตัวกลาง 12–15 ตัว (ปอกเปลือก ผ่าหลังดึงเส้นดำออก เหลือหางไว้สวยงาม)",
      "ตะไคร้ 2 ต้น (หั่นท่อนยาว 3–4 ซม. แล้วบุบพอแตก)",
      "ข่าแก่หั่นแว่น 8 แว่น",
      "ใบมะกรูด 6 ใบ (ฉีกเอาแกนกลางออก)",
      "เห็ดนางรมหรือเห็ดฟาง 200 กรัม (หั่นครึ่งหรือหั่นชิ้นพอดีคำ)",
      "พริกขี้หนูสวน 6–10 เม็ด (บุบพอแตก ปรับตามความเผ็ดที่ชอบ)",
      "น้ำพริกเผาต้มยำ 2–3 ช้อนโต๊ะ",
      "น้ำปลา 3–4 ช้อนโต๊ะ (ปรับตามชอบ)",
      "น้ำมะนาวคั้นสด 3–4 ช้อนโต๊ะ (คั้นเตรียมไว้ ใส่ตอนปิดไฟแล้ว)",
      "น้ำตาลทราย 1–2 ช้อนชา",
      "ผักชีหรือผักชีฝรั่งซอย สำหรับโรยหน้า"
    ],
    "steps": [
      "ทำน้ำสต๊อกกุ้ง: ใส่หัวและเปลือกกุ้งลงในหม้อ เติมน้ำ 5–6 ถ้วย ตั้งไฟกลาง พอน้ำเริ่มเดือดให้หรี่เป็นไฟกลาง–อ่อน ใช้ทัพพีช้อนฟองทิ้ง เคี่ยวประมาณ 20–30 นาทีให้ได้น้ำสต๊อกที่หอมหวานจากกุ้ง จากนั้นกรองเอาเฉพาะน้ำ ควรได้น้ำสต๊อกประมาณ 4 ถ้วย ถ้าเกินสามารถเคี่ยวต่อให้ลดลงได้",
      "เตรียมกุ้งและสมุนไพร: ปอกเปลือกกุ้ง ผ่าหลังดึงเส้นดำออก ล้างให้สะอาด ซับน้ำให้แห้ง เตรียมตะไคร้ ข่า และใบมะกรูดให้เรียบร้อย (หั่นและบุบ/ฉีกตามที่ระบุในส่วนส่วนผสม) ล้างเห็ดและหั่นเป็นชิ้นพอดีคำ",
      "ต้มสมุนไพรและเห็ด: นำน้ำสต๊อกกุ้ง 4 ถ้วยใส่หม้อ ตั้งไฟกลางจนเดือด ใส่ตะไคร้ ข่า และใบมะกรูดลงไป ต้มให้เดือดปุด ๆ ประมาณ 3–5 นาที เพื่อให้กลิ่นสมุนไพรออกเต็มที่ จากนั้นใส่เห็ดนางรมหรือเห็ดฟางลงไป ต้มต่ออีก 2–3 นาทีจนเห็ดเริ่มสุก",
      "เตรียมน้ำต้มยำ: ตักน้ำซุปจากหม้อออกมาประมาณ 1–2 ทัพพีใส่ชามเล็ก ใส่น้ำพริกเผาต้มยำลงไป 2–3 ช้อนโต๊ะ คนให้ละลายเข้ากันดี แล้วเทกลับลงไปในหม้อ จะช่วยให้พริกเผาไม่เป็นก้อนในหม้อ",
      "ใส่กุ้ง: เร่งไฟให้ซุปเดือดอีกครั้ง ใส่กุ้งสดลงไปพร้อมกับพริกขี้หนูบุบเบา ๆ ต้มต่อประมาณ 1–2 นาทีจนกุ้งเปลี่ยนเป็นสีส้มอมชมพู เนื้อทึบไม่ใส ระวังอย่าให้กุ้งสุกเกินไปเพราะเนื้อจะแข็ง",
      "ปรุงรส (ยังไม่ใส่น้ำมะนาว): หรี่ไฟลงให้เบา ชิมน้ำซุปเบื้องต้น ปรุงด้วยน้ำปลา 3–4 ช้อนโต๊ะ และน้ำตาลทราย 1–2 ช้อนชา ชิมให้ได้รสเค็มนำตามด้วยเผ็ดเปรี้ยวหวานเล็กน้อย จากนั้นปิดไฟ",
      "ใส่น้ำมะนาวและเสิร์ฟ: หลังปิดไฟแล้วจึงค่อยใส่น้ำมะนาวคั้นสด 3–4 ช้อนโต๊ะลงไป คนให้เข้ากัน (การใส่น้ำมะนาวตอนปิดไฟจะช่วยให้รสเปรี้ยวสดและน้ำซุปไม่ขม) ชิมรสอีกครั้ง ปรับด้วยน้ำปลา/น้ำมะนาวเพิ่มได้ตามชอบ ตักใส่ชาม โรยหน้าด้วยผักชีหรือผักชีฝรั่งซอย เสิร์ฟร้อน ๆ คู่กับข้าวสวย"
    ]
  },
  {
    "id": "green_thai_curry",
    "title": "แกงเขียวหวาน",
    "prep_time": "20 นาที",
    "cook_time": "15 นาที",
    "total_time": "35 นาที",
    "image": "assets/images/categories/soap_and_curry/green_thai_curry.jpg",
    "ingredients": [
      "กะทิ 2 กระป๋อง (รวมประมาณ 800 มล. แบ่งเป็นหัวกะทิและหางกะทิ)",
      "น้ำสต๊อกไก่ 1–1.5 ถ้วย (ปรับตามความข้นของน้ำแกงที่ต้องการ)",
      "เนื้อไก่น่อง 400–500 กรัม (หั่นชิ้นพอดีคำ)",
      "พริกแกงเขียวหวาน 3–4 ช้อนโต๊ะ (ปรับตามความเผ็ด)",
      "มะเขือเปราะ 6–8 ลูก (ผ่าซีกหรือผ่าเป็นสี่ส่วน)",
      "ใบมะกรูด 4–6 ใบ (ฉีกเอาแกนกลางออก)",
      "ใบโหระพา 1 กำเล็ก (เด็ดใบล้างให้สะอาด)",
      "พริกชี้ฟ้าแดงหั่นเฉียง 1–2 เม็ด (สำหรับแต่งหน้า)",
      "น้ำปลา 2–3 ช้อนโต๊ะ (ปรับตามชอบ)",
      "น้ำตาลปี๊บ 1–2 ช้อนโต๊ะ"
    ],
    "steps": [
      "เตรียมกะทิ: แบ่งกะทิออกเป็นสองส่วน ส่วนแรกประมาณ 1 ถ้วยใช้เป็นหัวกะทิสำหรับเคี่ยวให้แตกมัน ส่วนที่เหลือผสมกับน้ำสต๊อกไก่ไว้สำหรับเติมเป็นน้ำแกง",
      "เคี่ยวกะทิจนแตกมัน: ตั้งหม้อหรือกระทะก้นลึกบนไฟกลาง ใส่หัวกะทิ 1 ถ้วยลงไป เคี่ยวไปเรื่อย ๆ ประมาณ 3–5 นาที คนเป็นระยะจนเห็นว่าน้ำมันกะทิเริ่มแยกตัวออกมาเป็นหยดมันบนผิวหน้า (เรียกว่าแตกมัน)",
      "ผัดพริกแกงให้หอม: ใส่พริกแกงเขียวหวาน 3–4 ช้อนโต๊ะลงในหัวกะทิแตกมัน ผัดต่อบนไฟกลาง 2–3 นาทีจนกลิ่นหอมจัดและสีพริกแกงเข้มขึ้นเล็กน้อย ระวังไม่ให้ไหม้ ถ้าแห้งเกินให้เติมหัวกะทิหรือน้ำเล็กน้อย",
      "ใส่ไก่: นำเนื้อไก่น่องหั่นชิ้นลงผัดกับพริกแกง ใช้พายหรือช้อนคนให้ไก่เคลือบด้วยพริกแกงทั่วกัน ผัดประมาณ 3–4 นาทีจนผิวเนื้อไก่เริ่มตึงและเปลี่ยนสี แต่ยังไม่ต้องสุกเต็มที่",
      "เติมกะทิและน้ำสต๊อก: เทกะทิที่เหลือและน้ำสต๊อกไก่ 1–1.5 ถ้วยลงในหม้อ คนให้เข้ากัน เร่งไฟให้เดือด จากนั้นหรี่ไฟเป็นไฟกลางให้เดือดปุด ๆ เคี่ยวประมาณ 5 นาทีให้ไก่สุกและน้ำแกงเริ่มเข้มข้น",
      "ใส่มะเขือและใบมะกรูด: ใส่มะเขือเปราะที่ผ่าชิ้นลงไป ตามด้วยใบมะกรูดฉีก เคี่ยวต่ออีกประมาณ 5–7 นาทีจนมะเขือเปราะนิ่มแต่ไม่เละ หากน้ำแกงข้นเกินไปสามารถเติมน้ำสต๊อกหรือกะทิเพิ่มเล็กน้อยได้",
      "ปรุงรส: ปรุงรสด้วยน้ำปลา 2–3 ช้อนโต๊ะ และน้ำตาลปี๊บ 1–2 ช้อนโต๊ะ คนให้ละลาย ชิมรสให้ได้เค็ม มัน หวานกลมกล่อม หากชอบเผ็ดสามารถเติมพริกแกงเพิ่มเล็กน้อยละลายในน้ำแกง",
      "ใส่โหระพาและเสิร์ฟ: เมื่อมะเขือสุกนิ่มดีแล้ว ปิดไฟ ใส่ใบโหระพาเด็ดใบและพริกชี้ฟ้าแดงหั่นเฉียงลงไป คนเบา ๆ ให้ใบโหระพาพอสลด ตักใส่ถ้วยเสิร์ฟคู่กับข้าวสวยร้อน ๆ"
    ]
  },
  {
    "id": "japanese_miso_soup",
    "title": "ซุปมิโสะญี่ปุ่น",
    "prep_time": "5 นาที",
    "cook_time": "10 นาที",
    "total_time": "15 นาที",
    "image": "assets/images/categories/soap_and_curry/japanese_miso_soup.jpg",
    "ingredients": [
      "น้ำ 4 ถ้วย",
      "ผงดาชิ 2–3 ช้อนชา (ตามความเข้มข้นที่ต้องการ)",
      "มิโสะขาวหรือมิโสะรวม 3–4 ช้อนโต๊ะ",
      "หอมใหญ่หั่นเสี้ยว 1/2 หัว (ตัวเลือก)",
      "เต้าหู้อ่อนหั่นเต๋าเล็ก 1/2 ก้อน (ตัวเลือก)",
      "ต้นหอมซอย สำหรับโรยหน้า"
    ],
    "steps": [
      "ต้มน้ำดาชิ: ใส่น้ำ 4 ถ้วยลงในหม้อขนาดกลาง นำขึ้นตั้งไฟกลาง พอน้ำเริ่มอุ่นใส่ผงดาชิ 2–3 ช้อนชาลงไป คนให้ละลาย หากใช้หอมใหญ่ ให้ใส่หอมใหญ่หั่นเสี้ยวลงไปพร้อมกัน ต้มจนเดือดอ่อน ๆ แล้วลดไฟลงให้เดือดปุด ๆ เคี่ยวต่อรวมเวลาประมาณ 10 นาทีจนหอมหวาน",
      "ใส่เต้าหู้ (ถ้าใช้): หากใช้เต้าหู้อ่อน ให้ใส่เต้าหู้หั่นเต๋าเล็กลงไปในน้ำซุปเบา ๆ ต้มต่ออีก 1–2 นาทีให้เต้าหู้อุ่นขึ้น ระวังอย่าคนแรงเพราะเต้าหู้อาจแตกง่าย",
      "ละลายมิโสะ: ตักน้ำซุปจากหม้อประมาณ 1 ทัพพีใส่ถ้วยเล็ก ใส่มิโสะ 3–4 ช้อนโต๊ะลงในถ้วย ใช้ตะเกียบหรือตะกร้อมือคนจนมิโสะละลายหมด จากนั้นเทส่วนผสมมิโสะกลับลงไปในหม้อผ่านกระชอนตาถี่หรือทัพพี เพื่อให้มิโสะกระจายตัวได้ดีและไม่มีเม็ด",
      "ห้ามต้มแรงหลังใส่มิโสะ: หลังใส่มิโสะแล้วให้ใช้ไฟอ่อนที่สุด และห้ามปล่อยให้ซุปเดือดพล่าน เพราะจะทำให้กลิ่นและรสชาติของมิโสะเสียไป อุ่นให้ซุปร้อนพอเสิร์ฟได้เท่านั้น จากนั้นปิดไฟ",
      "เสิร์ฟ: ตักซุปมิโสะลงถ้วย โรยหน้าด้วยต้นหอมซอย เสิร์ฟทันทีขณะยังร้อน"
    ]
  },
  {
    "id": "italian_tomato_basil_soup",
    "title": "ซุปมะเขือเทศโหระพาแบบอิตาเลียน",
    "prep_time": "15 นาที",
    "cook_time": "55 นาที",
    "total_time": "1 ชั่วโมง 10 นาที",
    "image": "assets/images/categories/soap_and_curry/italian_tomato_basil_soup.jpg",
    "ingredients": [
      "มะเขือเทศสด 3 ปอนด์ (ประมาณ 1.3–1.5 กิโลกรัม ผ่าครึ่งหรือผ่าสี่)",
      "แครอทขนาดกลาง 1 หัว (หั่นแว่นหรือหั่นชิ้นเล็ก)",
      "หอมใหญ่ 1 หัว (หั่นสี่เหลี่ยมลูกเต๋า)",
      "กระเทียม 3–4 กลีบ (สับ)",
      "มะเขือเทศบดกระป๋อง 1 กระป๋อง (ประมาณ 400 กรัม)",
      "น้ำมันมะกอก 3–4 ช้อนโต๊ะ",
      "น้ำสต๊อกผักหรือน้ำสต๊อกไก่ 2–3 ถ้วย (ปรับตามความข้นที่ต้องการ)",
      "ใบโหระพาสด 1 กำมือ (ฉีกหยาบ ๆ)",
      "ใบไธม์สด 2–3 กิ่ง หรือไธม์แห้ง 1/2 ช้อนชา",
      "ออริกาโนแห้ง 1/2–1 ช้อนชา",
      "เกลือและพริกไทยดำป่น",
      "น้ำตาลเล็กน้อย (ถ้าต้องการปรับรสให้กลม)"
    ],
    "steps": [
      "อบมะเขือเทศและแครอท: เปิดเตาอบที่อุณหภูมิ 200°C เรียงมะเขือเทศสดผ่าชิ้นและแครอทหั่นชิ้นลงบนถาดอบ ราดน้ำมันมะกอกประมาณ 1–2 ช้อนโต๊ะ โรยเกลือและพริกไทยเล็กน้อย คลุกให้เคลือบทั่ว นำเข้าอบประมาณ 30–40 นาที จนผักนิ่มและมะเขือเทศมีขอบเกรียมนิด ๆ นำออกมาพักให้เย็นลงสักครู่",
      "ปั่นผักอบ: นำมะเขือเทศและแครอทอบใส่โถปั่น ใส่น้ำสต๊อกเล็กน้อยช่วยให้ปั่นง่าย ปั่นให้ละเอียดหรือหยาบตามชอบ จากนั้นพักไว้ (ถ้าไม่มีเครื่องปั่น สามารถใช้ที่บดหรือส้อมบดหยาบ ๆ ได้)",
      "ผัดหอมและกระเทียม: ตั้งหม้อใบใหญ่บนไฟกลาง ใส่น้ำมันมะกอกที่เหลือ (ประมาณ 1–2 ช้อนโต๊ะ) ใส่หอมใหญ่หั่นเต๋าลงผัด 5–7 นาทีจนหอมและใส ตามด้วยกระเทียมสับ ผัดต่ออีก 1 นาทีจนหอม",
      "รวมน้ำซุปมะเขือเทศ: เทมะเขือเทศบดกระป๋องลงในหม้อ ตามด้วยผักอบที่ปั่นไว้ เติมน้ำสต๊อกผัก/ไก่ที่เหลือจนได้น้ำซุปในความข้นที่ต้องการ ใส่ไธม์และออริกาโน คนให้เข้ากัน เร่งไฟให้เดือด จากนั้นหรี่ไฟลงเป็นไฟอ่อน–กลาง เคี่ยวให้เดือดปุด ๆ ประมาณ 20–25 นาที คอยคนเป็นระยะเพื่อไม่ให้ติดก้นหม้อ",
      "ปรับเนื้อซุปและรสชาติ: หากอยากได้ซุปเนียนสามารถใช้เครื่องปั่นมือถือปั่นในหม้อให้เนียนขึ้น (ระวังความร้อน) ชิมรส ปรุงเพิ่มด้วยเกลือ พริกไทย และน้ำตาลเล็กน้อยถ้ามะเขือเทศเปรี้ยวจัด",
      "ใส่โหระพาและเสิร์ฟ: ก่อนปิดไฟ 2–3 นาที ใส่ใบโหระพาฉีกหยาบลงไป เคี่ยวต่อจนใบโหระพาสลด จากนั้นปิดไฟ ตักซุปใส่ถ้วย เสิร์ฟร้อน ๆ คู่กับขนมปังฝรั่งเศสหรือขนมปังปิ้งกรอบ"
    ]
  },
  {
    "id": "indian_chicken_curry",
    "title": "แกงไก่อินเดีย",
    "prep_time": "20 นาที",
    "cook_time": "25 นาที",
    "total_time": "45 นาที",
    "image": "assets/images/categories/soap_and_curry/indian_chicken_curry.jpg",
    "ingredients": [
      "น้ำมันมะกอกหรือน้ำมันพืช 2–3 ช้อนโต๊ะ",
      "หอมใหญ่สับ 1 หัว",
      "กระเทียมสับ 3–4 กลีบ",
      "ขิงขูด 1 ช้อนโต๊ะ",
      "ผงกะหรี่ 2 ช้อนชา",
      "ผงปาปริก้า 1–2 ช้อนชา",
      "ผงอบเชย 1/2 ช้อนชา หรือแท่งอบเชย 1 แท่งเล็ก",
      "ไก่หั่นชิ้น 500–600 กรัม (เช่น อกไก่หรือน่องไก่เลาะกระดูก หั่นชิ้นพอดีคำ)",
      "โยเกิร์ตรสธรรมชาติ 1/2 ถ้วย",
      "กะทิ 1 กระป๋อง (ประมาณ 400 มล.)",
      "มะเขือเทศเข้มข้น (Tomato paste) 2–3 ช้อนโต๊ะ",
      "น้ำเปล่าหรือน้ำสต๊อกไก่ 1/2–1 ถ้วย (ถ้าต้องการปรับความข้น)",
      "น้ำมะนาว 1–2 ช้อนโต๊ะ",
      "พริกสดหรือพริกป่นตามชอบ",
      "เกลือและพริกไทยดำป่น",
      "ผักชีสดสับ สำหรับโรยหน้า"
    ],
    "steps": [
      "เตรียมเครื่องเทศและไก่: หั่นไก่เป็นชิ้นพอดีคำ ซับให้แห้งเล็กน้อย เตรียมกระเทียมสับ ขิงขูด และหอมใหญ่สับให้พร้อม ผสมโยเกิร์ต 1/2 ถ้วยกับผงกะหรี่เล็กน้อย (ประมาณ 1 ช้อนชา) และเกลือหยิบมือ คลุกเคล้าไก่กับส่วนผสมโยเกิร์ตหมักทิ้งไว้ 10–15 นาทีเพื่อให้นุ่มและซึมรส",
      "ผัดหอมใหญ่: ตั้งหม้อหรือกระทะก้นลึกบนไฟกลาง ใส่น้ำมันมะกอก 2–3 ช้อนโต๊ะ พอน้ำมันร้อน ใส่หอมใหญ่สับลงไปผัดประมาณ 5–7 นาทีจนหอมใหญ่เริ่มนิ่มและเป็นสีน้ำตาลอ่อน จะช่วยเพิ่มความหวานธรรมชาติให้แกง",
      "ใส่กระเทียม ขิง และเครื่องเทศแห้ง: ใส่กระเทียมสับและขิงขูดลงในหม้อ ผัดต่ออีก 1–2 นาทีจนหอม จากนั้นใส่ผงกะหรี่ที่เหลือ ผงปาปริก้า และผงอบเชย (หรือตัวแท่ง) ผัดให้เครื่องเทศคลุกเคล้ากับหอมใหญ่และน้ำมันจนหอมฟุ้ง ระวังไม่ให้ไหม้ ถ้าแห้งเกินสามารถเติมน้ำเล็กน้อย",
      "ใส่ไก่และมะเขือเทศเข้มข้น: นำไก่ที่หมักโยเกิร์ตลงผัดในหม้อ ใช้ไฟกลาง ผัดประมาณ 4–5 นาทีจนเนื้อไก่ด้านนอกเปลี่ยนสีและเริ่มตึง ใส่มะเขือเทศเข้มข้น 2–3 ช้อนโต๊ะลงไป คนให้เข้ากันกับเนื้อไก่และเครื่องเทศ",
      "เติมกะทิและเคี่ยว: เทกะทิ 1 กระป๋องลงในหม้อ คนให้ส่วนผสมทุกอย่างเข้ากัน หากน้ำแกงดูข้นมากสามารถเติมน้ำเปล่าหรือน้ำสต๊อกไก่ 1/2–1 ถ้วยลงไปให้ได้ความข้นที่ต้องการ เร่งไฟให้เดือด จากนั้นหรี่ไฟลงเป็นไฟอ่อน–กลาง เคี่ยวให้เดือดปุด ๆ ประมาณ 20–25 นาที จนไก่นุ่มและน้ำแกงข้นขึ้นเล็กน้อย",
      "ปรุงรส: ชิมรสแกง ปรุงด้วยเกลือและพริกไทยตามชอบ บีบน้ำมะนาว 1–2 ช้อนโต๊ะลงไปเพื่อเพิ่มความสดและตัดเลี่ยน หากต้องการเผ็ดมากขึ้นสามารถใส่พริกสดหั่นหรือพริกป่นเพิ่มในช่วงนี้",
      "เสิร์ฟ: เมื่อไก่นุ่มและรสชาติกลมกล่อมแล้ว ปิดไฟ ตักแกงใส่ชาม โรยหน้าด้วยผักชีสดสับ เสิร์ฟคู่กับข้าวสวยร้อน ๆ แป้งนาน หรือโรตี"
    ]
  }
]
