[
    {
        "id":  "bbq_ribs",
        "title":  "ซี่โครงหมูบาร์บีคิว",
        "prep_time":  "20 นาที",
        "cook_time":  "3 ชั่วโมง",
        "total_time":  "3 ชั่วโมง 20 นาที",
        "image":  "assets/images/cuisines/american/bbq_ribs.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "ซี่โครงหมูเบบี้แบ็ค 2 แผง (ประมาณ 2 กก.)",
                            "สำหรับเครื่องเทศแห้ง: น้ำตาลทรายแดง 3 ช้อนโต๊ะ",
                            "ผงพริกหวาน 2 ช้อนโต๊ะ",
                            "พริกไทยดำ 1 ช้อนโต๊ะ",
                            "เกลือ 1 ช้อนโต๊ะ",
                            "ผงพริก 1 ช้อนโต๊ะ",
                            "ผงกระเทียม 1 ช้อนโต๊ะ",
                            "ผงหัวหอม 1 ช้อนโต๊ะ",
                            "พริกป่น 1 ช้อนชา",
                            "สำหรับซอสบาร์บีคิว: ซอสมะเขือเทศ 2 ถ้วย",
                            "น้ำส้มสายชูแอปเปิ้ล 1/2 ถ้วย",
                            "น้ำตาลทรายแดง 1/2 ถ้วย",
                            "ซอสวูสเตอร์เชียร์ 2 ช้อนโต๊ะ",
                            "มัสตาร์ด 1 ช้อนโต๊ะ",
                            "ควันเหลว 1 ช้อนชา"
                        ],
        "steps":  [
                      "เอาเยื่อบางออกจากด้านหลังซี่โครง: เลื่อนมีดใต้เยื่อที่ปลายด้านหนึ่ง แล้วจับด้วยกระดาษซับมันและดึงออกเป็นชิ้นเดียว ช่วยให้เครื่องเทศซึมและทำให้ซี่โครงนุ่มขึ้น",
                      "ผสมเครื่องเทศแห้งทั้งหมดในชาม เคลือบซี่โครงทั้งสองด้านอย่างเยอะๆ กดให้เข้ากับเนื้อ ปล่อยไว้ที่อุณหภูมิห้อง 30 นาที หรือแช่ตู้เย็นได้ถึงข้ามคืน",
                      "อุ่นเตาอบที่ 150°C (300°F) ห่อซี่โครงแต่ละแผงด้วยฟอยล์อลูมิเนียมแน่น สร้างห่อปิดผนึก วางบนถาดอบ",
                      "อบ 2.5 ชั่วโมง ซี่โครงควรนุ่มมากและเนื้อควรหลุดจากกระดูกได้ง่าย",
                      "ขณะที่ซี่โครงอบ ทำซอสบาร์บีคิว: ผสมซอสมะเขือเทศ น้ำส้มสายชูแอปเปิ้ล น้ำตาลทรายแดง ซอสวูสเตอร์เชียร์ มัสตาร์ด และควันเหลวในหม้อ เคี่ยวไฟกลาง 15 นาที คนเป็นครั้งคราว จนข้น พักไว้",
                      "อุ่นเตาย่างไฟกลางค่อนข้างแรง หรือเปิดเตาอบไฟบน ระมัดระวังแกะซี่โครง (ระวังไอร้อน) ทาซอสบาร์บีคิวทั้งสองด้านให้เยอะๆ",
                      "ย่างหรืออบไฟบน 5-7 นาทีต่อด้าน ทาซอสเพิ่มทุก 2 นาที จนซอสคาราเมลไลซ์และเป็นเคลือบเหนียว ดูอย่างระมัดระวังเพื่อไม่ให้ไหม้",
                      "พัก 5 นาที แล้วหั่นระหว่างกระดูกเป็นซี่แยก เสิร์ฟพร้อมซอสบาร์บีคิวเพิ่ม โคลสลอว์ และขนมปังข้าวโพด ซี่โครงควรนุ่มหลุดจากกระดูกพร้อมเคลือบหวาน รมควัน เหนียว"
                  ]
    },
    {
        "id":  "mac_and_cheese",
        "title":  "แมคแอนด์ชีส (มักกะโรนีชีส)",
        "prep_time":  "15 นาที",
        "cook_time":  "30 นาที",
        "total_time":  "45 นาที",
        "image":  "assets/images/cuisines/american/mac_and_cheese.jpg",
        "categories":  [
                           "snack_and_appetizers",
                           "maincourse"
                       ],
        "ingredients":  [
                            "มักกะโรนีข้อศอก 400 กรัม",
                            "เนย 4 ช้อนโต๊ะ",
                            "แป้งอเนกประสงค์ 4 ช้อนโต๊ะ",
                            "นมสดไขมันเต็ม 3 ถ้วย",
                            "วิปปิ้งครีม 1 ถ้วย",
                            "ชีสเชดดาร์คมขูด 3 ถ้วย",
                            "ชีสกรูแยร์ขูด 1 ถ้วย",
                            "ผงมัสตาร์ด 1/2 ช้อนชา",
                            "ผงกระเทียม 1/2 ช้อนชา",
                            "เกลือและพริกไทยตามชอบ",
                            "ขนมปังป่น 1 ถ้วย",
                            "เนยละลาย 2 ช้อนโต๊ะ",
                            "ผักชีฝรั่งสดสำหรับโรยหน้า"
                        ],
        "steps":  [
                      "อุ่นเตาอบที่ 180°C (350°F) ทาน้ำมันในจานอบ 9x13 นิ้ว",
                      "ต้มมักกะโรนีในน้ำเดือดเค็มจนอัลเดนเต้ (ประมาณ 1 นาทีน้อยกว่าคำแนะนำบนซอง) พักน้ำและพักไว้",
                      "ในหม้อใหญ่ ละลายเนย 4 ช้อนโต๊ะไฟกลาง ใส่แป้งและตีตลอดเวลา 2 นาที เพื่อทำรู ควรเนียนและเป็นสีทองเล็กน้อย",
                      "ค่อยๆ เทนมและครีมลงไปพร้อมตีตลอดเวลาเพื่อไม่ให้เป็นก้อน ตีต่อ 5-7 นาที จนซอสข้นและเคลือบหลังช้อน",
                      "ลดไฟเป็นอ่อน ใส่ผงมัสตาร์ด ผงกระเทียม เกลือ และพริกไทย คนชีสเชดดาร์และกรูแยร์ขูดลงไปทีละกำมือ คนจนละลายหมดและเนียนก่อนเติมเพิ่ม",
                      "ใส่มักกะโรนีที่ต้มแล้วลงในซอสชีสและคนจนทุกชิ้นเคลือบ ชิมรสและปรุงเพิ่มเติม",
                      "เทแมคแอนด์ชีสลงในจานอบที่เตรียมไว้ กระจายให้เท่ากัน",
                      "ผสมขนมปังป่นกับเนยละลาย 2 ช้อนโต๊ะ โรยทั่วหน้า",
                      "อบ 25-30 นาที จนหน้าเป็นสีทองและกรอบ และซอสฟูรอบขอบ",
                      "พัก 5 นาทีก่อนเสิร์ฟ โรยผักชีฝรั่งสด แมคแอนด์ชีสควรครีมมี่มากด้านในพร้อมท็อปปิ้งสีทองกรอบ"
                  ]
    },
    {
        "id":  "fried_chicken",
        "title":  "ไก่ทอดสไตล์เซาเทิร์น",
        "prep_time":  "30 นาที (บวกหมัก 4 ชั่วโมง)",
        "cook_time":  "25 นาที",
        "total_time":  "55 นาที",
        "image":  "assets/images/cuisines/american/fried_chicken.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "ชิ้นไก่ (น่อง สะโพก อก) 1.5 กก.",
                            "นมเปรี้ยว 2 ถ้วย",
                            "เกลือ 2 ช้อนชา",
                            "พริกไทยดำ 1 ช้อนชา",
                            "ผงพริกหวาน 1 ช้อนชา",
                            "พริกป่น 1/2 ช้อนชา",
                            "สำหรับเคลือบ: แป้งอเนกประสงค์ 2 ถ้วย",
                            "ผงพริกหวาน 1 ช้อนโต๊ะ",
                            "ผงกระเทียม 1 ช้อนโต๊ะ",
                            "ผงหัวหอม 1 ช้อนโต๊ะ",
                            "เกลือ 2 ช้อนชา",
                            "พริกไทยดำ 1 ช้อนชา",
                            "พริกป่น 1 ช้อนชา",
                            "น้ำมันสำหรับทอด"
                        ],
        "steps":  [
                      "ในชามใหญ่ ผสมนมเปรี้ยว เกลือ พริกไทยดำ ผงพริกหวาน และพริกป่น ใส่ชิ้นไก่และพลิกเพื่อเคลือบ ปิดและแช่ตู้เย็นอย่างน้อย 4 ชั่วโมง ดีที่สุดคือข้ามคืน นมเปรี้ยวทำให้นุ่มและเพิ่มรสชาติ",
                      "ในจานตื้น ผสมแป้ง ผงพริกหวาน ผงกระเทียม ผงหัวหอม เกลือ พริกไทยดำ และพริกป่นสำหรับเคลือบ",
                      "ตักไก่ออกจากนมเปรี้ยว ปล่อยให้ส่วนเกินหยด คลุกแต่ละชิ้นในแป้งปรุงรส กดแน่นเพื่อให้เคลือบติด สะบัดส่วนเกินออก สำหรับเคลือบกรอบพิเศษ จุ่มกลับในนมเปรี้ยวและแป้งอีกครั้ง (คลุกสองครั้ง)",
                      "ปล่อยให้ไก่เคลือบแป้งพักบนตะแกรง 15 นาที ช่วยให้เคลือบติดขณะทอด",
                      "ตั้งน้ำมัน 2-3 นิ้วในกระทะลึกขนาดใหญ่หรือดัตช์โอเวนให้ร้อน 175°C (350°F) ใช้เทอร์โมมิเตอร์วัดให้แม่นยำ",
                      "ระมัดระวังใส่ชิ้นไก่ลงในน้ำมันร้อน ด้านหนังลง โดยไม่ให้แน่นเกินไป (ทอดเป็นชุดๆ) อุณหภูมิน้ำมันจะลดลง - ปรับไฟเพื่อรักษา 160-165°C (325-330°F)",
                      "ทอด 12-15 นาทีต่อด้าน พลิกครั้งเดียว จนเป็นสีทองเข้มและอุณหภูมิภายในถึง 75°C (165°F) ชิ้นใหญ่เช่นอกอาจต้องการเวลาเพิ่มอีกไม่กี่นาที",
                      "ตักไก่ออกและพักบนตะแกรงวางเหนือกระดาษซับมัน พัก 5 นาทีก่อนเสิร์ฟ",
                      "เสิร์ฟร้อนๆ พร้อมมันฝรั่งบด เกรวี่ และบิสกิต ไก่ควรมีเปลือกกรอบปรุงรสดีอย่างเหลือเชื่อและเนื้อชุ่มฉ่ำนุ่มด้านใน"
                  ]
    },
    {
        "id":  "apple_pie",
        "title":  "พายแอปเปิ้ลคลาสสิก",
        "prep_time":  "30 นาที",
        "cook_time":  "50 นาที",
        "total_time":  "80 นาที (บวกแช่เย็น)",
        "image":  "assets/images/cuisines/american/apple_pie.jpg",
        "categories":  [
                           "dessert"
                       ],
        "ingredients":  [
                            "สำหรับเปลือก: แป้งอเนกประสงค์ 2.5 ถ้วย",
                            "เกลือ 1 ช้อนชา",
                            "น้ำตาล 1 ช้อนโต๊ะ",
                            "เนยเย็นหั่นเต็าซี 1 ถ้วย",
                            "น้ำแข็ง 6-8 ช้อนโต๊ะ",
                            "สำหรับไส้: แอปเปิ้ลแกรนนี่สมิธปอกเปลือกและหั่น 6-7 ลูก",
                            "น้ำตาล 3/4 ถ้วย",
                            "แป้งอเนกประสงค์ 2 ช้อนโต๊ะ",
                            "อบเชย 1 ช้อนชา",
                            "จันทน์เทศ 1/4 ช้อนชา",
                            "น้ำมะนาว 2 ช้อนโต๊ะ",
                            "เนย 2 ช้อนโต๊ะ",
                            "ไข่ตี 1 ฟอง (สำหรับทาหน้า)"
                        ],
        "steps":  [
                      "ทำเปลือก: ในชามใหญ่ ผสมแป้ง เกลือ และน้ำตาล ใส่เนยเย็นหั่นเต็าซีและใช้ที่ตัดแป้งหรือนิ้วทำจนส่วนผสมเป็นเม็ดหยาบพร้อมชิ้นเนยขนาดถั่ว",
                      "โรยน้ำแข็งทีละ 1 ช้อนโต๊ะ ผสมเบาๆ จนแป้งเพิ่งเข้ากัน แบ่งเป็น 2 แผ่น ห่อด้วยพลาสติก และแช่ตู้เย็นอย่างน้อย 1 ชั่วโมง",
                      "ทำไส้: ในชามใหญ่ คลุกแอปเปิ้ลหั่นกับน้ำตาล แป้ง อบเชย จันทน์เทศ และน้ำมะนาว ปล่อยทิ้งไว้ 15 นาที",
                      "อุ่นเตาอบที่ 220°C (425°F) กลิ้งแป้งแผ่นหนึ่งบนพื้นผิวโรยแป้งเป็นวงกลม 12 นิ้ว ย้ายไปยังจานพาย 9 นิ้ว ปล่อยให้ส่วนเกินห้อยเหนือขอบ",
                      "เทไส้แอปเปิ้ลลงในเปลือก กองเล็กน้อยตรงกลาง โรยชิ้นเนย",
                      "กลิ้งแป้งแผ่นที่สอง วางทับไส้ ตัดแป้งส่วนเกินให้เหลือ 1 นิ้วเกินขอบ พับเปลือกบนใต้ขอบเปลือกล่างและหยิกตกแต่ง ตัดรอยแยกหลายแห่งบนหน้าเพื่อให้ไอออก",
                      "ทาเปลือกบนด้วยไข่ตีเพื่อให้เป็นสีทอง โรยน้ำตาลเล็กน้อยถ้าต้องการ",
                      "วางพายบนถาดอบ (เพื่อรองหยด) อบที่ 220°C 20 นาที แล้วลดอุณหภูมิเป็น 180°C (350°F) และอบต่ออีก 30-40 นาที จนเปลือกเป็นสีทองและไส้ฟูผ่านรอยแยก",
                      "ปล่อยให้เย็นอย่างน้อย 2 ชั่วโมงก่อนหั่น - ช่วยให้ไส้ตัว เสิร์ฟอุ่นหรือที่อุณหภูมิห้องพร้อมไอศกรีมวานิลลาหรือวิปครีม พายควรมีเปลือกกรอบเนยและแอปเปิ้ลนุ่มปรุงรสเครื่องเทศ"
                  ]
    },
    {
        "id":  "milkshake",
        "title":  "มิลค์เชควานิลลาคลาสสิก",
        "prep_time":  "5 นาที",
        "cook_time":  "0 นาที",
        "total_time":  "5 นาที",
        "image":  "assets/images/cuisines/american/milkshake.jpg",
        "categories":  [
                           "drink",
                           "dessert"
                       ],
        "ingredients":  [
                            "ไอศกรีมวานิลลา 3 ถ้วย",
                            "นมสดไขมันเต็ม 1 ถ้วย",
                            "สารสกัดวานิลลา 1 ช้อนชา",
                            "น้ำตาล 2 ช้อนโต๊ะ (ถ้าต้องการ)",
                            "วิปครีมสำหรับโรยหน้า",
                            "เชอร์รี่มาราสชิโน",
                            "ซอสช็อกโกแลต (ถ้าต้องการ)"
                        ],
        "steps":  [
                      "แช่แก้วสูงในช่องแช่แข็ง 10 นาทีเพื่อประสบการณ์ที่ดีที่สุด",
                      "ใส่ไอศกรีมวานิลลา นม และสารสกัดวานิลลาลงในเครื่องปั่น ถ้าชอบหวานกว่า เติมน้ำตาล",
                      "ปั่นความเร็วกลาง 30-45 วินาที จนเนียนและครีมมี่ ความข้นควรข้นแต่เทได้ ถ้าข้นเกินไป เติมนมอีกเล็กน้อย ถ้าบางเกินไป เติมไอศกรีมเพิ่ม",
                      "เทลงในแก้วที่เย็นแล้ว มิลค์เชคควรข้นพอที่ต้องใช้หลอดแต่เนียนพอที่จะดื่ม",
                      "โรยวิปครีมเป็นก้อนใหญ่บนหน้า ใส่เชอร์รี่มาราสชิโนบนสุด",
                      "สำหรับราดช็อกโกแลต บีบซอสช็อกโกแลตรอบด้านในแก้วก่อนเท หรือราดบนวิปครีม",
                      "เสิร์ฟทันทีพร้อมหลอดและช้อนยาว มิลค์เชคอเมริกันคลาสสิกควรข้น ครีมมี่ และหรูหรา - เหมาะกับเบอร์เกอร์และเฟรนช์ฟราย!"
                  ]
    }
]
