[
  {
    "id": "kung_pao_chicken",
    "title": "ไก่ผัดเม็ดมะม่วงหิมพานต์",
    "prep_time": "20 นาที",
    "cook_time": "10 นาที",
    "total_time": "30 นาที",
    "image": "assets/images/cuisines/chinese/kung_pao_chicken.jpg",
    "categories": [
      "อาหารจานหลัก"
    ],
    "ingredients": [
      "เนื้อไก่หั่นเต็าซี 500 กรัม",
      "ถั่วลิสงหิมพานต์คั่ว 1/2 ถ้วย",
      "พริกแห้งหั่น 3 เม็ด",
      "พริกหยวกหั่นเต็าซี 1 เม็ด",
      "กระเทียมสับ 3 กลีบ",
      "ขิงสับ 1 ช้อนโต๊ะ",
      "ต้นหอมหั่น 1 นิ้ว 2 ต้น",
      "ซีอิ๊ว 2 ช้อนโต๊ะ",
      "ซีอิ๊วดำ 1 ช้อนโต๊ะ",
      "เหล้าข้าวจีน 2 ช้อนโต๊ะ",
      "น้ำตาล 1 ช้อนโต๊ะ",
      "แป้งข้าวโพด 1 ช้อนโต๊ะ",
      "น้ำมันงา 2 ช้อนชา",
      "น้ำมันพืช 3 ช้อนโต๊ะ",
      "พริกไทยเสฉวน 1 ช้อนชา"
    ],
    "steps": [
      "ในชาม ผสมเนื้อไก่หั่นเต็าซีกับซีอิ๊ว 1 ช้อนโต๊ะ เหล้าข้าวจีน 2 ช้อนโต๊ะ และแป้งข้าวโพด 1 ช้อนโต๊ะ คลุกให้ทั่ว หมักไว้ 15 นาทีที่อุณหภูมิห้องเพื่อให้เนื้อนุ่ม",
      "เตรียมซอสโดยผสมซีอิ๊ว 2 ช้อนโต๊ะ ซีอิ๊วดำ 1 ช้อนโต๊ะ น้ำตาล 1 ช้อนโต๊ะ และน้ำมันงา 2 ช้อนชาในชามเล็ก คนจนน้ำตาลละลาย พักไว้",
      "ตั้งน้ำมันพืช 3 ช้อนโต๊ะในกระทะไฟแรงจนเกือบลุกควัน ใส่พริกไทยเสฉวน 1 ช้อนชา ผัด 20-30 วินาที จนหอมมากและสีเข้มขึ้นเล็กน้อย ระวังอย่าให้ไหม้",
      "ใส่พริกแห้งหั่น กระเทียมสับ และขิงสับลงไป ผัดอย่างรวดเร็วประมาณ 15-20 วินาที จนหอม กระเทียมควรหอมแต่ยังไม่เปลี่ยนสี",
      "ใส่ไก่ที่หมักไว้ลงในกระทะ ผัดอย่างแรง 4-5 นาที พลิกตลอดเวลา จนไก่สุกทั่วและเริ่มเป็นสีทอง ไก่ควรไม่เป็นสีชมพูข้างในอีกต่อไป",
      "ใส่พริกหยวกหั่นเต็าซีและต้นหอมหั่น 1 นิ้ว ผัดต่ออีก 2 นาที จนผักนุ่มเล็กน้อยแต่ยังกรอบและมีสีสด",
      "เทซอสที่เตรียมไว้ลงไปในกระทะ คลุกเคล้าและผัดต่ออีก 1 นาที เพื่อให้ส่วนผสมทุกอย่างเคลือบซอสอย่างทั่วถึง",
      "ใส่ถั่วลิสงหิมพานต์คั่วลงไป คลุกเคล้าอีกครั้งสุดท้าย 30 วินาที ตักใส่จานทันทีและเสิร์ฟร้อนๆ พร้อมข้าวสวย จานนี้ควรหอม เผ็ดเล็กน้อย และมีซอสเคลือบเงางาม"
    ]
  },
  {
    "id": "mapo_tofu",
    "title": "เต้าหู้ผัดซอสเผ็ด (มาโปเต้าหู้)",
    "prep_time": "10 นาที",
    "cook_time": "15 นาที",
    "total_time": "25 นาที",
    "image": "assets/images/cuisines/chinese/mapo_tofu.jpg",
    "categories": [
      "อาหารจานหลัก"
    ],
    "ingredients": [
      "เต้าหู้นุ่มหั่นเต็าซี 400 กรัม",
      "หมูบด 200 กรัม",
      "เต้าบั่นเจี้ยง (ซอสถั่วเหลืองหมัก) 2 ช้อนโต๊ะ",
      "กระเทียมสับ 2 กลีบ",
      "ขิงสับ 1 ช้อนโต๊ะ",
      "ต้นหอมซอย 2 ต้น",
      "น้ำซุปไก่ 1 ถ้วย",
      "ซีอิ๊ว 2 ช้อนโต๊ะ",
      "น้ำตาล 1 ช้อนชา",
      "แป้งข้าวโพดผสมน้ำ 2 ช้อนโต๊ะ 1 ช้อนโต๊ะ",
      "น้ำมันพืช 2 ช้อนโต๊ะ",
      "ผงพริกไทยเสฉวน 1 ช้อนชา",
      "น้ำมันพริก 1 ช้อนชา"
    ],
    "steps": [
      "ตั้งน้ำมันพืช 2 ช้อนโต๊ะในกระทะไฟแรง ใส่หมูบดลงไป ผัด 3-4 นาที ใช้ทัพพีทุบแยกเนื้อหมู จนหมูสุกเป็นสีน้ำตาลและกรอบเล็กน้อยที่ขอบ",
      "ใส่กระเทียมสับ ขิงสับ และเต้าบั่นเจี้ยง (ซอสถั่วเหลืองหมัก) 2 ช้อนโต๊ะลงไปกับหมู ผัด 1-2 นาที จนส่วนผสมหอมมากและน้ำมันเปลี่ยนเป็นสีแดงจากซอสถั่วเหลือง",
      "เทน้ำซุปไก่ 1 ถ้วยลงไป ตั้งไฟให้เดือดปุดๆ น้ำควรเดือดอย่างแรง",
      "ค่อยๆ เลื่อนเต้าหู้หั่นเต็าซีลงในน้ำซุปที่เดือด ลดไฟเป็นกลาง เคี่ยว 5-6 นาที หลีกเลี่ยงการคนมากเกินไปเพื่อไม่ให้เต้าหู้แตก",
      "ปรุงรสด้วยซีอิ๊ว 2 ช้อนโต๊ะ และน้ำตาล 1 ช้อนชา คนเบาๆ เพื่อกระจายเครื่องปรุง ชิมรสและปรุงเพิ่มเติมตามต้องการ",
      "ผสมแป้งข้าวโพด 1 ช้อนโต๊ะกับน้ำ 2 ช้อนโต๊ะเพื่อทำน้ำแป้ง ค่อยๆ ราดลงในซอสที่เคี่ยวอยู่พร้อมคนเบาๆ ต้มต่ออีก 1 นาที จนซอสข้นเป็นเงาและเคลือบช้อนได้",
      "โรยผงพริกไทยเสฉวน 1 ช้อนชาลงบนหน้าเพื่อให้รสชาติชาเฉพาะตัว ราดน้ำมันพริก 1 ช้อนชาเพื่อเพิ่มความเผ็ดและกลิ่นหอม",
      "โรยต้นหอมซอยให้เยอะๆ เสิร์ฟทันทีในชามพร้อมข้าวสวย จานนี้ควรเผ็ด ชา และมีซอสเนียนนุ่มเคลือบเต้าหู้อ่อนนุ่ม"
    ]
  },
  {
    "id": "sweet_sour_pork",
    "title": "หมูผัดเปรี้ยวหวาน",
    "prep_time": "25 นาที",
    "cook_time": "15 นาที",
    "total_time": "40 นาที",
    "image": "assets/images/cuisines/chinese/sweet_sour_pork.jpg",
    "categories": [
      "อาหารจานหลัก"
    ],
    "ingredients": [
      "เนื้อสันในหมูหั่นชิ้น 500 กรัม",
      "ไข่ 1 ฟอง",
      "แป้งข้าวโพด 1/2 ถ้วย",
      "พริกหยวกหั่นชิ้น 1 เม็ด",
      "หัวหอมใหญ่หั่นชิ้น 1 หัว",
      "สับปะรดหั่นชิ้น 1 ถ้วย",
      "ซอสมะเขือเทศ 3 ช้อนโต๊ะ",
      "น้ำส้มสายชู 3 ช้อนโต๊ะ",
      "น้ำตาล 3 ช้อนโต๊ะ",
      "ซีอิ๊ว 1 ช้อนโต๊ะ",
      "น้ำ 1/2 ถ้วย",
      "แป้งข้าวโพดสำหรับซอส 2 ช้อนชา",
      "น้ำมันสำหรับทอด",
      "น้ำมันพืชสำหรับผัด 1 ช้อนโต๊ะ"
    ],
    "steps": [
      "ในชาม ตีไข่ 1 ฟองแล้วใส่เนื้อหมูหั่นชิ้นลงไป คลุกให้ทั่ว จากนั้นคลุกหมูในแป้งข้าวโพด 1/2 ถ้วยให้ทุกชิ้นเคลือบทั่ว สะบัดแป้งส่วนเกินออก",
      "ตั้งน้ำมันสำหรับทอดในกระทะหรือหม้อลึกให้ร้อน 180°C (350°F) ทดสอบโดยหยดแป้งลงไปเล็กน้อย - ควรฟูและลอยขึ้นทันที ค่อยๆ ใส่หมูลงทอดเป็นชุดๆ ทอด 4-5 นาที จนเป็นสีทองและกรอบ ตักขึ้นพักบนกระดาษซับมัน พักไว้",
      "ในชามเล็ก เตรียมซอสเปรี้ยวหวาน: ผสมซอสมะเขือเทศ 3 ช้อนโต๊ะ น้ำส้มสายชู 3 ช้อนโต๊ะ น้ำตาล 3 ช้อนโต๊ะ ซีอิ๊ว 1 ช้อนโต๊ะ น้ำ 1/2 ถ้วย และแป้งข้าวโพด 2 ช้อนชา ตีให้เข้ากันจนแป้งละลายหมด",
      "ตั้งน้ำมันพืช 1 ช้อนโต๊ะในกระทะสะอาดไฟแรง ใส่พริกหยวกหั่นชิ้นและหัวหอมใหญ่หั่นชิ้น ผัด 2-3 นาที จนนุ่มเล็กน้อยแต่ยังกรอบและมีสีสด",
      "ใส่สับปะรดหั่นชิ้นลงในกระทะกับผัก ผัดต่ออีก 1 นาที เพื่อให้ร้อนและคาราเมลไลซ์เล็กน้อย",
      "คนซอสอีกครั้ง (แป้งอาจจะตกตะกอน) แล้วเทลงในกระทะ คนตลอดเวลาและต้ม 2-3 นาที จนซอสข้น เป็นเงา และเคลือบหลังช้อนได้",
      "ใส่หมูทอดลงในกระทะ คลุกเคล้าอย่างรวดเร็วประมาณ 30 วินาที เพื่อให้หมูเคลือบซอสทั่ว ทำเร็วเพื่อให้หมูยังกรอบ",
      "ตักใส่จานทันทีและเสิร์ฟร้อนๆ พร้อมข้าวสวย หมูควรกรอบด้านนอก นุ่มด้านใน และเคลือบด้วยซอสเปรี้ยวหวานสีสดใสเป็นเงา"
    ]
  },
  {
    "id": "fried_rice",
    "title": "ข้าวผัดจีน",
    "prep_time": "10 นาที",
    "cook_time": "10 นาที",
    "total_time": "20 นาที",
    "image": "assets/images/cuisines/chinese/fried_rice.jpg",
    "categories": [
      "อาหารจานหลัก"
    ],
    "ingredients": [
      "ข้าวสวยเย็น (ข้ามคืน) 3 ถ้วย",
      "ไข่ตี 2 ฟอง",
      "หมูแดงหั่นเต็าซี 100 กรัม",
      "ถั่วลันเตาและแครอทแช่แข็ง 1/2 ถ้วย",
      "ต้นหอมซอย 3 ต้น",
      "กระเทียมสับ 2 กลีบ",
      "ซีอิ๊ว 2 ช้อนโต๊ะ",
      "ซอสหอยนางรม 1 ช้อนโต๊ะ",
      "น้ำมันงา 1 ช้อนชา",
      "น้ำมันพืช 3 ช้อนโต๊ะ",
      "พริกไทยขาวตามชอบ"
    ],
    "steps": [
      "ตั้งน้ำมัน 1 ช้อนโต๊ะในกระทะไฟแรง เทไข่ตีลงไป ตีไข่อย่างรวดเร็วประมาณ 30-45 วินาที จนเพิ่งตัวแต่ยังนุ่มเล็กน้อย ตักออกพักไว้บนจาน",
      "เติมน้ำมันอีก 2 ช้อนโต๊ะลงในกระทะเดิมไฟแรง ใส่กระเทียมสับลงไป ผัด 10-15 วินาที จนหอมและเริ่มเป็นสีทอง",
      "ใส่หมูแดงหั่นเต็าซีและถั่วลันเตาแครอทแช่แข็งลงในกระทะ ผัด 2-3 นาที จนผักร้อนทั่วและหมูแดงคาราเมลไลซ์เล็กน้อยที่ขอบ",
      "ใส่ข้าวสวยเย็นข้ามคืนลงในกระทะ ใช้ทัพพีทุบก้อนข้าวให้แตก ผัดอย่างแรง 3-4 นาที พลิกตลอดเวลา จนข้าวร้อนทั่วและเม็ดข้าวแยกจากกัน ข้าวควรเริ่มดูแห้งเล็กน้อย",
      "ราดซีอิ๊ว 2 ช้อนโต๊ะและซอสหอยนางรม 1 ช้อนโต๊ะลงบนข้าว ผัดต่ออีก 1-2 นาที คลุกให้ทั่วเพื่อให้ข้าวมีสีสม่ำเสมอและปรุงรสทั่วถึง",
      "ใส่ไข่ตีที่ผัดไว้กลับเข้ากระทะ ใช้ทัพพีแบ่งไข่เป็นชิ้นเล็กๆ คลุกกับข้าวประมาณ 30 วินาที",
      "ใส่ต้นหอมซอยและราดน้ำมันงา 1 ช้อนชา คลุกเคล้าอีกครั้งสุดท้าย 15-20 วินาที",
      "ปรุงรสด้วยพริกไทยขาวตามชอบ ตักใส่จานและเสิร์ฟทันทีขณะร้อน ข้าวผัดควรหอม เม็ดข้าวแยกกัน และมีสีน้ำตาลทอง"
    ]
  },
  {
    "id": "peking_duck",
    "title": "เป็ดปักกิ่ง (แบบง่าย)",
    "prep_time": "30 นาที",
    "cook_time": "90 นาที",
    "total_time": "120 นาที",
    "image": "assets/images/cuisines/chinese/peking_duck.jpg",
    "categories": [
      "อาหารจานหลัก"
    ],
    "ingredients": [
      "เป็ดทั้งตัว (ประมาณ 2 กก.) 1 ตัว",
      "น้ำเชื่อมหรือน้ำผึ้ง 2 ช้อนโต๊ะ",
      "เหล้าข้าวจีน 2 ช้อนโต๊ะ",
      "ซีอิ๊ว 1 ช้อนโต๊ะ",
      "ผงเครื่องเทศจีน 5 อย่าง 1 ช้อนชา",
      "ขิงหั่น 3 แผ่น",
      "ต้นหอม 2 ต้น",
      "แพนเค้กจีน 12 แผ่น",
      "ซอสหอยซิน 1/2 ถ้วย",
      "แตงกวาหั่นฝอย 1 ลูก",
      "ต้นหอมหั่นฝอย 4 ต้น"
    ],
    "steps": [
      "ทำความสะอาดเป็ดทั้งภายในและภายนอกด้วยน้ำเย็น เช็ดให้แห้งสนิทด้วยกระดาษซับมัน - ขั้นตอนนี้สำคัญมากสำหรับหนังกรอบ ปล่อยให้แห้งอากาศอีก 10 นาที",
      "ในชามเล็ก ผสมน้ำเชื่อม (หรือน้ำผึ้ง) 2 ช้อนโต๊ะ เหล้าข้าวจีน 2 ช้อนโต๊ะ ซีอิ๊ว 1 ช้อนโต๊ะ และผงเครื่องเทศจีน 5 อย่าง 1 ช้อนชา คนให้เข้ากันดี",
      "ใช้แปรงทาขนมทาส่วนผสมน้ำเชื่อมทั่วผิวหนังเป็ด ทาให้ทั่วทุกส่วน นี่จะทำให้เป็ดมีสีน้ำตาลมะฮอกกานีเงางามเป็นเอกลักษณ์",
      "ยัดช่องท้องเป็ดด้วยขิงหั่น 3 แผ่นและต้นหอม 2 ต้นทั้งต้น นี่จะทำให้เนื้อเป็ดมีกลิ่นหอมจากภายใน",
      "วางเป็ดบนตะแกรงวางเหนือถาดรอง แล้วเก็บในตู้เย็นโดยไม่ปิดฝาอย่างน้อย 4 ชั่วโมง หรือดีที่สุดคือข้ามคืน ขั้นตอนการตากแห้งนี้จำเป็นมากสำหรับหนังกรอบ หนังควรแห้งและตึงเมื่อสัมผัส",
      "เปิดเตาอบที่ 180°C (350°F) นำเป็ดออกจากตู้เย็นและปล่อยไว้ที่อุณหภูมิห้อง 20 นาที",
      "วางเป็ดหงายขึ้นบนตะแกรงอบในถาดอบ อบ 60 นาที จากนั้นเพิ่มอุณหภูมิเตาเป็น 220°C (425°F) และอบต่ออีก 30 นาที จนหนังเป็นสีทองเข้ม กรอบ และแตกเป็นเกล็ด อุณหภูมิภายในควรถึง 75°C (165°F)",
      "นำออกจากเตาและพักเป็ด 10 นาทีก่อนหั่น เพื่อให้น้ำเนื้อกระจายตัว",
      "หั่นเป็ดเป็นชิ้นบางๆ เน้นที่ชิ้นที่มีทั้งหนังกรอบและเนื้ออ่อน เสิร์ฟพร้อมแพนเค้กจีนอุ่นๆ ซอสหอยซิน แตงกวาหั่นฝอย และต้นหอมหั่นฝอย วิธีทาน: ทาซอสหอยซินบนแพนเค้ก วางเป็ด แตงกวา และต้นหอม แล้วม้วนและเพลิดเพลิน"
    ]
  }
]
