[
    {
        "id":  "kung_pao_chicken",
        "title":  "Kung Pao Chicken",
        "prep_time":  "20 mins",
        "cook_time":  "10 mins",
        "total_time":  "30 mins",
        "image":  "assets/images/cuisines/chinese/kung_pao_chicken.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "500g Chicken breast, diced",
                            "1/2 cup Roasted peanuts",
                            "3 Dried red chilies, cut",
                            "1 Bell pepper, diced",
                            "3 cloves Garlic, minced",
                            "1 tbsp Ginger, minced",
                            "2 Spring onions, cut 1-inch",
                            "2 tbsp Soy sauce",
                            "1 tbsp Dark soy sauce",
                            "2 tbsp Chinese rice wine",
                            "1 tbsp Sugar",
                            "1 tbsp Cornstarch",
                            "2 tsp Sesame oil",
                            "3 tbsp Vegetable oil",
                            "1 tsp Sichuan peppercorns"
                        ],
        "steps":  [
                      "In a bowl, combine the diced chicken with 1 tablespoon soy sauce, 2 tablespoons Chinese rice wine, and 1 tablespoon cornstarch. Mix well to coat evenly. Let marinate for 15 minutes at room temperature to tenderize the meat.",
                      "Prepare the sauce by mixing together 2 tablespoons soy sauce, 1 tablespoon dark soy sauce, 1 tablespoon sugar, and 2 teaspoons sesame oil in a small bowl. Stir until the sugar dissolves. Set aside.",
                      "Heat 3 tablespoons of vegetable oil in a wok over high heat until it just begins to smoke. Add 1 teaspoon Sichuan peppercorns and stir-fry for 20-30 seconds until they become very fragrant and slightly darker. Be careful not to burn them.",
                      "Add the dried red chilies (cut into pieces), minced garlic, and minced ginger to the wok. Stir-fry quickly for about 15-20 seconds until aromatic. The garlic should be fragrant but not browned.",
                      "Add the marinated chicken to the wok. Stir-fry vigorously for 4-5 minutes, tossing constantly, until the chicken is cooked through and lightly golden. The chicken should no longer be pink inside.",
                      "Add the diced bell pepper and 1-inch cut spring onions. Continue stir-frying for 2 minutes until the vegetables are slightly softened but still crisp and vibrant in color.",
                      "Pour the prepared sauce over everything in the wok. Toss and stir-fry for another minute to coat all ingredients evenly with the glossy sauce.",
                      "Add the roasted peanuts and give everything a final toss for 30 seconds. Transfer immediately to a serving plate and serve hot with steamed rice. The dish should be aromatic, slightly spicy, and have a beautiful glossy coating."
                  ]
    },
    {
        "id":  "mapo_tofu",
        "title":  "Mapo Tofu",
        "prep_time":  "10 mins",
        "cook_time":  "15 mins",
        "total_time":  "25 mins",
        "image":  "assets/images/cuisines/chinese/mapo_tofu.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "400g Soft tofu, cubed",
                            "200g Ground pork",
                            "2 tbsp Doubanjiang (fermented bean paste)",
                            "2 cloves Garlic, minced",
                            "1 tbsp Ginger, minced",
                            "2 Spring onions, chopped",
                            "1 cup Chicken stock",
                            "2 tbsp Soy sauce",
                            "1 tsp Sugar",
                            "1 tbsp Cornstarch mixed with 2 tbsp water",
                            "2 tbsp Vegetable oil",
                            "1 tsp Sichuan peppercorn powder",
                            "1 tsp Chili oil"
                        ],
        "steps":  [
                      "Heat 2 tablespoons of vegetable oil in a wok over high heat. Add the ground pork and stir-fry for 3-4 minutes, breaking it up with your spatula, until it\u0027s browned and slightly crispy at the edges.",
                      "Add the minced garlic, minced ginger, and 2 tablespoons doubanjiang (fermented bean paste) to the pork. Stir-fry for 1-2 minutes until the mixture becomes very fragrant and the oil turns a reddish color from the bean paste.",
                      "Pour in 1 cup of chicken stock and bring to a rolling boil over high heat. The liquid should be bubbling vigorously.",
                      "Gently slide the cubed soft tofu into the boiling liquid. Reduce heat to medium and let simmer for 5-6 minutes. Avoid stirring too much to prevent breaking the delicate tofu cubes.",
                      "Season the dish with 2 tablespoons soy sauce and 1 teaspoon sugar. Gently stir to distribute the seasonings. Taste and adjust if needed.",
                      "Mix 1 tablespoon cornstarch with 2 tablespoons water to make a slurry. Slowly drizzle it into the simmering sauce while gently stirring. Cook for another minute until the sauce thickens to a glossy, coating consistency.",
                      "Sprinkle 1 teaspoon Sichuan peppercorn powder over the top for that signature numbing spice. Drizzle with 1 teaspoon chili oil for extra heat and aroma.",
                      "Garnish generously with chopped spring onions. Serve immediately in a bowl with steamed white rice. The dish should be spicy, numbing, and have a silky sauce coating the tender tofu."
                  ]
    },
    {
        "id":  "sweet_sour_pork",
        "title":  "Sweet and Sour Pork",
        "prep_time":  "25 mins",
        "cook_time":  "15 mins",
        "total_time":  "40 mins",
        "image":  "assets/images/cuisines/chinese/sweet_sour_pork.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "500g Pork tenderloin, cubed",
                            "1 Egg",
                            "1/2 cup Cornstarch",
                            "1 Bell pepper, cubed",
                            "1 Onion, cubed",
                            "1 cup Pineapple chunks",
                            "3 tbsp Ketchup",
                            "3 tbsp Rice vinegar",
                            "3 tbsp Sugar",
                            "1 tbsp Soy sauce",
                            "1/2 cup Water",
                            "2 tsp Cornstarch for sauce",
                            "Oil for deep frying",
                            "1 tbsp Vegetable oil for stir-frying"
                        ],
        "steps":  [
                      "In a bowl, beat 1 egg and add the cubed pork. Mix well. Then coat the pork pieces thoroughly with 1/2 cup cornstarch, ensuring each piece is evenly covered. Shake off any excess.",
                      "Heat oil for deep frying in a wok or deep pot to 180°C (350°F). Test by dropping a small piece of batter - it should sizzle and float immediately. Carefully add the pork pieces in batches, frying for 4-5 minutes until golden brown and crispy. Remove and drain on paper towels. Set aside.",
                      "In a small bowl, prepare the sweet and sour sauce: combine 3 tablespoons ketchup, 3 tablespoons rice vinegar, 3 tablespoons sugar, 1 tablespoon soy sauce, 1/2 cup water, and 2 teaspoons cornstarch. Whisk until smooth and the cornstarch is fully dissolved.",
                      "Heat 1 tablespoon of vegetable oil in a clean wok over high heat. Add the cubed bell pepper and cubed onion. Stir-fry for 2-3 minutes until they\u0027re slightly softened but still have a nice crunch and bright color.",
                      "Add the pineapple chunks to the wok with the vegetables. Stir-fry for another minute to heat through and caramelize slightly.",
                      "Give the sauce mixture a quick stir (the cornstarch may have settled), then pour it into the wok. Stir constantly and cook for 2-3 minutes until the sauce thickens, becomes glossy, and coats the back of a spoon.",
                      "Add the fried pork pieces to the wok. Toss everything together quickly for about 30 seconds to coat the pork evenly with the sauce. Work fast so the pork stays crispy.",
                      "Transfer immediately to a serving plate and serve hot with steamed rice. The pork should be crispy on the outside, tender inside, and coated with a vibrant, glossy sweet and sour sauce."
                  ]
    },
    {
        "id":  "fried_rice",
        "title":  "Chinese Fried Rice",
        "prep_time":  "10 mins",
        "cook_time":  "10 mins",
        "total_time":  "20 mins",
        "image":  "assets/images/cuisines/chinese/fried_rice.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "3 cups Cooked rice (day-old, cold)",
                            "2 Eggs, beaten",
                            "100g Char siu (Chinese BBQ pork), diced",
                            "1/2 cup Frozen peas and carrots",
                            "3 Spring onions, chopped",
                            "2 cloves Garlic, minced",
                            "2 tbsp Soy sauce",
                            "1 tbsp Oyster sauce",
                            "1 tsp Sesame oil",
                            "3 tbsp Vegetable oil",
                            "White pepper to taste"
                        ],
        "steps":  [
                      "Heat 1 tablespoon of oil in a wok over high heat. Pour in the beaten eggs and scramble quickly for about 30-45 seconds until just set but still slightly soft. Remove from wok and set aside on a plate.",
                      "Add the remaining 2 tablespoons of oil to the same wok over high heat. Add the minced garlic and stir-fry for 10-15 seconds until fragrant and lightly golden.",
                      "Add the diced char siu (Chinese BBQ pork) and the frozen peas and carrots to the wok. Stir-fry for 2-3 minutes until the vegetables are heated through and the char siu is slightly caramelized at the edges.",
                      "Add the cold, day-old rice to the wok. Use your spatula to break up any clumps. Stir-fry vigorously for 3-4 minutes, tossing constantly, until the rice is heated through and each grain is separated. The rice should start to look slightly dry.",
                      "Drizzle 2 tablespoons soy sauce and 1 tablespoon oyster sauce over the rice. Continue stir-frying for another 1-2 minutes, mixing well to ensure the rice is evenly colored and seasoned.",
                      "Return the scrambled eggs to the wok, breaking them into smaller pieces with your spatula. Mix everything together for about 30 seconds.",
                      "Add the chopped spring onions and drizzle with 1 teaspoon sesame oil. Give everything a final toss for 15-20 seconds.",
                      "Season with white pepper to taste. Transfer to serving plates and serve immediately while hot. The fried rice should be fragrant, with distinct grains, and a beautiful golden-brown color."
                  ]
    },
    {
        "id":  "peking_duck",
        "title":  "Peking Duck (Simplified)",
        "prep_time":  "30 mins",
        "cook_time":  "90 mins",
        "total_time":  "120 mins",
        "image":  "assets/images/cuisines/chinese/peking_duck.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "1 whole Duck (about 2kg)",
                            "2 tbsp Maltose or honey",
                            "2 tbsp Chinese rice wine",
                            "1 tbsp Soy sauce",
                            "1 tsp Five-spice powder",
                            "3 slices Ginger",
                            "2 Spring onions",
                            "12 Mandarin pancakes",
                            "1/2 cup Hoisin sauce",
                            "1 Cucumber, julienned",
                            "4 Spring onions, julienned"
                        ],
        "steps":  [
                      "Clean the duck thoroughly inside and out under cold running water. Pat completely dry with paper towels - this is crucial for crispy skin. Let it air-dry for 10 minutes.",
                      "In a small bowl, mix together 2 tablespoons maltose (or honey), 2 tablespoons Chinese rice wine, 1 tablespoon soy sauce, and 1 teaspoon five-spice powder until well combined.",
                      "Using a pastry brush, generously brush the maltose mixture all over the duck\u0027s skin, making sure to coat every part evenly. This will give the duck its signature glossy, mahogany color.",
                      "Stuff the duck\u0027s cavity with 3 slices of ginger and 2 whole spring onions. This will infuse the meat with aromatic flavors from the inside.",
                      "Place the duck on a rack over a tray and refrigerate uncovered for at least 4 hours, or preferably overnight. This air-drying step is essential for achieving crispy skin. The skin should feel dry and taut to the touch.",
                      "Preheat your oven to 180°C (350°F). Remove the duck from the refrigerator and let it sit at room temperature for 20 minutes.",
                      "Place the duck breast-side up on a roasting rack in a roasting pan. Roast for 60 minutes. Then increase the oven temperature to 220°C (425°F) and roast for an additional 30 minutes until the skin is deeply golden, crispy, and crackling. The internal temperature should reach 75°C (165°F).",
                      "Remove from oven and let the duck rest for 10 minutes before carving. This allows the juices to redistribute.",
                      "Slice the duck into thin pieces, focusing on getting pieces with both crispy skin and tender meat. Serve with warm Mandarin pancakes, hoisin sauce, julienned cucumber, and julienned spring onions. To eat, spread hoisin on a pancake, add duck, cucumber, and spring onions, then roll up and enjoy."
                  ]
    }
]
