[
    {
        "id":  "coq_au_vin",
        "title":  "ค็อกโอแวง (ไก่ตุ๋นไวน์)",
        "prep_time":  "30 นาที",
        "cook_time":  "90 นาที",
        "total_time":  "120 นาที",
        "image":  "assets/images/cuisines/french/coq_au_vin.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "ไก่ทั้งตัว (ประมาณ 1.5 กก.) หั่นเป็น 8 ชิ้น 1 ตัว",
                            "เบคอนหั่นเต็าซี 200 กรัม",
                            "ไวน์แดง (เบอร์กันดีหรือพิโนนัวร์) 2 ถ้วย",
                            "น้ำซุปไก่ 2 ถ้วย",
                            "คอนยัคหรือบรั่นดี 3 ช้อนโต๊ะ",
                            "มะเขือเทศเพสต์ 2 ช้อนโต๊ะ",
                            "กระเทียมสับ 3 กลีบ",
                            "ใบกระวาน 2 ใบ",
                            "ไทม์สด 4 กิ่ง",
                            "หัวหอมไข่มุกปอกเปลือก 20 หัว",
                            "เห็ดกระดุมผ่าครึ่ง 250 กรัม",
                            "เนยสด 3 ช้อนโต๊ะ",
                            "แป้งอเนกประสงค์ 2 ช้อนโต๊ะ",
                            "น้ำมันมะกอก 2 ช้อนโต๊ะ",
                            "เกลือและพริกไทยดำตามชอบ",
                            "ผักชีฝรั่งสับสำหรับโรยหน้า"
                        ],
        "steps":  [
                      "ใช้กระดาษซับมันเช็ดชิ้นไก่ให้แห้งสนิท ปรุงรสทุกด้านด้วยเกลือและพริกไทยดำบดสดให้เยอะๆ ขั้นตอนนี้สำคัญมากสำหรับการสร้างสีน้ำตาลสวยงาม",
                      "ตั้งน้ำมันมะกอก 2 ช้อนโต๊ะในหม้อดัตช์โอเวนหรือหม้อหนาก้นหนาขนาดใหญ่ไฟกลางค่อนข้างแรง ทอดไก่เป็นชุดๆ เพื่อไม่ให้แน่นเกินไป วางด้านหนังลงก่อน ทอด 5-6 นาที จนเป็นสีทองเข้ม พลิกและทอดอีกด้าน 4-5 นาที ตักไก่ออกพักไว้บนจาน",
                      "ในหม้อเดิม ใส่เบคอนหั่นเต็าซีลงไป ทอดไฟกลาง 5-7 นาที คนเป็นครั้งคราว จนกรอบและไขมันออกมา ตักเบคอนออกด้วยทัพพีรูพรุน พักไว้ ทิ้งไขมันไว้ในหม้อ",
                      "ใส่หัวหอมไข่มุกลงในไขมันเบคอน ทอด 8-10 นาที เขย่าหม้อเป็นครั้งคราว จนเป็นสีทองทุกด้าน ตักออกพักไว้กับเบคอน",
                      "ใส่เนย 1 ช้อนโต๊ะลงในหม้อ ใส่เห็ดผ่าครึ่งและผัด 5-6 นาที จนเป็นสีทองและน้ำระเหยหมด ตักออกพักไว้",
                      "ลดไฟเป็นกลาง ใส่กระเทียมสับลงในหม้อและผัด 30 วินาที จนหอม ใส่มะเขือเทศเพสต์และต้ม 1-2 นาที คนตลอดเวลา",
                      "เทคอนยัคหรือบรั่นดีลงไป จุดไฟอย่างระมัดระวังด้วยไม้ขีดยาวเพื่อทำฟลัมเบ้ (หรือปล่อยให้ต้ม 2 นาที เพื่อเผาแอลกอฮอล์ออก) เมื่อเปลวไฟดับลง เทไวน์แดงลงไป ใช้ช้อนไม้ขูดคราบสีน้ำตาลที่ติดก้นหม้อขึ้นมา",
                      "ใส่ชิ้นไก่กลับเข้าหม้อพร้อมน้ำที่ไหลออกมา เติมน้ำซุปไก่ ใบกระวาน และกิ่งไทม์สด น้ำควรท่วมไก่เกือบหมด ตั้งไฟให้เดือดเบาๆ",
                      "ปิดฝาหม้อและย้ายเข้าเตาอบที่อุ่นไว้ที่ 160°C (325°F) หรือเคี่ยวต่อบนเตาไฟอ่อน ต้ม 45-50 นาที จนไก่นุ่มและสุกทั่ว",
                      "ตักไก่ เบคอน และผักออกจากหม้อและเก็บไว้ให้อุ่น ทิ้งใบกระวานและกิ่งไทม์ ตั้งซอสให้เดือดไฟแรงและต้ม 10-15 นาที เพื่อให้งวดลงประมาณหนึ่งในสาม",
                      "ในชามเล็ก ผสมเนย 2 ช้อนโต๊ะที่เหลือกับแป้ง 2 ช้อนโต๊ะเพื่อทำเบอร์มานิเย่ (เนยนวด) ตีส่วนผสมนี้ลงในซอสที่เดือดทีละน้อยจนซอสข้นเป็นเงาและเคลือบได้",
                      "ใส่ไก่ เบคอน หัวหอม และเห็ดกลับเข้าหม้อ คนเบาๆ ให้ทุกอย่างเคลือบซอส เคี่ยว 5 นาที เพื่อให้ร้อนทั่วและรสชาติผสมผสาน",
                      "ชิมรสและปรุงเพิ่มเติมด้วยเกลือและพริกไทย โรยผักชีฝรั่งสับสด เสิร์ฟร้อนๆ พร้อมขนมปังฝรั่งเศสกรอบ มันฝรั่งบด หรือเส้นเอ็กก์นูเดิลเนย จานนี้ควรเข้มข้น มีรสชาติลึกซึ้ง และหอมกรุ่น"
                  ]
    },
    {
        "id":  "french_onion_soup",
        "title":  "ซุปหัวหอมฝรั่งเศส",
        "prep_time":  "20 นาที",
        "cook_time":  "60 นาที",
        "total_time":  "80 นาที",
        "image":  "assets/images/cuisines/french/french_onion_soup.jpg",
        "categories":  [
                           "snack_and_appetizers"
                       ],
        "ingredients":  [
                            "หัวหอมใหญ่เหลืองหั่นบาง 6 หัว",
                            "เนยสด 4 ช้อนโต๊ะ",
                            "น้ำมันมะกอก 2 ช้อนโต๊ะ",
                            "น้ำตาล 1 ช้อนชา",
                            "กระเทียมสับ 4 กลีบ",
                            "ไวน์ขาวแห้ง 1/2 ถ้วย",
                            "น้ำซุปเนื้อ (ทำเองดีที่สุด) 6 ถ้วย",
                            "ใบกระวาน 2 ใบ",
                            "ไทม์สด 4 กิ่ง",
                            "เกลือและพริกไทยดำตามชอบ",
                            "ขนมปังบาแก็ตต์ฝรั่งเศสหั่นหนา 1 นิ้ว 8 แผ่น",
                            "ชีสกรูแยร์ขูด 2 ถ้วย",
                            "ชีสพาร์เมซานขูด 1/2 ถ้วย",
                            "ไทม์สดสำหรับโรยหน้า"
                        ],
        "steps":  [
                      "ในหม้อหนาก้นหนาขนาดใหญ่หรือดัตช์โอเวน ละลายเนย 4 ช้อนโต๊ะกับน้ำมันมะกอก 2 ช้อนโต๊ะไฟกลาง การผสมกันช่วยป้องกันไม่ให้เนยไหม้",
                      "ใส่หัวหอมหั่นบางและคนให้เคลือบเนยและน้ำมัน โรยน้ำตาล 1 ช้อนชาเพื่อช่วยในการคาราเมลไลซ์ ต้มคนบ่อยๆ 10-15 นาที จนหัวหอมเริ่มนุ่ม",
                      "ลดไฟเป็นกลางค่อนข้างอ่อนและต้มหัวหอมต่อ คนทุก 5-10 นาที รวมเวลา 40-50 นาที หัวหอมควรคาราเมลไลซ์ลึก เป็นสีน้ำตาลทอง และหวานมาก การคาราเมลไลซ์แบบช้าๆ นี้คือกุญแจสำคัญของซุปหัวหอมฝรั่งเศสแท้ๆ อดทนและอย่าเร่งขั้นตอนนี้",
                      "ใส่กระเทียมสับและต้ม 1-2 นาที จนหอม คนตลอดเวลาเพื่อไม่ให้ไหม้",
                      "เทไวน์ขาวลงไปเพื่อดีเกลซหม้อ ขูดคราบคาราเมลที่ติดก้นหม้อขึ้นมาทั้งหมด ปล่อยให้ไวน์เดือด 3-4 นาที จนงวดลงครึ่งหนึ่ง",
                      "เติมน้ำซุปเนื้อ ใบกระวาน และกิ่งไทม์สด ตั้งไฟให้เดือด แล้วลดไฟและเคี่ยวโดยไม่ปิดฝา 20-25 นาที เพื่อให้รสชาติผสมผสาน ปรุงรสด้วยเกลือและพริกไทยดำบดสดตามชอบ",
                      "ขณะที่ซุปเคี่ยว อุ่นเตาอบที่ 200°C (400°F) วางแผ่นขนมปังบาแก็ตต์บนถาดอบและปิ้งในเตาอบ 5-7 นาที จนเป็นสีทองและกรอบทั้งสองด้าน พักไว้",
                      "เอาใบกระวานและกิ่งไทม์ออกจากซุป ชิมรสและปรุงเพิ่มเติมถ้าจำเป็น",
                      "ตักซุปร้อนๆ ใส่ชามทนเตาอบหรือครอก เติมประมาณ 3/4 เต็ม วางขนมปังบาแก็ตต์ปิ้ง 1-2 แผ่นลอยบนซุปในแต่ละชาม",
                      "โรยชีสกรูแยร์ขูดให้เยอะๆ บนแต่ละชาม (ประมาณ 1/4 ถ้วยต่อชาม) ให้แน่ใจว่าปกคลุมขนมปังทั้งหมด โรยชีสพาร์เมซานเล็กน้อยเพื่อรสชาติเพิ่มเติม",
                      "วางชามบนถาดอบและย้ายเข้าเตาอบ อบ 10-15 นาที จนชีสละลาย ฟู และเป็นสีทองบนหน้า สำหรับเปลือกทองพิเศษ สามารถย่างไฟบน 2-3 นาทีสุดท้าย ดูอย่างระมัดระวังเพื่อไม่ให้ไหม้",
                      "ระมัดระวังนำออกจากเตาอบ (ชามจะร้อนมาก!) โรยกิ่งไทม์สดเล็กๆ ปล่อยให้เย็น 2-3 นาทีก่อนเสิร์ฟ ซุปควรมีรสหัวหอมเข้มข้นหวาน พร้อมท็อปปิ้งชีสละลายยืดเหนียวอย่างงดงาม"
                  ]
    },
    {
        "id":  "creme_brulee",
        "title":  "แครมบรูเล่",
        "prep_time":  "15 นาที",
        "cook_time":  "45 นาที",
        "total_time":  "60 นาที (บวกแช่เย็น 4 ชั่วโมง)",
        "image":  "assets/images/cuisines/french/creme_brulee.jpg",
        "categories":  [
                           "dessert"
                       ],
        "ingredients":  [
                            "วิปปิ้งครีม 2 ถ้วย",
                            "ฝักวานิลลา 1 ฝัก (หรือสารสกัดวานิลลา 2 ช้อนชา)",
                            "ไข่แดง 5 ฟอง",
                            "น้ำตาลทราย 1/2 ถ้วย (บวกพิเศษสำหรับโรยหน้า)",
                            "เกลือเล็กน้อย",
                            "น้ำตาลละเอียดสำหรับคาราเมลไลซ์ 6 ช้อนโต๊ะ"
                        ],
        "steps":  [
                      "อุ่นเตาอบที่ 150°C (300°F) วางรามีกิน 6 ใบ (ขนาด 4-6 ออนซ์) ในถาดอบขนาดใหญ่ ต้มน้ำในกาต้มน้ำสำหรับอ่างน้ำ",
                      "เทวิปปิ้งครีมลงในหม้อขนาดกลาง ผ่าฝักวานิลลาตามยาวและขูดเมล็ดออกด้วยหลังมีด ใส่ทั้งเมล็ดและฝักลงในครีม (หรือใส่สารสกัดวานิลลาถ้าใช้) ตั้งไฟกลางจนครีมเริ่มเดือดรอบขอบ ปิดไฟทันทีและปล่อยให้แช่ 10-15 นาที เพื่อให้กลิ่นวานิลลาซึม เอาฝักวานิลลาออก",
                      "ในชามผสมขนาดใหญ่ ตีไข่แดง น้ำตาลทราย 1/2 ถ้วย และเกลือเล็กน้อยเข้าด้วยกัน 2-3 นาที จนส่วนผสมเป็นสีเหลืองอ่อนและข้นเล็กน้อย อย่าตีมากเกินไปไม่งั้นจะมีอากาศเข้าไปมาก",
                      "ค่อยๆ เทครีมอุ่นลงในส่วนผสมไข่เป็นสายบางๆ ตีตลอดเวลา กระบวนการนี้เรียกว่าเทมเปอริง ป้องกันไม่ให้ไข่สุกเป็นก้อน ตีเบาๆ เพื่อหลีกเลี่ยงฟอง",
                      "กรองส่วนผสมคัสตาร์ดผ่านตะแกรงละเอียดลงในถ้วยตวงขนาดใหญ่หรือชามที่มีปาก เพื่อเอาเศษไข่ที่สุกออกและทำให้เนื้อสัมผัสเนียนนุ่มเป็นไหม",
                      "ค่อยๆ เทคัสตาร์ดลงในรามีกิน แบ่งเท่าๆ กัน เติมแต่ละรามีกินถึงประมาณ 1/4 นิ้วจากขอบบน ถ้ามีฟองบนผิว ตักออกเบาๆ ด้วยช้อนหรือจุดด้วยเครื่องพ่นไฟ",
                      "วางถาดอบพร้อมรามีกินในเตาอบ ค่อยๆ เทน้ำร้อนจากกาต้มน้ำลงในถาดอบจนถึงครึ่งความสูงของรามีกิน อ่างน้ำ (แบงมารี) นี้ทำให้การอบนุ่มนวลและสม่ำเสมอ",
                      "อบ 40-45 นาที คัสตาร์ดสุกเมื่อขอบตัวแต่ตรงกลางยังสั่นเล็กน้อยเมื่อเขย่าเบาๆ เหมือนเยลลี่นุ่ม จะตัวต่อเมื่อเย็นลง อย่าอบมากเกินไปไม่งั้นเนื้อสัมผัสจะหยาบ",
                      "ระมัดระวังนำถาดอบออกจากเตาอบ ใช้คีมหยิบรามีกินแต่ละใบออกจากอ่างน้ำและวางบนตะแกรงพักความร้อน ปล่อยให้เย็นเป็นอุณหภูมิห้องประมาณ 30 นาที",
                      "เมื่อเย็นแล้ว ปิดรามีกินแต่ละใบด้วยพลาสติกห่ออาหารและแช่ตู้เย็นอย่างน้อย 4 ชั่วโมง หรือดีที่สุดคือข้ามคืน คัสตาร์ดต้องเย็นสนิทก่อนคาราเมลไลซ์น้ำตาล",
                      "ก่อนเสิร์ฟ นำคัสตาร์ดออกจากตู้เย็น ซับน้ำค้างบนผิวด้วยกระดาษซับมัน โรยน้ำตาลละเอียด 1 ช้อนโต๊ะให้ทั่วแต่ละคัสตาร์ด เอียงเพื่อเคลือบทั้งผิว",
                      "ใช้เครื่องพ่นไฟครัว ถือเปลวไฟห่าง 2-3 นิ้วจากน้ำตาลและเคลื่อนที่เป็นวงกลมจนน้ำตาลละลายและคาราเมลไลซ์เป็นสีเหลืองอำพันเข้ม ทำอย่างรวดเร็วและสม่ำเสมอ ปล่อยให้น้ำตาลแข็ง 1-2 นาที เพื่อสร้างเปลือกกรอบ หรือวางใต้เตาอบไฟบนร้อนมาก 2-3 นาที ดูตลอดเวลา เสิร์ฟทันที ความตัดกันระหว่างท็อปน้ำตาลคาราเมลกรอบและคัสตาร์ดครีมมี่เนียนนุ่มข้างใต้คือเอกลักษณ์ของแครมบรูเล่ที่สมบูรณ์แบบ"
                  ]
    },
    {
        "id":  "chocolate_mousse",
        "title":  "มูสช็อกโกแลต",
        "prep_time":  "20 นาที",
        "cook_time":  "5 นาที",
        "total_time":  "25 นาที (บวกแช่เย็น 2 ชั่วโมง)",
        "image":  "assets/images/cuisines/french/chocolate_mousse.jpg",
        "categories":  [
                           "dessert"
                       ],
        "ingredients":  [
                            "ช็อกโกแลตดาร์ก (70% โกโก้) สับ 200 กรัม",
                            "เนยสดหั่นชิ้น 3 ช้อนโต๊ะ",
                            "ไข่แยกไข่ขาวไข่แดง 3 ฟอง",
                            "น้ำตาลทราย 1/4 ถ้วย",
                            "วิปปิ้งครีม 1 ถ้วย",
                            "สารสกัดวานิลลา 1 ช้อนชา",
                            "เกลือเล็กน้อย",
                            "วิปครีมสำหรับโรยหน้า",
                            "เกล็ดช็อกโกแลตสำหรับโรยหน้า"
                        ],
        "steps":  [
                      "วางช็อกโกแลตดาร์กสับและเนยหั่นชิ้นในชามทนความร้อน ตั้งชามเหนือหม้อน้ำเดือดซุกๆ (ให้แน่ใจว่าก้นชามไม่แตะน้ำ) คนเป็นครั้งคราวจนช็อกโกแลตและเนยละลายหมดและเนียน ยกออกจากความร้อนและปล่อยให้เย็น 5-10 นาที จนอุ่นๆ",
                      "ขณะที่ช็อกโกแลตเย็น แยกไข่ วางไข่ขาวในชามผสมที่สะอาดและแห้ง (ร่องรอยของไขมันจะทำให้ตีไม่ขึ้น) วางไข่แดงในชามแยก",
                      "ตีไข่แดงเบาๆ แล้วค่อยๆ ตีเข้ากับส่วนผสมช็อกโกแลตอุ่นๆ จนเข้ากันดีและเนียน ส่วนผสมควรเป็นเงา พักไว้",
                      "ในชามสะอาด ตีวิปปิ้งครีมกับสารสกัดวานิลลาด้วยเครื่องตีไฟกลางค่อนข้างแรง 2-3 นาที จนเป็นยอดนุ่ม ครีมควรรักษารูปร่างแต่ยังนุ่มและฟู อย่าตีมากเกินไปไม่งั้นจะเป็นเม็ด แช่ตู้เย็นจนต้องการใช้",
                      "ใช้ตีที่สะอาด ตีไข่ขาวกับเกลือเล็กน้อยไฟกลางจนเป็นฟอง ค่อยๆ เติมน้ำตาลทราย ทีละ 1 ช้อนโต๊ะ ขณะตีต่อ เพิ่มความเร็วเป็นแรงและตี 3-4 นาที จนเป็นยอดแข็งเงางาม เมอแรงค์ควรตั้งตรงเมื่อยกตีขึ้น",
                      "พับไข่ขาวตีประมาณหนึ่งในสามลงในส่วนผสมช็อกโกแลตเบาๆ ด้วยพายยาง ใช้การพับเบาๆ ตัดลงตรงกลางและกวาดขึ้นด้านข้าง ทำให้ฐานช็อกโกแลตเบาขึ้น",
                      "เติมไข่ขาวที่เหลือและพับเบาๆ จนเพิ่งเข้ากัน คุณควรเห็นริ้วสีขาวเล็กน้อย - อย่าผสมมากเกินไปไม่งั้นจะทำให้มูสแฟบ",
                      "สุดท้าย พับวิปครีมลงไปสองครั้ง ใช้เทคนิคพับเบาๆ เหมือนเดิม พับจนไม่เห็นริ้วสีขาว แต่ระวังอย่าทำให้เนื้อสัมผัสโปร่งแฟบ",
                      "ตักหรือบีบมูสลงในแก้วเสิร์ฟหรือรามีกินแยก เกลี่ยหน้าด้วยหลังช้อน",
                      "ปิดด้วยพลาสติกห่ออาหารและแช่ตู้เย็นอย่างน้อย 2 ชั่วโมง หรือสูงสุด 24 ชั่วโมง มูสต้องการเวลาในการตัวและพัฒนารสชาติเต็มที่",
                      "ก่อนเสิร์ฟ โรยวิปครีมทีละก้อนบนมูสแต่ละแก้วและโรยเกล็ดช็อกโกแลตหรือผงโกโก้ มูสควรเบาโปร่งอย่างเหลือเชื่อ และมีรสช็อกโกแลตเข้มข้นพร้อมเนื้อสัมผัสเนียนนุ่มเป็นไหมที่ละลายในปาก"
                  ]
    },
    {
        "id":  "cafe_au_lait",
        "title":  "คาเฟ่โอเล",
        "prep_time":  "5 นาที",
        "cook_time":  "5 นาที",
        "total_time":  "10 นาที",
        "image":  "assets/images/cuisines/french/cafe_au_lait.jpg",
        "categories":  [
                           "drink"
                       ],
        "ingredients":  [
                            "กาแฟชงเข้มข้น (เฟรนช์เพรสหรือดริป) 1 ถ้วย",
                            "นมสดไขมันเต็ม 1 ถ้วย",
                            "น้ำตาล 1-2 ช้อนชา (ถ้าต้องการ)",
                            "ผงโกโก้หรือผงอบเชยสำหรับโรยหน้า (ถ้าต้องการ)"
                        ],
        "steps":  [
                      "ชงกาแฟเข้มข้นด้วยวิธีที่คุณชอบ เฟรนช์เพรสเป็นแบบดั้งเดิมและให้กาแฟเข้มข้นกลมกล่อมที่เหมาะสำหรับคาเฟ่โอเล ใช้การบดหยาบปานกลางและอัตราส่วนกาแฟต่อน้ำ 1:15 หรือใช้เครื่องชงกาแฟดริปด้วยอัตราส่วนกาแฟต่อน้ำที่สูงกว่าปกติเล็กน้อยเพื่อให้ได้กาแฟเข้มข้นขึ้น",
                      "ขณะที่กาแฟกำลังชง เทนมสดไขมันเต็มลงในหม้อเล็ก ตั้งไฟกลาง คนเป็นครั้งคราวเพื่อไม่ให้ไหม้ 4-5 นาที จนนมร้อนและมีไอขึ้นแต่ไม่เดือด คุณควรเห็นฟองเล็กๆ เกิดขึ้นรอบขอบ อุณหภูมิที่เหมาะคือประมาณ 65-70°C (150-160°F)",
                      "ถ้าต้องการนมฟอง สามารถใช้เครื่องตีฟองนม เครื่องปั่นแบบจุ่ม หรือตีอย่างแรง 30-60 วินาที เพื่อสร้างฟอง หรือเทนมร้อนลงในเฟรนช์เพรสและสูบลูกสูบขึ้นลงอย่างรวดเร็ว 30 วินาที เพื่อสร้างฟอง",
                      "อุ่นถ้วยหรือชามเสิร์ฟโดยล้างด้วยน้ำร้อน คาเฟ่โอเลแบบดั้งเดิมเสิร์ฟในถ้วยรูปชามกว้างที่คุณสามารถกอดด้วยมือทั้งสอง",
                      "เทกาแฟร้อนและนมร้อนพร้อมกันลงในถ้วยจากสองด้านตรงข้าม สร้างการผสมผสานที่สวยงาม อัตราส่วนแบบดั้งเดิมคือ 1:1 (กาแฟและนมเท่ากัน) แต่คุณสามารถปรับตามความชอบ เทอย่างสม่ำเสมอเพื่อรักษาอุณหภูมิ",
                      "ถ้าต้องการ เติมน้ำตาล 1-2 ช้อนชาและคนเบาๆ ให้ละลาย คาเฟ่โอเลฝรั่งเศสแบบดั้งเดิมมักดื่มโดยไม่ใส่น้ำตาลเพื่อชื่นชมรสกาแฟและนมบริสุทธิ์",
                      "สำหรับสัมผัสที่หรูหรา โรยผงโกโก้หรือผงอบเชยเล็กน้อยบนหน้าโดยใช้ตะแกรงละเอียด",
                      "เสิร์ฟทันทีขณะร้อน คาเฟ่โอเลแบบดั้งเดิมดื่มเป็นอาหารเช้า มักพร้อมครัวซองต์หรือแปงโอช็อกโกแลต เครื่องดื่มควรนุ่มนวล ครีมมี่ และให้ความอบอุ่น พร้อมความสมดุลที่สมบูรณ์แบบระหว่างกาแฟเข้มข้นและนมหวานครีมมี่ ต่างจากลาเต้ คาเฟ่โอเลใช้กาแฟชงแทนเอสเพรสโซ ทำให้มีรสชาติเบาและละเอียดอ่อนกว่า"
                  ]
    }
]
