[
    {
        "id":  "moussaka",
        "title":  "มูสซากา",
        "prep_time":  "40 นาที",
        "cook_time":  "60 นาที",
        "total_time":  "100 นาที",
        "image":  "assets/images/cuisines/greek/moussaka.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "มะเขือยาวหั่นหนา 1 ซม. 3 ลูก",
                            "เนื้อแกะหรือเนื้อวัวบด 500 กรัม",
                            "หัวหอมสับ 1 หัว",
                            "กระเทียมสับ 3 กลีบ",
                            "มะเขือเทศกระป๋อง 400 กรัม",
                            "มะเขือเทศเพสต์ 2 ช้อนโต๊ะ",
                            "อบเชย 1 ช้อนชา",
                            "ออริกาโน 1 ช้อนชา",
                            "ไวน์แดง 1/2 ถ้วย",
                            "สำหรับเบชาเมล: เนย 4 ช้อนโต๊ะ",
                            "แป้ง 4 ช้อนโต๊ะ",
                            "นม 3 ถ้วย",
                            "ไข่แดง 2 ฟอง",
                            "ชีสพาร์เมซานขูด 1/2 ถ้วย",
                            "จันทน์เทศ เกลือ น้ำมันมะกอก"
                        ],
        "steps":  [
                      "โรยเกลือบนมะเขือหั่นและปล่อยทิ้งไว้ 30 นาที เพื่อดึงความชื้นออก ล้างและเช็ดให้แห้ง ทาน้ำมันมะกอกและย่างหรืออบที่ 200°C 15 นาที จนเป็นสีทอง พักไว้",
                      "ตั้งน้ำมันมะกอกในกระทะ ผัดหัวหอมและกระเทียมจนนุ่ม ใส่เนื้อบดและต้มจนเป็นสีน้ำตาล ทุบแยกขณะต้ม",
                      "ใส่มะเขือเทศ มะเขือเทศเพสต์ ไวน์แดง อบเชย ออริกาโน เกลือ และพริกไทย เคี่ยว 20 นาที จนข้น พักไว้",
                      "ทำเบชาเมล: ละลายเนย ใส่แป้ง และตี 2 นาที ค่อยๆ เติมนมพร้อมตีตลอดเวลาจนข้นและเนียน ประมาณ 8 นาที ยกออกจากไฟ คนไข่แดง พาร์เมซาน จันทน์เทศ เกลือ และพริกไทย",
                      "อุ่นเตาอบที่ 180°C (350°F) ในจานอบ เรียงชั้นมะเขือครึ่งหนึ่ง ซอสเนื้อทั้งหมด มะเขือที่เหลือ แล้วเทเบชาเมลทับหน้า",
                      "อบ 45 นาที จนเป็นสีทองและฟู พัก 15 นาทีก่อนเสิร์ฟ มูสซากาควรมีชั้นชัดเจนพร้อมเบชาเมลครีมมี่บนหน้า"
                  ]
    },
    {
        "id":  "greek_salad",
        "title":  "สลัดกรีก (ฮอริอาติกิ)",
        "prep_time":  "15 นาที",
        "cook_time":  "0 นาที",
        "total_time":  "15 นาที",
        "image":  "assets/images/cuisines/greek/greek_salad.jpg",
        "categories":  [
                           "snack_and_appetizers"
                       ],
        "ingredients":  [
                            "มะเขือเทศหั่นเป็นชิ้น 4 ลูก",
                            "แตงกวาหั่นหนา 1 ลูก",
                            "หัวหอมแดงหั่นบาง 1 หัว",
                            "พริกหยวกเขียวหั่น 1 เม็ด",
                            "ชีสเฟต้าเป็นก้อน 200 กรัม",
                            "มะกอกคาลามาต้า 1 ถ้วย",
                            "ออริกาโนแห้ง 1 ช้อนชา",
                            "น้ำมันมะกอกบริสุทธิ์พิเศษ 1/4 ถ้วย",
                            "น้ำส้มสายชูไวน์แดง 2 ช้อนโต๊ะ",
                            "เกลือและพริกไทย"
                        ],
        "steps":  [
                      "ในชามใหญ่ ผสมมะเขือเทศหั่น แตงกวาหั่น หัวหอมแดง และพริกหยวก",
                      "ใส่มะกอกคาลามาต้า ราดน้ำมันมะกอกและน้ำส้มสายชูไวน์แดง โรยออริกาโน เกลือ และพริกไทย",
                      "คลุกเบาๆ ให้เข้ากัน วางก้อนชีสเฟต้าบนหน้า (สลัดกรีกแท้ๆ ไม่บดเฟต้า)",
                      "ราดน้ำมันมะกอกเพิ่มเล็กน้อยลงบนเฟต้า เสิร์ฟทันที สลัดควรสด เรียบง่าย และปล่อยให้ส่วนผสมคุณภาพดีโดดเด่น"
                  ]
    },
    {
        "id":  "souvlaki",
        "title":  "ซูฟลากีไก่",
        "prep_time":  "20 นาที (บวกหมัก 2 ชั่วโมง)",
        "cook_time":  "15 นาที",
        "total_time":  "35 นาที",
        "image":  "assets/images/cuisines/greek/souvlaki.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "เนื้ออกไก่หั่นเต็าซี 800 กรัม",
                            "น้ำมันมะกอก 1/4 ถ้วย",
                            "น้ำมะนาว 3 ช้อนโต๊ะ",
                            "กระเทียมสับ 3 กลีบ",
                            "ออริกาโน 1 ช้อนโต๊ะ",
                            "ผงพริกหวาน 1 ช้อนชา",
                            "เกลือและพริกไทย",
                            "ขนมปังพิต้า ซอสซาซิกิ มะเขือเทศ หัวหอม ผักสลัด"
                        ],
        "steps":  [
                      "ผสมน้ำมันมะกอก น้ำมะนาว กระเทียม ออริกาโน ผงพริกหวาน เกลือ และพริกไทย ใส่ไก่เต็าซีและหมัก 2 ชั่วโมงหรือข้ามคืน",
                      "ร้อยไก่ลงในไม้เสียบ อุ่นเตาย่างไฟแรง",
                      "ย่างไม้เสียบ 12-15 นาที พลิกเป็นครั้งคราว จนไก่สุกทั่วและไหม้เล็กน้อย",
                      "เสิร์ฟในขนมปังพิต้าอุ่นๆ พร้อมซอสซาซิกิ มะเขือเทศ หัวหอม และผักสลัด ซูฟลากีควรชุ่มฉ่ำ มีรสมะนาว และควันจากเตาย่าง"
                  ]
    },
    {
        "id":  "baklava",
        "title":  "บาคลาวา",
        "prep_time":  "30 นาที",
        "cook_time":  "50 นาที",
        "total_time":  "80 นาที (บวกทำให้เย็น)",
        "image":  "assets/images/cuisines/greek/baklava.jpg",
        "categories":  [
                           "dessert"
                       ],
        "ingredients":  [
                            "แป้งฟิลโล 1 ซอง (450 กรัม)",
                            "วอลนัทสับละเอียด 2 ถ้วย",
                            "เนยละลาย 1 ถ้วย",
                            "อบเชย 1 ช้อนชา",
                            "สำหรับน้ำเชื่อม: น้ำตาล 1 ถ้วย",
                            "น้ำ 1 ถ้วย",
                            "น้ำผึ้ง 1/2 ถ้วย",
                            "วานิลลา 1 ช้อนชา",
                            "เปลือกมะนาว"
                        ],
        "steps":  [
                      "อุ่นเตาอบที่ 175°C (350°F) ผสมวอลนัทกับอบเชย",
                      "ทาจานอบ 9x13 ด้วยเนย เรียง 8 แผ่นฟิลโล ทาแต่ละแผ่นด้วยเนยละลาย",
                      "โรย 1/3 ของส่วนผสมถั่ว เพิ่มฟิลโลอีก 4 แผ่น (ทาเนยแต่ละแผ่น) แล้วถั่ว ทำซ้ำ ปิดท้ายด้วยฟิลโล 8 แผ่น ทาเนยแต่ละแผ่น",
                      "หั่นเป็นรูปเพชรก่อนอบ อบ 50 นาที จนเป็นสีทองและกรอบ",
                      "ทำน้ำเชื่อม: ต้มน้ำตาล น้ำ น้ำผึ้ง วานิลลา และเปลือกมะนาว 10 นาที เอาเปลือกมะนาวออก",
                      "เทน้ำเชื่อมร้อนลงบนบาคลาวาอุ่น ปล่อยให้เย็นสนิท (อย่างน้อย 4 ชั่วโมง) ก่อนเสิร์ฟ บาคลาวาควรกรอบ หวาน และมีรสถั่ว"
                  ]
    },
    {
        "id":  "tzatziki",
        "title":  "ซอสซาซิกิ",
        "prep_time":  "15 นาที (บวกพักน้ำ 1 ชั่วโมง)",
        "cook_time":  "0 นาที",
        "total_time":  "15 นาที",
        "image":  "assets/images/cuisines/greek/tzatziki.jpg",
        "categories":  [
                           "snack_and_appetizers"
                       ],
        "ingredients":  [
                            "โยเกิร์ตกรีก 2 ถ้วย",
                            "แตงกวาขูด 1 ลูก",
                            "กระเทียมสับ 3 กลีบ",
                            "น้ำมันมะกอก 2 ช้อนโต๊ะ",
                            "น้ำมะนาว 1 ช้อนโต๊ะ",
                            "ดิลสดสับ 1 ช้อนโต๊ะ",
                            "เกลือและพริกไทย"
                        ],
        "steps":  [
                      "ขูดแตงกวาและบีบน้ำส่วนเกินออกโดยใช้ผ้าครัวสะอาด สำคัญมากสำหรับซาซิกิข้น",
                      "ในชาม ผสมโยเกิร์ตกรีก แตงกวาพักน้ำ กระเทียมสับ น้ำมันมะกอก น้ำมะนาว และดิล",
                      "ปรุงรสด้วยเกลือและพริกไทย ผสมให้เข้ากัน",
                      "แช่ตู้เย็นอย่างน้อย 1 ชั่วโมงเพื่อให้รสชาติผสมผสาน เสิร์ฟพร้อมขนมปังพิต้า เนื้อย่าง หรือเป็นน้ำจิ้ม ซาซิกิควรข้น ครีมมี่ และสดชื่น"
                  ]
    }
]
