[
    {
        "id":  "spaghetti_carbonara",
        "title":  "สปาเก็ตตี้คาร์โบนารา",
        "prep_time":  "10 นาที",
        "cook_time":  "15 นาที",
        "total_time":  "25 นาที",
        "image":  "assets/images/cuisines/italian/spaghetti_carbonara.jpg",
        "categories":  [
                           "maincourse",
                           "noodles"
                       ],
        "ingredients":  [
                            "สปาเก็ตตี้ 400 กรัม",
                            "กวานชาเล่หรือแพนเชตต้าหั่นเต็าซี 200 กรัม",
                            "ไข่แดงไข่ใหญ่ 4 ฟอง",
                            "ไข่ทั้งฟอง 1 ฟอง",
                            "ชีสเปโคริโนโรมาโนขูดละเอียด 100 กรัม",
                            "ชีสพาร์เมซานขูดละเอียด 50 กรัม",
                            "พริกไทยดำบดสด",
                            "เกลือสำหรับน้ำต้มพาสต้า"
                        ],
        "steps":  [
                      "ต้มน้ำในหม้อใหญ่ให้เดือดปุดๆ ใส่เกลือเยอะๆ (ประมาณ 1-2 ช้อนโต๊ะ) - น้ำควรมีรสเค็มเหมือนน้ำทะเล นี่คือโอกาสเดียวที่จะปรุงรสพาสต้าเอง",
                      "ขณะที่น้ำร้อน ใส่กวานชาเล่หรือแพนเชตต้าหั่นเต็าซีในกระทะขนาดใหญ่ที่เย็น เปิดไฟกลางและทอด 8-10 นาที คนเป็นครั้งคราว จนไขมันออกมาและเนื้อกรอบเป็นสีทอง การทอดช้าๆ คือกุญแจสำคัญของกวานชาเล่กรอบ ปิดไฟและพักไว้ เก็บไขมันที่ออกมาไว้ในกระทะ",
                      "ในชามผสมขนาดใหญ่ ตีไข่แดง ไข่ทั้งฟอง ชีสเปโคริโนโรมาโนขูด และชีสพาร์เมซานขูดเข้าด้วยกันจนเนียนและครีมมี่ ใส่พริกไทยดำบดสดเยอะๆ (อย่างน้อย 1 ช้อนชา) ส่วนผสมควรข้นและเป็นสีเหลืองอ่อน",
                      "เมื่อน้ำเดือด ใส่สปาเก็ตตี้และต้มตามคำแนะนำบนซองจนอัลเดนเต้ (ปกติ 8-10 นาที) พาสต้าควรนุ่มแต่ยังเคี้ยวได้เล็กน้อยตรงกลาง ก่อนพักน้ำ ตักน้ำต้มพาสต้าที่มีแป้งไว้ 1 ถ้วย - สำคัญมากสำหรับการสร้างซอสครีมมี่",
                      "เมื่อพาสต้าเกือบสุก นำกระทะที่มีกวานชาเล่กลับมาตั้งไฟอ่อนเพื่ออุ่นไขมันเล็กน้อย ต้องการให้อุ่น ไม่ใช่ร้อน ไม่งั้นไข่จะสุกเป็นก้อน",
                      "พักน้ำพาสต้า (อย่าล้างน้ำ) และใส่ลงในกระทะอุ่นๆ ที่มีกวานชาเล่ทันที คลุกอย่างรวดเร็วเพื่อเคลือบพาสต้าด้วยไขมันที่ออกมา ยกกระทะออกจากไฟทันที",
                      "ทำอย่างรวดเร็ว เทส่วนผสมไข่และชีสลงบนพาสต้าร้อน คลุกอย่างแรงและต่อเนื่อง 1-2 นาที ความร้อนที่เหลืออยู่จากพาสต้าจะทำให้ไข่สุกเบาๆ สร้างซอสเนียนนุ่มครีมมี่ ถ้าซอสดูข้นเกินไป เติมน้ำต้มพาสต้าที่เก็บไว้ทีละ 1-2 ช้อนโต๊ะ คลุกตลอดเวลา จนได้ความข้นเงาเคลือบได้",
                      "ชิมรสและปรุงเพิ่มเติมด้วยพริกไทยดำถ้าต้องการ ชีสมีรสเค็มอยู่แล้ว คุณอาจไม่ต้องเติมเกลือ เสิร์ฟทันทีในชามอุ่น โรยชีสเปโคริโนโรมาโนขูดเพิ่มและบดพริกไทยดำเยอะๆ คาร์โบนาราไม่รอใคร - ต้องทานทันทีขณะที่ซอสครีมมี่และพาสต้าร้อน จานนี้ควรเนียนนุ่มเป็นไหม ไม่ใช่ไข่สุกเป็นก้อน โดยเส้นสปาเก็ตตี้แต่ละเส้นเคลือบด้วยซอสเข้มข้นรสพริกไทย"
                  ]
    },
    {
        "id":  "margherita_pizza",
        "title":  "พิซซ่ามาร์เกริต้า",
        "prep_time":  "90 นาที (รวมแป้งพอง)",
        "cook_time":  "10 นาที",
        "total_time":  "100 นาที",
        "image":  "assets/images/cuisines/italian/margherita_pizza.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "สำหรับแป้ง: แป้งอเนกประสงค์หรือแป้ง 00 500 กรัม",
                            "น้ำอุ่น (40°C) 325 มล.",
                            "ยีสต์แห้ง 2 ช้อนชา",
                            "เกลือ 2 ช้อนชา",
                            "น้ำตาล 1 ช้อนชา",
                            "น้ำมันมะกอก 2 ช้อนโต๊ะ",
                            "สำหรับท็อปปิ้ง: มะเขือเทศซานมาร์ซาโนกระป๋อง 400 กรัม",
                            "กระเทียมสับ 2 กลีบ",
                            "น้ำมันมะกอก 2 ช้อนโต๊ะ",
                            "เกลือและพริกไทยตามชอบ",
                            "ชีสมอสซาเรลล่าสดหั่นหรือฉีก 250 กรัม",
                            "ใบโหระพาสด",
                            "น้ำมันมะกอกบริสุทธิ์พิเศษสำหรับราด"
                        ],
        "steps":  [
                      "ทำแป้ง: ในชามเล็ก ผสมน้ำอุ่น (40°C - ควรรู้สึกอุ่นแต่ไม่ร้อนเมื่อสัมผัส) น้ำตาล และยีสต์ คนเบาๆ และปล่อยทิ้งไว้ 5-10 นาที จนเป็นฟอง นี่พิสูจน์ว่ายีสต์ยังมีชีวิต",
                      "ในชามใหญ่ ผสมแป้งและเกลือ ทำหลุมตรงกลางและเทส่วนผสมยีสต์และน้ำมันมะกอกลงไป ใช้ช้อนไม้หรือมือคลุกจนเป็นแป้งหยาบๆ",
                      "พลิกแป้งออกมาบนพื้นผิวโรยแป้งเล็กน้อยและนวด 8-10 นาที จนเนียน ยืดหยุ่น และเหนียวเล็กน้อยแต่ไม่ติดมือ แป้งควรกลับคืนรูปเมื่อกด ถ้าเหนียวเกินไป เติมแป้งทีละ 1 ช้อนโต๊ะ",
                      "วางแป้งในชามทาน้ำมันเล็กน้อย พลิกเพื่อเคลือบทุกด้าน ปิดด้วยผ้าชุบน้ำหมาดๆ หรือพลาสติกห่ออาหาร ปล่อยให้พองในที่อุ่นไม่มีลมโกรก 60-90 นาที จนขนาดเพิ่มเป็นสองเท่า แป้งควรฟูและเว้าเมื่อกด",
                      "ขณะที่แป้งพอง ทำซอส: บดมะเขือเทศซานมาร์ซาโนด้วยมือหรือปั่นเบาๆ ในเครื่องปั่น - ต้องการเนื้อสัมผัสหยาบ ไม่ใช่เนียน ในชาม ผสมมะเขือเทศบดกับกระเทียมสับ น้ำมันมะกอก 2 ช้อนโต๊ะ เกลือ และพริกไทย อย่าต้มซอส - จะสุกบนพิซซ่า พักไว้",
                      "อุ่นเตาอบที่อุณหภูมิสูงสุดที่เป็นไปได้ ควรจะ 260°C (500°F) หรือสูงกว่า ถ้ามีหินพิซซ่า วางในเตาอบเพื่ออุ่นอย่างน้อย 30 นาที ถ้าไม่มี ใช้ถาดอบกลับด้าน",
                      "เมื่อแป้งพองแล้ว กดลงเบาๆ และแบ่งเป็น 2 ส่วนเท่าๆ กันสำหรับพิซซ่า 2 แผ่นขนาด 12 นิ้ว บนพื้นผิวโรยแป้งเล็กน้อย หยิบแป้งส่วนหนึ่งและค่อยๆ ยืดเป็นวงกลมขนาด 12 นิ้ว เริ่มจากตรงกลางและทำออกด้านนอก ใช้ปลายนิ้วกดและยืด ทิ้งขอบหนาเล็กน้อยสำหรับเปลือก อย่าใช้ไม้นวด - จะทำให้ฟองอากาศแฟบ",
                      "ย้ายแป้งที่ยืดแล้วไปยังกระดาษรองอบหรือพายพิซซ่าโรยแป้งหรือแป้งข้าวโพด ทาซอสมะเขือเทศประมาณครึ่งหนึ่งบนแป้ง เว้นขอบ 1 นิ้ว อย่าใส่ซอสมากเกินไปไม่งั้นพิซซ่าจะเปียก",
                      "ฉีกหรือหั่นชีสมอสซาเรลล่าสดและกระจายทั่วซอสอย่างสม่ำเสมอ ราดน้ำมันมะกอกบริสุทธิ์พิเศษเล็กน้อย",
                      "ระมัดระวังย้ายพิซซ่า (พร้อมกระดาษถ้าใช้) ไปยังหินพิซซ่าหรือถาดอบที่อุ่นไว้ อบ 8-12 นาที จนเปลือกเป็นสีทองและไหม้เล็กน้อยบางจุด ชีสละลายและฟู และก้นกรอบ",
                      "นำออกจากเตาอบและโรยใบโหระพาสดฉีกด้วยมือทันที ราดน้ำมันมะกอกบริสุทธิ์พิเศษอีกเล็กน้อย พัก 1-2 นาทีก่อนหั่น พิซซ่าควรมีเปลือกกรอบไหม้เล็กน้อย ซอสมะเขือเทศเรียบง่ายแต่มีรสชาติ มอสซาเรลล่าละลายครีมมี่ และกลิ่นหอมสดของโหระพา ทำซ้ำกับแป้งส่วนที่สอง"
                  ]
    },
    {
        "id":  "risotto_funghi",
        "title":  "ริซอตโต้เห็ด",
        "prep_time":  "15 นาที",
        "cook_time":  "30 นาที",
        "total_time":  "45 นาที",
        "image":  "assets/images/cuisines/italian/risotto_funghi.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "ข้าวอาร์โบริโอหรือคาร์นาโรลี 300 กรัม",
                            "เห็ดผสม (พอร์ชินี เครมินี ชิตาเกะ) หั่น 400 กรัม",
                            "น้ำซุปผักหรือไก่ ร้อน 1.5 ลิตร",
                            "หัวหอมเล็กหั่นเต็าซีละเอียด 1 หัว",
                            "กระเทียมสับ 3 กลีบ",
                            "ไวน์ขาวแห้ง 150 มล.",
                            "เนยสด 50 กรัม",
                            "น้ำมันมะกอก 3 ช้อนโต๊ะ",
                            "ชีสพาร์เมซานขูดละเอียด 80 กรัม",
                            "ผักชีฝรั่งสดสับ 2 ช้อนโต๊ะ",
                            "เกลือและพริกไทยดำตามชอบ"
                        ],
        "steps":  [
                      "เคี่ยวน้ำซุปในหม้อบนเตาตลอดกระบวนการทำ น้ำซุปร้อนจำเป็นสำหรับริซอตโต้ที่ถูกต้อง - น้ำซุปเย็นจะหยุดกระบวนการทำ",
                      "ตั้งน้ำมันมะกอก 2 ช้อนโต๊ะในกระทะขนาดใหญ่ไฟแรง ใส่เห็ดหั่นเป็นชั้นเดียว (ทำเป็นชุดๆ ถ้าจำเป็นเพื่อไม่ให้แน่นเกินไป) ทอดโดยไม่ขยับ 3-4 นาที จนเป็นสีทองด้านหนึ่ง พลิกและทอดอีก 2-3 นาที ปรุงรสด้วยเกลือและพริกไทย ตักออกพักไว้ เก็บบางส่วนไว้โรยหน้า",
                      "ในหม้อหนาก้นหนาขนาดใหญ่หรือพานลึก ตั้งน้ำมันมะกอก 1 ช้อนโต๊ะที่เหลือและเนย 25 กรัมไฟกลาง ใส่หัวหอมหั่นเต็าซีละเอียดและต้ม 4-5 นาที คนบ่อยๆ จนนุ่มและใสแต่ไม่เป็นสีน้ำตาล",
                      "ใส่กระเทียมสับและต้ม 30 วินาที จนหอม ใส่ข้าวอาร์โบริโอและคนตลอดเวลา 2-3 นาที จนเม็ดข้าวเคลือบไขมันดีและขอบเริ่มใส ขั้นตอนการคั่วนี้สำคัญมากสำหรับเนื้อสัมผัสที่ถูกต้อง",
                      "เทไวน์ขาวลงไปและคนตลอดเวลาจนถูกดูดซับเกือบหมดโดยข้าว ประมาณ 2 นาที คุณควรได้ยินเสียงซ่าเบาๆ",
                      "เริ่มเติมน้ำซุปร้อนทีละกระบวย (ประมาณ 1/2 ถ้วย) คนบ่อยๆ และรอจนแต่ละครั้งที่เติมถูกดูดซับเกือบหมดก่อนเติมครั้งต่อไป การเติมทีละน้อยและคนตลอดเวลานี้ปลดปล่อยแป้งของข้าว สร้างเนื้อสัมผัสครีมมี่ ข้าวควรถูกปกคลุมด้วยของเหลวแทบจะหมดเสมอ",
                      "หลังจากเติมน้ำซุปประมาณ 15 นาที คนเห็ดที่ทอดไว้ส่วนใหญ่ลงไป (เก็บบางส่วนไว้โรยหน้า) เติมน้ำซุปและคนต่ออีก 5-8 นาที เวลาทำทั้งหมดควรเป็น 20-25 นาทีนับจากเมื่อคุณเติมน้ำซุปครั้งแรก",
                      "ริซอตโต้สุกเมื่อข้าวเป็นอัลเดนเต้ - นุ่มแต่ยังเคี้ยวได้เล็กน้อยตรงกลาง - และความข้นครีมมี่และไหลช้าๆ เมื่อเอียงกระทะ ควรเป็นอัลลอนดา (เหมือนคลื่น) ถ้าน้ำซุปหมดก่อนข้าวสุก ใช้น้ำร้อน",
                      "ยกออกจากไฟ ใส่เนย 25 กรัมที่เหลือและชีสพาร์เมซานขูด คนอย่างแรง 1 นาที - เรียกว่ามันเตคาตูรา และสร้างความครีมมี่พิเศษ ชิมรสและปรุงเพิ่มเติมด้วยเกลือและพริกไทย",
                      "เสิร์ฟทันทีในชามตื้นอุ่น โรยเห็ดที่เก็บไว้ ราดน้ำมันมะกอก โรยผักชีฝรั่งสับ และชีสพาร์เมซานเพิ่ม ริซอตโต้ไม่รอใคร - จะดูดซับของเหลวต่อและจะกลายเป็นข้นและเหนียวถ้าปล่อยทิ้งไว้ ริซอตโต้ที่สมบูรณ์แบบควรครีมมี่ ไหล และหรูหราโดยเม็ดข้าวแต่ละเม็ดแยกจากกันแต่ผูกมัดในซอสกำมะหยี่"
                  ]
    },
    {
        "id":  "tiramisu",
        "title":  "ทิรามิสุ",
        "prep_time":  "30 นาที",
        "cook_time":  "0 นาที",
        "total_time":  "30 นาที (บวกแช่เย็น 4 ชั่วโมง)",
        "image":  "assets/images/cuisines/italian/tiramisu.jpg",
        "categories":  [
                           "dessert"
                       ],
        "ingredients":  [
                            "ไข่แดงไข่ใหญ่ 6 ฟอง",
                            "น้ำตาลทราย 150 กรัม",
                            "ชีสมาสคาร์โปเน อุณหภูมิห้อง 500 กรัม",
                            "วิปปิ้งครีม 300 มล.",
                            "เอสเพรสโซหรือกาแฟเข้มข้น เย็น 300 มล.",
                            "ลิเคียร์กาแฟ (คาห์ลัวหรือมาร์ซาลา) 3 ช้อนโต๊ะ",
                            "คุกกี้เลดี้ฟิงเกอร์ (ซาวอยอาร์ดี) 40-45 ชิ้น",
                            "ผงโกโก้ไม่หวานสำหรับโรยหน้า",
                            "เกล็ดช็อกโกแลตดาร์ก (ถ้าต้องการ)"
                        ],
        "steps":  [
                      "ชงเอสเพรสโซหรือกาแฟเข้มข้นและปล่อยให้เย็นเป็นอุณหภูมิห้อง ผสมกับลิเคียร์กาแฟในจานตื้น พักไว้",
                      "สร้างหม้อต้มน้ำคู่: เติมน้ำในหม้อ 2 นิ้วและตั้งไฟให้เดือดเบาๆ วางชามทนความร้อนด้านบน ให้แน่ใจว่าก้นไม่แตะน้ำ",
                      "ในชาม ตีไข่แดงและน้ำตาลเข้าด้วยกัน วางเหนือน้ำเดือดและตีตลอดเวลา 8-10 นาที จนส่วนผสมข้น เป็นสีเหลืองอ่อน และถึง 70°C (160°F) บนเทอร์โมมิเตอร์ นี่ทำให้ไข่ปลอดเชื้อ ส่วนผสมควรตกเป็นริบบิ้นหนาจากตี ยกออกจากความร้อนและปล่อยให้เย็น 10 นาที ตีเป็นครั้งคราว",
                      "ในชามใหญ่ ตีชีสมาสคาร์โปเนด้วยเครื่องตีมือไฟอ่อน 1 นาที จนเนียนและครีมมี่ อย่าตีมากเกินไปไม่งั้นจะเป็นเม็ด",
                      "ค่อยๆ พับส่วนผสมไข่ที่เย็นแล้วลงในมาสคาร์โปเนเป็นสามครั้ง ใช้พายยางด้วยการพับ พับจนเพิ่งเข้ากันและเนียน",
                      "ในชามสะอาดแยก ตีวิปปิ้งครีมจนเป็นยอดนุ่ม - ควรรักษารูปร่างแต่ยังนุ่มและฟู อย่าตีมากเกินไป",
                      "ค่อยๆ พับวิปครีมลงในส่วนผสมมาสคาร์โปเนเป็นสองครั้ง ใช้มือเบาเพื่อรักษาความโปร่ง ส่วนผสมควรเนียน ครีมมี่ และเหมือนมูส",
                      "จุ่มคุกกี้เลดี้ฟิงเกอร์แต่ละชิ้นลงในส่วนผสมกาแฟอย่างรวดเร็ว - ประมาณ 1 วินาทีต่อด้าน ควรชุ่มแต่ไม่เละ จัดเป็นชั้นเดียวในก้นจาน 9x13 นิ้ว (หรือแก้วแยก)",
                      "ทาครีมมาสคาร์โปเนครึ่งหนึ่งให้ทั่วชั้นเลดี้ฟิงเกอร์ เกลี่ยด้วยพายออฟเซ็ต",
                      "ทำซ้ำด้วยชั้นเลดี้ฟิงเกอร์จุ่มกาแฟอีกชั้นและครีมมาสคาร์โปเนที่เหลือ เกลี่ยหน้า",
                      "ปิดแน่นด้วยพลาสติกห่ออาหารและแช่ตู้เย็นอย่างน้อย 4 ชั่วโมง ดีที่สุดคือข้ามคืน เพื่อให้รสชาติผสมผสานและเนื้อสัมผัสตัวอย่างเหมาะสม",
                      "ก่อนเสิร์ฟ โรยผงโกโก้ไม่หวานให้เยอะๆ โดยใช้ตะแกรงละเอียด สำหรับความหรูหราพิเศษ เพิ่มเกล็ดช็อกโกแลตดาร์กบนหน้า หั่นเป็นสี่เหลี่ยมหรือตักเป็นส่วนๆ ทิรามิสุควรครีมมี่ ชุ่มกาแฟ และสมดุลอย่างสมบูรณ์แบบระหว่างหวานและขม ชื่อแปลว่า \u0027ปลุกฉันขึ้น\u0027 - และมันจะทำแน่นอน!"
                  ]
    },
    {
        "id":  "panna_cotta",
        "title":  "พันนาคอตต้า",
        "prep_time":  "15 นาที",
        "cook_time":  "10 นาที",
        "total_time":  "25 นาที (บวกแช่เย็น 4 ชั่วโมง)",
        "image":  "assets/images/cuisines/italian/panna_cotta.jpg",
        "categories":  [
                           "dessert"
                       ],
        "ingredients":  [
                            "วิปปิ้งครีม 500 มล.",
                            "นมสดไขมันเต็ม 100 มล.",
                            "น้ำตาลทราย 80 กรัม",
                            "ฝักวานิลลา 1 ฝัก (หรือสารสกัดวานิลลา 2 ช้อนชา)",
                            "เจลาตินผง 2.5 ช้อนชา (1 ซอง)",
                            "น้ำเย็น 3 ช้อนโต๊ะ",
                            "สำหรับซอสเบอร์รี่: เบอร์รี่ผสม 200 กรัม",
                            "น้ำตาล 2 ช้อนโต๊ะ",
                            "น้ำมะนาว 1 ช้อนโต๊ะ",
                            "เบอร์รี่สดและใบมิ้นต์สำหรับโรยหน้า"
                        ],
        "steps":  [
                      "ทารามีกิน 6 ใบ (ขนาด 4-6 ออนซ์) หรือแม่พิมพ์เล็กๆ ด้วยน้ำมันที่ไม่มีกลิ่นเบาๆ เช็ดส่วนเกินออกด้วยกระดาษซับมัน - ต้องการเพียงฟิล์มบางๆ เพื่อช่วยในการถอดแม่พิมพ์ภายหลัง",
                      "โรยเจลาตินผงลงบนน้ำเย็น 3 ช้อนโต๊ะในชามเล็ก ปล่อยทิ้งไว้ 5 นาทีให้บูม - จะดูดซับน้ำและกลายเป็นฟองน้ำ อย่าข้ามขั้นตอนนี้ไม่งั้นเจลาตินจะไม่ละลาย",
                      "ในหม้อขนาดกลาง ผสมวิปปิ้งครีม นม และน้ำตาล ผ่าฝักวานิลลาตามยาวและขูดเมล็ดออกด้วยหลังมีด ใส่ทั้งเมล็ดและฝักลงในส่วนผสมครีม (หรือใส่สารสกัดวานิลลาถ้าใช้)",
                      "ตั้งส่วนผสมครีมไฟกลาง คนเป็นครั้งคราว จนเริ่มเดือดรอบขอบและน้ำตาลละลายหมด อย่าให้เดือด ยกออกจากไฟทันที",
                      "เอาฝักวานิลลาออก ใส่เจลาตินที่บูมแล้วลงในส่วนผสมครีมร้อนและตีอย่างแรง 1-2 นาที จนเจลาตินละลายหมด คุณไม่ควรเห็นเม็ด ส่วนผสมควรเนียนและเป็นเนื้อเดียวกัน",
                      "กรองส่วนผสมผ่านตะแกรงละเอียดลงในถ้วยตวงขนาดใหญ่หรือชามที่มีปาก เพื่อเอาเจลาตินที่ไม่ละลายออกและทำให้เนื้อสัมผัสเนียนนุ่มเป็นไหม",
                      "ระมัดระวังเทส่วนผสมลงในรามีกินที่เตรียมไว้ แบ่งเท่าๆ กัน เติมแต่ละใบถึงประมาณ 1/4 นิ้วจากขอบบน ถ้ามีฟองเกิดขึ้นบนผิว ค่อยๆ จิ้มด้วยไม้จิ้มฟันหรือตักออก",
                      "ปล่อยให้พันนาคอตต้าเย็นเป็นอุณหภูมิห้องประมาณ 30 นาที จากนั้นปิดแต่ละใบด้วยพลาสติกห่ออาหารและแช่ตู้เย็นอย่างน้อย 4 ชั่วโมง หรือดีที่สุดคือข้ามคืน จนตัวสนิท ควรสั่นเล็กน้อยเมื่อเขย่าเบาๆ แต่รักษารูปร่าง",
                      "ขณะที่พันนาคอตต้าแช่เย็น ทำซอสเบอร์รี่: ในหม้อเล็ก ผสมเบอร์รี่ผสม น้ำตาล และน้ำมะนาว ต้มไฟกลาง 5-7 นาที คนเป็นครั้งคราว จนเบอร์รี่แตกและออกน้ำ บดเล็กน้อยด้วยส้อมสำหรับซอสหยาบกว่า หรือปั่นเนียนถ้าชอบ ปล่อยให้เย็น แล้วแช่ตู้เย็น",
                      "เพื่อเสิร์ฟ สามารถเสิร์ฟในรามีกินหรือถอดแม่พิมพ์: เพื่อถอดแม่พิมพ์ ใช้มีดบางๆ รอบขอบพันนาคอตต้าแต่ละอัน จุ่มก้นรามีกินในน้ำร้อน 5-10 วินาที วางจานเสิร์ฟด้านบน กลับด้านอย่างรวดเร็ว และเขย่าเบาๆ พันนาคอตต้าควรเลื่อนออกมาอย่างราบรื่น",
                      "ตักซอสเบอร์รี่รอบหรือบนพันนาคอตต้าแต่ละอัน โรยเบอร์รี่สดและใบมิ้นต์เล็กๆ พันนาคอตต้าควรเนียนนุ่มเป็นไหม หวานละมุน และแข็งพอที่จะรักษารูปร่างในขณะที่ยังครีมมี่และหรูหรา ควรสั่นอย่างน่าดึงดูดเมื่อสัมผัส - นั่นคือสัญญาณของเนื้อสัมผัสที่สมบูรณ์แบบ"
                  ]
    }
]
