[
  {
    "id": "chicken_teriyaki",
    "title": "ไก่เทริยากิ",
    "prep_time": "15 นาที",
    "cook_time": "15 นาที",
    "total_time": "30 นาที",
    "image": "assets/images/cuisines/japanese/chicken_teriyaki.jpg",
    "categories": [
      "อาหารจานหลัก"
    ],
    "ingredients": [
      "สะโพกไก่ไม่มีกระดูกและหนัง 4 ชิ้น",
      "ซอสถั่วเหลือง (โชยุ) 3 ช้อนโต๊ะ",
      "มิริน 3 ช้อนโต๊ะ",
      "สาเก 2 ช้อนโต๊ะ",
      "น้ำตาล 2 ช้อนโต๊ะ",
      "น้ำมันพืช 1 ช้อนโต๊ะ",
      "ขิงขูด 1 ช้อนชา",
      "กระเทียมสับ 1 กลีบ",
      "แป้งข้าวโพดผสมน้ำ 2 ช้อนโต๊ะ 1 ช้อนโต๊ะ",
      "งาสำหรับโรยหน้า",
      "ต้นหอมซอย"
    ],
    "steps": [
      "ในชามเล็ก ผสมซอสถั่วเหลือง 3 ช้อนโต๊ะ มิริน 3 ช้อนโต๊ะ สาเก 2 ช้อนโต๊ะ และน้ำตาล 2 ช้อนโต๊ะ คนให้น้ำตาลละลายหมด นี่คือซอสเทริยากิ พักไว้",
      "ตั้งน้ำมันพืช 1 ช้อนโต๊ะในกระทะหรือพานขนาดใหญ่ไฟกลางค่อนข้างแรงจนเป็นริ้ว",
      "วางสะโพกไก่ลงในกระทะ ถ้ามีหนังให้วางด้านหนังลง ทอด 5-6 นาที โดยไม่ขยับ จนด้านล่างเป็นสีทองและหลุดจากกระทะได้ง่าย พลิกแล้วทอดอีกด้าน 5-6 นาที จนเป็นสีทองและอุณหภูมิภายในถึง 75°C (165°F) ตักไก่ออกพักไว้บนจาน",
      "ในกระทะเดิม (ไม่ต้องล้าง - คราบที่ติดกระทะจะเพิ่มรสชาติ) ใส่ขิงขูดและกระเทียมสับ ผัดไฟกลาง 20-30 วินาที จนหอมแต่ยังไม่เปลี่ยนสี",
      "เทซอสเทริยากิที่เตรียมไว้ลงในกระทะ ตั้งไฟให้เดือดเบาๆ คนเพื่อขูดคราบที่ติดก้นกระทะขึ้นมา",
      "ผสมแป้งข้าวโพด 1 ช้อนโต๊ะกับน้ำ 2 ช้อนโต๊ะเพื่อทำน้ำแป้ง ค่อยๆ เติมลงในซอสที่เดือดพร้อมคนตลอดเวลา ต้ม 1-2 นาที จนซอสข้นเป็นเงาเหมือนน้ำเชื่อมและเคลือบหลังช้อนได้",
      "ใส่สะโพกไก่กลับเข้ากระทะ ตักซอสราดบนไก่ซ้ำๆ ประมาณ 1 นาที เพื่อเคลือบทั่วและสร้างเคลือบเงางาม",
      "ตักไก่ใส่จาน ราดซอสที่เหลือลงบนหน้า โรยงาและต้นหอมซอย เสิร์ฟร้อนๆ พร้อมข้าวสวยและผัก ไก่ควรนุ่ม ชุ่มฉ่ำ และเคลือบด้วยซอสหวานเค็มเงางาม"
    ]
  },
  {
    "id": "ramen",
    "title": "ราเมงโชยุ",
    "prep_time": "30 นาที",
    "cook_time": "60 นาที",
    "total_time": "90 นาที",
    "image": "assets/images/cuisines/japanese/ramen.jpg",
    "categories": [
      "ประเภทเส้น",
      "ซุปและแกง"
    ],
    "ingredients": [
      "เส้นราเมงสด 4 ที่",
      "น้ำซุปไก่ 4 ถ้วย",
      "น้ำซุปหมู 2 ถ้วย",
      "ซอสถั่วเหลือง 1/4 ถ้วย",
      "มิริน 2 ช้อนโต๊ะ",
      "สาเก 1 ช้อนโต๊ะ",
      "กระเทียมสับ 2 กลีบ",
      "ขิงหั่น 1 ช้อนโต๊ะ",
      "ไข่ต้มยางมะตูมผ่าครึ่ง 2 ฟอง",
      "หมูชาชูหั่น 200 กรัม",
      "หน่อไม้ 1 ถ้วย",
      "ต้นหอมซอย 2 ต้น",
      "สาหร่ายโนริ",
      "น้ำมันงา"
    ],
    "steps": [
      "ในหม้อใหญ่ ผสมน้ำซุปไก่ 4 ถ้วยและน้ำซุปหมู 2 ถ้วย ใส่กระเทียมสับและขิงหั่น ตั้งไฟแรงให้เดือดปุดๆ",
      "เมื่อเดือดแล้ว ลดไฟเป็นกลางค่อนข้างอ่อน เคี่ยวเบาๆ 30 นาที เพื่อให้กลิ่นหอมซึมลงในน้ำซุปลึกๆ ตักฟองที่ลอยขึ้นมาทิ้ง",
      "กรองน้ำซุปผ่านตะแกรงละเอียดเพื่อเอากระเทียมและขิงออก เทน้ำซุปใสกลับเข้าหม้อ",
      "ใส่ซอสถั่วเหลือง 1/4 ถ้วย มิริน 2 ช้อนโต๊ะ และสาเก 1 ช้อนโต๊ะลงในน้ำซุป คนให้เข้ากัน ชิมรสและปรุงเพิ่มเติมตามต้องการ - น้ำซุปควรมีรสเค็มกลมกล่อมและหวานเล็กน้อย คงไฟอ่อนไว้",
      "ต้มน้ำในหม้อแยกต่างหาก ต้มเส้นราเมงสดตามคำแนะนำบนซอง (ปกติ 2-3 นาทีสำหรับเส้นสด) เส้นควรอัลเดนเต้ - นุ่มแต่ยังเคี้ยวได้เล็กน้อย พักน้ำทันทีและล้างน้ำเย็นเบาๆ เพื่อหยุดการสุก",
      "แบ่งเส้นที่ต้มแล้วใส่ชามเสิร์ฟ 4 ชาม จัดเส้นให้เรียบร้อยตรงกลางชาม",
      "ตักน้ำซุปร้อนๆ ราดลงบนเส้น เติมแต่ละชามประมาณ 3/4 เต็ม น้ำซุปควรร้อนจัดมีไอขึ้น",
      "จัดท็อปปิ้งอย่างสวยงามบนหน้า: วางชิ้นหมูชาชูด้านหนึ่ง ไข่ต้มยางมะตูมผ่าครึ่งอีกด้าน หน่อไม้ ต้นหอมซอย และสาหร่ายโนริ แต่ละชามควรดูสวยงามและสมดุล",
      "ราดน้ำมันงาเบาๆ บนแต่ละชามเพื่อกลิ่นหอม เสิร์ฟทันทีขณะน้ำซุปร้อนจัด แนะนำผู้ทานให้คลุกทุกอย่างเข้าด้วยกันก่อนทาน ราเมงควรซดอย่างมีเสียงดัง!"
    ]
  },
  {
    "id": "sushi_rolls",
    "title": "แคลิฟอร์เนียโรล",
    "prep_time": "40 นาที",
    "cook_time": "20 นาที",
    "total_time": "60 นาที",
    "image": "assets/images/cuisines/japanese/sushi_rolls.jpg",
    "categories": [
      "อาหารทะเล",
      "ของว่าง"
    ],
    "ingredients": [
      "ข้าวญี่ปุ่น 2 ถ้วย",
      "น้ำ 2.5 ถ้วย",
      "น้ำส้มสายชูข้าว 1/4 ถ้วย",
      "น้ำตาล 2 ช้อนโต๊ะ",
      "เกลือ 1 ช้อนชา",
      "สาหร่ายโนริ 4 แผ่น",
      "อะโวคาโดหั่น 1 ลูก",
      "แตงกวาหั่นฝอย 1 ลูก",
      "ปูอัด 200 กรัม",
      "ไข่ปลาโทบิโกะ 2 ช้อนโต๊ะ",
      "ซอสถั่วเหลืองสำหรับเสิร์ฟ",
      "วาซาบิ",
      "ขิงดอง"
    ],
    "steps": [
      "ล้างข้าวญี่ปุ่น 2 ถ้วยในตะแกรงละเอียดด้วยน้ำเย็น ขยี้เบาๆ จนน้ำใส (ประมาณ 5-7 ครั้ง) เพื่อเอาแป้งส่วนเกินออก ผสมข้าวที่ล้างแล้วกับน้ำ 2.5 ถ้วยในหม้อหุงข้าวหรือหม้อ หุงตามคำแนะนำหม้อหุงข้าว หรือต้มให้เดือดแล้วลดไฟอ่อน ปิดฝาและเคี่ยว 15 นาที เมื่อสุกแล้วปิดไฟและพักไว้ปิดฝา 10 นาที",
      "ขณะหุงข้าว เตรียมน้ำส้มสำหรับซูชิ: ในชามเล็ก ผสมน้ำส้มสายชูข้าว 1/4 ถ้วย น้ำตาล 2 ช้อนโต๊ะ และเกลือ 1 ช้อนชา คนจนน้ำตาลและเกลือละลายหมด อุ่นเบาๆ ช่วยให้ละลาย แต่อย่าให้เดือด",
      "ตักข้าวร้อนใส่ชามกว้างขนาดใหญ่ (แบบดั้งเดิมใช้ฮังงิริไม้) ราดน้ำส้มทั่วข้าว ใช้พายข้าวหรือช้อนไม้ พับน้ำส้มเข้ากับข้าวด้วยการตัด - อย่าคนหรือบด พัดข้าวไปด้วยขณะพับเพื่อให้เย็นเร็วและเงางาม ทำต่อจนข้าวเย็นเป็นอุณหภูมิห้อง",
      "วางสาหร่ายโนริด้านมันลงบนเสื่อไม้ไผ่ (มากิสุ) เปียกมือแล้วปูข้าวประมาณ 3/4 ถ้วยให้ทั่วสาหร่าย เว้นขอบด้านบน 1 นิ้ว กดเบาๆ แต่อย่ากดแน่นเกินไป",
      "พลิกแผ่นสาหร่ายอย่างระมัดระวังให้ข้าวอยู่ด้านล่างแตะเสื่อ นี่คือสไตล์อุระมากิ (ม้วนกลับด้าน)",
      "เรียงแถบปูอัด อะโวคาโดหั่น และแตงกวาหั่นฝอยเป็นแนวตรงกลางสาหร่าย",
      "ใช้เสื่อไม้ไผ่ ยกขอบที่ใกล้ตัวขึ้นม้วนทับไส้ กดแน่น ม้วนต่อออกจากตัว ใช้เสื่อช่วยให้ม้วนแน่นและเรียบ บีบเบาๆ แต่แน่นขณะม้วน ถอดเสื่อออก",
      "โรยไข่ปลาโทบิโกะ (ไข่ปลาบิน) ด้านนอกของม้วน กดเบาๆ ให้ติดกับข้าว",
      "ใช้มีดคมจุ่มน้ำ (เช็ดและจุ่มน้ำใหม่ระหว่างหั่น) หั่นม้วนเป็น 8 ชิ้นเท่าๆ กัน หั่นด้วยการเลื่อนเบาๆ เพื่อไม่ให้ม้วนแบน",
      "จัดชิ้นซูชิบนจาน เสิร์ฟพร้อมจานเล็กใส่ซอสถั่วเหลือง วาซาบิเล็กน้อย และขิงดองข้างจาน วิธีทาน: จุ่มด้านปลา (ไม่ใช่ข้าว) ลงในซอสถั่วเหลืองผสมวาซาบิเล็กน้อย"
    ]
  },
  {
    "id": "tempura",
    "title": "เท็มปุระรวมมิตร",
    "prep_time": "20 นาที",
    "cook_time": "15 นาที",
    "total_time": "35 นาที",
    "image": "assets/images/cuisines/japanese/tempura.jpg",
    "categories": [
      "ของว่าง"
    ],
    "ingredients": [
      "กุ้งตัวใหญ่ปอกเปลือกเหลือหาง 8 ตัว",
      "มันเทศหั่นบาง 1 หัว",
      "ซูกินีหั่น 1 ลูก",
      "เห็ดชิตาเกะ 8 ดอก",
      "แป้งอเนกประสงค์ 1 ถ้วย",
      "ไข่แดง 1 ฟอง",
      "น้ำเย็นจัด 1 ถ้วย",
      "น้ำมันสำหรับทอด",
      "น้ำซุปดาชิ 1/2 ถ้วย",
      "ซอสถั่วเหลือง 2 ช้อนโต๊ะ",
      "มิริน 2 ช้อนโต๊ะ",
      "หัวไชเท้าขูด",
      "ขิงขูด"
    ],
    "steps": [
      "เตรียมซอสจิ้มก่อน: ในหม้อเล็ก ผสมน้ำซุปดาชิ 1/2 ถ้วย ซอสถั่วเหลือง 2 ช้อนโต๊ะ และมิริน 2 ช้อนโต๊ะ ตั้งไฟให้เดือดเบา 2 นาที ปิดไฟและพักไว้ให้เย็นเล็กน้อย นี่คือซอสเท็นสึยุ",
      "ตั้งน้ำมันสำหรับทอดในกระทะหรือหม้อลึกให้ร้อนพอดี 180°C (350°F) ใช้เทอร์โมมิเตอร์วัดให้แม่นยำ - อุณหภูมินี้สำคัญมากสำหรับเท็มปุระที่เบาและกรอบ น้ำมันควรลึกอย่างน้อย 3 นิ้ว",
      "เตรียมแป้งเท็มปุระก่อนทอดเท่านั้น (ห้ามเตรียมล่วงหน้า): ในชาม ตีไข่แดง 1 ฟองเบาๆ กับน้ำเย็นจัด 1 ถ้วย น้ำต้องเย็นมาก - ใส่น้ำแข็งถ้าจำเป็น",
      "ใส่แป้งอเนกประสงค์ 1 ถ้วยลงในส่วนผสมไข่ ใช้ตะเกียบหรือส้อมคนเบามากๆ เพียง 10-12 ครั้ง แป้งควรเป็นก้อนและมีแป้งเห็นชัดเจน การคนมากเกินไปจะทำให้เท็มปุระหนักและมัน ก้อนแป้งบ้างไม่เป็นไร",
      "เช็ดผักให้แห้งสนิทด้วยกระดาษซับมัน จุ่มมันเทศหั่นบาง ซูกินี และเห็ดชิตาเกะทีละชิ้นลงในแป้ง ให้แป้งส่วนเกินหยดออก ค่อยๆ เลื่อนลงในน้ำมันร้อน ทอด 2-3 นาที จนเป็นสีทองอ่อนและกรอบ อย่าใส่มากเกินไป - ทอดเป็นชุดๆ ตักด้วยตะหลิวหรือตะแกรงพักน้ำมัน",
      "สำหรับกุ้ง จับที่หาง จุ่มลงในแป้ง (ปล่อยหางไม่ต้องเคลือบ) แล้วค่อยๆ ลงในน้ำมัน ทอด 2-3 นาที จนแป้งเป็นสีทองอ่อนและกรอบ กุ้งควรเป็นสีชมพูและสุกพอดี",
      "เมื่อทอดเสร็จแต่ละชิ้น ตักขึ้นพักบนตะแกรงหรือกระดาษซับมัน วางเป็นชั้นเดียว - อย่าซ้อนไม่งั้นจะไม่กรอบ",
      "เสิร์ฟเท็มปุระทันทีขณะยังร้อนและกรอบ จัดบนจานพร้อมซอสจิ้มในชามเล็ก เสิร์ฟหัวไชเท้าขูดและขิงขูดข้างจาน - ผู้ทานสามารถเติมลงในซอสจิ้มเพื่อรสชาติเพิ่มเติม เท็มปุระอร่อยที่สุดเมื่อทานภายในไม่กี่นาทีหลังทอด"
    ]
  },
  {
    "id": "tonkatsu",
    "title": "ทงคัตสึ (หมูทอดกรอบ)",
    "prep_time": "20 นาที",
    "cook_time": "15 นาที",
    "total_time": "35 นาที",
    "image": "assets/images/cuisines/japanese/tonkatsu.jpg",
    "categories": [
      "อาหารจานหลัก"
    ],
    "ingredients": [
      "สันนอกหมูหนา 1 นิ้ว 4 ชิ้น",
      "เกลือและพริกไทยตามชอบ",
      "แป้งอเนกประสงค์ 1/2 ถ้วย",
      "ไข่ตี 2 ฟอง",
      "ขนมปังปังโกะ 2 ถ้วย",
      "น้ำมันสำหรับทอด",
      "ซอสทงคัตสึ 1/2 ถ้วย",
      "กะหล่ำปลีฝอย 1/4 หัว",
      "มะนาวหั่น 1 ลูก",
      "ข้าวสวย"
    ],
    "steps": [
      "วางชิ้นสันนอกหมูแต่ละชิ้นระหว่างพลาสติกห่ออาหาร 2 แผ่น ใช้ค้อนตีเนื้อหรือไม้นวดตีเบาๆ ให้มีความหนาสม่ำเสมอประมาณ 3/4 นิ้ว เพื่อให้สุกทั่วกัน ปรุงรสทั้งสองด้านด้วยเกลือและพริกไทยดำบดสด",
      "ใช้มีดคม ตัดขอบที่มีไขมันติดเนื้อ 4-5 แห่ง ลึกประมาณ 1/4 นิ้ว เพื่อป้องกันไม่ให้หมูม้วนตัวขณะทอด",
      "จัดสถานีคลุกแป้ง 3 จาน: จานหนึ่งใส่แป้งอเนกประสงค์ 1/2 ถ้วย จานหนึ่งใส่ไข่ตี 2 ฟอง และจานหนึ่งใส่ขนมปังปังโกะ 2 ถ้วย คลุกหมูแต่ละชิ้นในแป้งก่อน (สะบัดส่วนเกินออก) จากนั้นจุ่มในไข่ตี (ให้ไข่ส่วนเกินหยดออก) และสุดท้ายกดลงในปังโกะให้เคลือบทั้งสองด้านสนิท กดปังโกะให้ติดดี",
      "ตั้งน้ำมันสำหรับทอดในกระทะลึกขนาดใหญ่ให้ร้อน 170°C (340°F) น้ำมันควรลึกประมาณ 2 นิ้ว อุณหภูมิที่ต่ำกว่าเล็กน้อยนี้ทำให้หมูสุกทั่วโดยไม่ไหม้",
      "ค่อยๆ ลดหมูคลุกแป้งลงในน้ำมันร้อน ทอด 6-7 นาที พลิกครั้งเดียวตรงกลาง จนเคลือบเป็นสีทองเข้มและกรอบ อุณหภูมิภายในควรถึง 63°C (145°F) อย่าใส่มากเกินไป - ทอดเป็นชุดๆ ถ้าจำเป็น",
      "ตักทงคัตสึออกจากน้ำมันวางบนตะแกรงตั้งเหนือกระดาษซับมัน พัก 3 นาที เวลาพักนี้ทำให้น้ำเนื้อกระจายตัวและเคลือบแข็งตัว ทำให้กรอบพิเศษ",
      "ย้ายไปยังเขียง ใช้มีดคมหั่นทงคัตสึแต่ละชิ้นเป็นแถบกว้าง 3/4 นิ้ว เพื่อให้ทานง่ายด้วยตะเกียบ",
      "จัดทงคัตสึหั่นแล้วบนจานพร้อมกองกะหล่ำปลีฝอยเยอะๆ ข้างจาน ราดซอสทงคัตสึลงบนหมูหรือเสิร์ฟในจานเล็กสำหรับจิ้ม เพิ่มมะนาวหั่นและข้าวสวย บีบมะนาวลงบนทงคัตสึก่อนทานเพื่อรสสดชื่น หมูควรชุ่มฉ่ำด้านในพร้อมเคลือบกรอบสีทองอย่างเหลือเชื่อ"
    ]
  }
]
