[
  {
    "id": "bibimbap",
    "title": "บิบิมบับ (ข้าวยำเกาหลี)",
    "prep_time": "30 นาที",
    "cook_time": "20 นาที",
    "total_time": "50 นาที",
    "image": "assets/images/cuisines/korean/bibimbap.jpg",
    "categories": [
      "อาหารจานหลัก"
    ],
    "ingredients": [
      "ข้าวสวย 2 ถ้วย",
      "เนื้อวัวสันในหั่นบาง 200 กรัม",
      "ผักโขมลวก 1 ถ้วย",
      "ถั่วงอกลวก 1 ถ้วย",
      "แครอทหั่นฝอย 1 ลูก",
      "ซูกินีหั่นฝอย 1 ลูก",
      "เห็ดชิตาเกะหั่น 4 ดอก",
      "ไข่ดาว 2 ฟอง",
      "โกชูจัง (พริกเกาหลี) 2 ช้อนโต๊ะ",
      "ซอสถั่วเหลือง 2 ช้อนโต๊ะ",
      "น้ำมันงา 1 ช้อนโต๊ะ",
      "กระเทียมสับ 2 กลีบ",
      "น้ำตาล 1 ช้อนโต๊ะ",
      "งาคั่ว",
      "น้ำมันพืชสำหรับผัด"
    ],
    "steps": [
      "ในชาม ผสมเนื้อวัวหั่นบางกับซอสถั่วเหลือง 1 ช้อนโต๊ะ น้ำมันงา 1 ช้อนชา และกระเทียมสับ คลุกให้ทั่ว หมักไว้ 15 นาทีที่อุณหภูมิห้องเพื่อเพิ่มรสชาติและทำให้เนื้อนุ่ม",
      "เตรียมผักแต่ละอย่างแยกกันเพื่อรสชาติและเนื้อสัมผัสที่ดีที่สุด: ตั้งน้ำมันเล็กน้อยในกระทะไฟกลางค่อนข้างแรง ผัดผักโขมกับเกลือเล็กน้อย 1-2 นาที จนเหี่ยว ตักออกและบีบน้ำออก ปรุงรสด้วยน้ำมันงาเล็กน้อย ทำซ้ำขั้นตอนนี้แยกกันสำหรับถั่วงอก แครอทหั่นฝอย ซูกินีหั่นฝอย และเห็ดชิตาเกะหั่น พักแต่ละอย่างไว้เป็นกองแยก",
      "ในกระทะเดิม เติมน้ำมันเล็กน้อย ผัดเนื้อที่หมักไว้ไฟแรง 3-4 นาที จนสุกทั่วและคาราเมลไลซ์เล็กน้อย พักไว้",
      "แบ่งข้าวสวยร้อนใส่ชาม 4 ชาม เติมแต่ละชามประมาณครึ่งชาม",
      "จัดผักที่ผัดแล้วและเนื้อวัวอย่างสวยงามบนข้าวเป็นส่วนๆ สร้างลวดลายวงล้อสีสัน ส่วนผสมแต่ละอย่างควรมองเห็นและแยกจากกันชัดเจน",
      "วางไข่ดาวตรงกลางแต่ละชาม ไข่แดงควรยังไหล",
      "เตรียมซอสบิบิมบับ: ผสมโกชูจัง 2 ช้อนโต๊ะกับซอสถั่วเหลือง น้ำมันงา และน้ำตาลที่เหลือ คนจนเนียนและเข้ากันดี",
      "เสิร์ฟแต่ละชามพร้อมซอสข้างๆ และโรยงาคั่วบนหน้า เสิร์ฟซอสในจานเล็กเพื่อให้ผู้ทานเติมได้ตามชอบ",
      "ก่อนทาน แนะนำผู้ทานให้คลุกทุกอย่างเข้าด้วยกันอย่างแรง ทำลายไข่แดงและผสมส่วนผสมทั้งหมดกับซอส ข้าวควรเคลือบซอสเผ็ดหวานทั่ว บิบิมบับแปลว่า 'ข้าวผสม' - การผสมคือสิ่งสำคัญ!"
    ]
  },
  {
    "id": "bulgogi",
    "title": "บูลโกกิ (เนื้อย่างเกาหลี)",
    "prep_time": "20 นาที",
    "cook_time": "10 นาที",
    "total_time": "30 นาที",
    "image": "assets/images/cuisines/korean/bulgogi.jpg",
    "categories": [
      "อาหารจานหลัก"
    ],
    "ingredients": [
      "เนื้อวัวริบอายหั่นบาง 600 กรัม",
      "ซอสถั่วเหลือง 1/4 ถ้วย",
      "น้ำตาล 2 ช้อนโต๊ะ",
      "น้ำมันงา 2 ช้อนโต๊ะ",
      "กระเทียมสับ 4 กลีบ",
      "ขิงขูด 1 ช้อนโต๊ะ",
      "ลูกแพร์ขูด 1/2 ลูก",
      "ต้นหอมซอย 1/4 ถ้วย",
      "มิริน 2 ช้อนโต๊ะ",
      "งาคั่ว 1 ช้อนโต๊ะ",
      "พริกไทยดำ 1/4 ช้อนชา",
      "หัวหอมใหญ่หั่น 1 หัว",
      "ผักสลัดสำหรับห่อ"
    ],
    "steps": [
      "เตรียมน้ำหมักบูลโกกิ: ในชามใหญ่ ผสมซอสถั่วเหลือง 1/4 ถ้วย น้ำตาล 2 ช้อนโต๊ะ น้ำมันงา 2 ช้อนโต๊ะ กระเทียมสับ 4 กลีบ ขิงขูด 1 ช้อนโต๊ะ ลูกแพร์ขูด 1/2 ลูก ต้นหอมซอย 1/4 ถ้วย มิริน 2 ช้อนโต๊ะ และพริกไทยดำ 1/4 ช้อนชา ตีทุกอย่างเข้าด้วยกันจนน้ำตาลละลายและน้ำหมักเข้ากันดี ลูกแพร์มีเอนไซม์ที่ช่วยทำให้เนื้อนุ่ม",
      "ใส่เนื้อวัวริบอายหั่นบางลงในน้ำหมัก ใช้มือนวดน้ำหมักเข้ากับเนื้อ ให้แน่ใจว่าทุกชิ้นเคลือบทั่ว ปิดชามด้วยพลาสติกห่ออาหาร",
      "แช่ตู้เย็นและหมักอย่างน้อย 2 ชั่วโมง แต่ดีที่สุดคือข้ามคืน (สูงสุด 24 ชั่วโมง) เวลาหมักที่นานขึ้นทำให้รสชาติซึมลึกและเนื้อนุ่มอย่างเหลือเชื่อ คนหนึ่งหรือสองครั้งระหว่างหมัก",
      "เมื่อพร้อมทำ ตั้งกระทะย่างหรือกระทะขนาดใหญ่ไฟแรงจนร้อนมาก - คุณควรเห็นควันบางๆ ขึ้น อย่าใส่น้ำมัน น้ำหมักมีน้ำมันพอแล้ว",
      "ใส่หัวหอมหั่นลงในกระทะร้อน ผัด 2-3 นาที คนเป็นครั้งคราว จนนุ่มเล็กน้อยและเริ่มคาราเมลไลซ์ที่ขอบ",
      "ใส่เนื้อที่หมักไว้ลงในกระทะเป็นชั้นเดียว (ทำเป็นชุดๆ ถ้าจำเป็น - อย่าใส่มากเกินไป) ผัด 3-4 นาที พลิกและคนบ่อยๆ จนเนื้อสุกทั่วและคาราเมลไลซ์ น้ำตาลในน้ำหมักควรสร้างเคลือบเงางาม เนื้อควรมีขอบไหม้เล็กน้อย",
      "โรยงาคั่วลงบนบูลโกกิที่ทำเสร็จแล้วและคลุกอีกครั้งสุดท้าย",
      "ตักใส่จานเสิร์ฟ เสิร์ฟร้อนๆ พร้อมผักสลัด ข้าวสวย และกิมจิข้างๆ ซัมจัง (ซอสจิ้มเกาหลี) ก็เป็นเครื่องเคียงที่ดี",
      "วิธีทานแบบเกาหลี: หยิบใบผักสลัด วางข้าวช้อนหนึ่งลงไป เพิ่มบูลโกกิบ้าง ซัมจังเล็กน้อยถ้าต้องการ แล้วห่อเป็นห่อเล็กๆ ใส่ทั้งอันเข้าปาก - เรียกว่าซัม!"
    ]
  },
  {
    "id": "kimchi_jjigae",
    "title": "คิมจิจิแก (แกงกิมจิ)",
    "prep_time": "10 นาที",
    "cook_time": "25 นาที",
    "total_time": "35 นาที",
    "image": "assets/images/cuisines/korean/kimchi_jjigae.jpg",
    "categories": [
      "ซุปและแกง"
    ],
    "ingredients": [
      "กิมจิสับ 2 ถ้วย",
      "หมูสามชั้นหั่น 200 กรัม",
      "เต้าหู้แข็งหั่นชิ้น 1 แผ่น",
      "หัวหอมใหญ่หั่น 1/2 หัว",
      "ต้นหอมซอย 2 ต้น",
      "กระเทียมสับ 2 กลีบ",
      "โกชูการู (พริกป่นเกาหลี) 1 ช้อนโต๊ะ",
      "โกชูจัง 1 ช้อนโต๊ะ",
      "ซอสถั่วเหลือง 1 ช้อนโต๊ะ",
      "น้ำตาล 1 ช้อนชา",
      "น้ำหรือน้ำซุปปลา 3 ถ้วย",
      "น้ำมันพืช 1 ช้อนโต๊ะ",
      "น้ำมันงา 1 ช้อนชา"
    ],
    "steps": [
      "ตั้งน้ำมันพืช 1 ช้อนโต๊ะในหม้อใหญ่หรือหม้อดินเกาหลี (ตุกแบกี) ไฟกลางค่อนข้างแรง ใส่หมูสามชั้นหั่นลงไป ผัด 4-5 นาที จนหมูเป็นสีน้ำตาลและไขมันออกมาบ้าง หมูควรกรอบเล็กน้อยที่ขอบ",
      "ใส่กระเทียมสับและหัวหอมใหญ่หั่นลงในหม้อ ผัด 1-2 นาที จนกระเทียมหอมและหัวหอมเริ่มนุ่ม",
      "ใส่กิมจิสับลงในหม้อ ผัดทุกอย่างเข้าด้วยกัน 3-4 นาที ขั้นตอนนี้สำคัญมาก - การผัดกิมจิทำให้รสชาติลึกซับซ้อนออกมาและลดความเปรี้ยวดิบๆ",
      "ใส่โกชูการู (พริกป่นเกาหลี) 1 ช้อนโต๊ะและโกชูจัง 1 ช้อนโต๊ะ คนให้กิมจิและหมูเคลือบพริกแกงทั่ว ผัดต่ออีก 1 นาที จนหอมมาก",
      "เทน้ำหรือน้ำซุปปลา 3 ถ้วยลงไป (น้ำซุปปลาเพิ่มความลึกมากกว่า) คนทุกอย่างเข้าด้วยกันและตั้งไฟให้เดือดปุดๆ",
      "เมื่อเดือดแล้ว ใส่ซอสถั่วเหลือง 1 ช้อนโต๊ะและน้ำตาล 1 ช้อนชา คนให้ละลาย ลดไฟเป็นกลางค่อนข้างอ่อน เคี่ยวโดยไม่ปิดฝา 15 นาที รสชาติจะผสมผสานกันและน้ำซุปจะมีรสเผ็ดเข้มข้น",
      "ค่อยๆ ใส่เต้าหู้แข็งหั่นชิ้นลงในแกง พยายามอย่าทำให้เต้าหู้แตก เคี่ยวต่ออีก 5 นาที เพื่อให้เต้าหู้ร้อนทั่วและซึมรสแกง",
      "ใส่ต้นหอมซอยและราดน้ำมันงา 1 ช้อนชา คนเบาๆ และปิดไฟ",
      "เสิร์ฟคิมจิจิแกร้อนๆ ฟูๆ ในหม้อหรือตักใส่ชามแยก เสิร์ฟพร้อมข้าวสวยและเครื่องเคียงเพิ่มเติม (บันชัน) แกงควรเผ็ด เปรี้ยว และเข้มข้นลึกซึ้ง อร่อยยิ่งขึ้นในวันถัดไป!"
    ]
  },
  {
    "id": "tteokbokki",
    "title": "ต๊อกบ๊อกกี (เค้กข้าวเกาหลีผัดเผ็ด)",
    "prep_time": "10 นาที",
    "cook_time": "15 นาที",
    "total_time": "25 นาที",
    "image": "assets/images/cuisines/korean/tteokbokki.jpg",
    "categories": [
      "ของว่าง"
    ],
    "ingredients": [
      "เค้กข้าวเกาหลี (ต๊อก) 400 กรัม",
      "น้ำ 2 ถ้วย",
      "โกชูจัง 4 ช้อนโต๊ะ",
      "โกชูการู 1 ช้อนโต๊ะ",
      "น้ำตาล 2 ช้อนโต๊ะ",
      "ซอสถั่วเหลือง 1 ช้อนโต๊ะ",
      "กระเทียมสับ 2 กลีบ",
      "หัวหอมใหญ่หั่น 1/2 หัว",
      "ต้นหอมหั่น 2 นิ้ว 2 ต้น",
      "ปลาอัดหั่น 100 กรัม",
      "ไข่ต้มผ่าครึ่ง 2 ฟอง",
      "งาคั่ว 1 ช้อนโต๊ะ",
      "น้ำมันงา 1 ช้อนชา"
    ],
    "steps": [
      "ถ้าใช้เค้กข้าวแช่แข็ง แช่ในน้ำอุ่น 10 นาทีให้นุ่ม ถ้าใช้เค้กข้าวสดสามารถใช้ได้เลย พักน้ำให้ดีก่อนใช้",
      "ในกระทะกว้างขนาดใหญ่หรือพาน ผสมน้ำ 2 ถ้วย โกชูจัง 4 ช้อนโต๊ะ โกชูการู 1 ช้อนโต๊ะ น้ำตาล 2 ช้อนโต๊ะ ซอสถั่วเหลือง 1 ช้อนโต๊ะ และกระเทียมสับ 2 กลีบ ตีทุกอย่างเข้าด้วยกันจนโกชูจังละลายหมดและซอสเนียน",
      "ตั้งกระทะไฟกลางค่อนข้างแรงและตั้งซอสให้เดือดปุดๆ ซอสควรเดือดอย่างแรง",
      "ใส่หัวหอมหั่นและเค้กข้าวที่พักน้ำแล้วลงในซอสเดือด คนให้ทุกอย่างเคลือบทั่ว ต้ม 8-10 นาที คนเป็นครั้งคราวเพื่อไม่ให้ติดก้น เค้กข้าวจะนุ่มและเหนียวนุ่ม และซอสจะงวดและข้น",
      "ใส่ปลาอัดหั่นลงในกระทะ คนให้เข้ากันและต้มต่ออีก 3 นาที จนร้อนทั่ว ปลาอัดจะซึมซอสเผ็ดบ้าง",
      "ซอสควรข้นพอที่จะเคลือบเค้กข้าวด้วยเคลือบเงาเหนียว ถ้าบางเกินไป ต้มต่ออีก 1-2 นาที ถ้าข้นเกินไป เติมน้ำเล็กน้อย",
      "ใส่ต้นหอมหั่น 2 นิ้วและราดน้ำมันงา 1 ช้อนชา คนทุกอย่างเข้าด้วยกันและต้มต่ออีกแค่ 30 วินาที",
      "ตักใส่จานหรือชามตื้น วางไข่ต้มผ่าครึ่งบนหน้าและโรยงาคั่วให้เยอะๆ",
      "เสิร์ฟร้อนๆ เป็นของว่างอาหารริมทางเกาหลียอดนิยมหรือเป็นมื้ออาหาร ต๊อกบ๊อกกีควรเผ็ด หวาน และเหนียวนุ่ม อร่อยที่สุดเมื่อยังร้อนและเค้กข้าวนุ่ม ระวัง - ติดใจมาก!"
    ]
  },
  {
    "id": "japchae",
    "title": "จับแช (เส้นวุ้นผัดเกาหลี)",
    "prep_time": "25 นาที",
    "cook_time": "20 นาที",
    "total_time": "45 นาที",
    "image": "assets/images/cuisines/korean/japchae.jpg",
    "categories": [
      "ประเภทเส้น",
      "ของว่าง"
    ],
    "ingredients": [
      "เส้นวุ้นมันเทศ (ดังเมียน) 200 กรัม",
      "เนื้อวัวสันในหั่นบาง 200 กรัม",
      "แครอทหั่นฝอย 1 ลูก",
      "หัวหอมใหญ่หั่นบาง 1 หัว",
      "เห็ดชิตาเกะหั่น 5 ดอก",
      "ผักโขม 2 ถ้วย",
      "พริกหยวกหั่นฝอย 1 เม็ด",
      "ซอสถั่วเหลือง 3 ช้อนโต๊ะ",
      "น้ำตาล 2 ช้อนโต๊ะ",
      "น้ำมันงา 2 ช้อนโต๊ะ",
      "กระเทียมสับ 2 กลีบ",
      "น้ำมันพืช 2 ช้อนโต๊ะ",
      "งาคั่ว",
      "เกลือและพริกไทย"
    ],
    "steps": [
      "ต้มน้ำในหม้อใหญ่ให้เดือด ใส่เส้นวุ้นมันเทศ (ดังเมียน) ต้มตามคำแนะนำบนซอง (ปกติ 6-7 นาที) เส้นควรใสและเหนียวนุ่มแต่ไม่เละ พักน้ำให้ดีและล้างน้ำเย็น ใช้กรรไกรครัวตัดเส้นให้สั้นลง ใช้งานง่ายขึ้น (ประมาณ 6-8 นิ้ว) พักไว้",
      "เตรียมน้ำหมักเนื้อ: ในชาม ผสมเนื้อวัวหั่นบางกับซอสถั่วเหลือง 1 ช้อนโต๊ะ น้ำมันงา 1 ช้อนชา และกระเทียมสับครึ่งหนึ่ง หมักไว้ 10-15 นาที",
      "ตั้งน้ำมันพืช 1 ช้อนโต๊ะในกระทะหรือพานขนาดใหญ่ไฟแรง ใส่เนื้อที่หมักไว้ลงไป ผัด 2-3 นาที จนสุกทั่วและคาราเมลไลซ์เล็กน้อย ตักออกจากกระทะและพักไว้",
      "ต้มน้ำในหม้อให้เดือด ลวกผักโขม 30-40 วินาที จนเพิ่งเหี่ยว พักน้ำทันทีและล้างน้ำเย็นเพื่อหยุดการสุกและรักษาสีเขียว บีบน้ำออกให้มากที่สุด ปรุงรสผักโขมด้วยเกลือเล็กน้อยและน้ำมันงาไม่กี่หยด พักไว้",
      "ใช้กระทะขนาดใหญ่เดิม ผัดผักแต่ละอย่างแยกกันด้วยน้ำมันเล็กน้อยไฟแรง: แครอทหั่นฝอย (2 นาที) หัวหอมหั่น (2 นาที) เห็ดชิตาเกะหั่น (2-3 นาที) และพริกหยวกหั่นฝอย (1-2 นาที) แต่ละอย่างควรสุกแต่ยังกรอบเล็กน้อย ปรุงรสแต่ละอย่างเบาๆ ด้วยเกลือ พักแต่ละอย่างแยกกัน",
      "ในกระทะหรือพานขนาดใหญ่มาก (หรือใช้ชามใหญ่ที่สุดที่มี) ผสมเส้นวุ้นที่ต้มแล้ว เนื้อวัวผัด และผักทั้งหมดที่ผัดแล้วรวมทั้งผักโขมปรุงรส",
      "ใส่ซอสถั่วเหลือง 2 ช้อนโต๊ะที่เหลือ น้ำตาล 2 ช้อนโต๊ะ และน้ำมันงาที่เหลือลงในส่วนผสมเส้น ใช้คีบหรือมือ (ถ้าเย็นพอ) คลุกและผสมทุกอย่างเข้าด้วยกันอย่างทั่วถึง 2-3 นาที ต้องแน่ใจว่าเครื่องปรุงกระจายทั่วทุกส่วน",
      "ถ้ากระทะใหญ่พอ สามารถอุ่นทุกอย่างเข้าด้วยกันไฟกลาง 2-3 นาที ขณะคลุก เพื่อให้อุ่นทั่วและรสชาติผสมผสาน หรือเสิร์ฟที่อุณหภูมิห้อง - จับแชอร่อยทั้งสองแบบ",
      "ตักใส่จานเสิร์ฟขนาดใหญ่ โรยงาคั่วให้เยอะๆ จับแชสามารถเสิร์ฟอุ่นหรือที่อุณหภูมิห้อง เป็นอาหารยอดนิยมสำหรับงานฉลองและการชุมนุม เส้นควรเงางาม มีรสหวานเค็มเล็กน้อย และส่วนผสมแต่ละอย่างควรแยกจากกันแต่กลมกลืน"
    ]
  }
]
