[
    {
        "id":  "paella",
        "title":  "ปาเอญา บาเลนเซีย",
        "prep_time":  "20 นาที",
        "cook_time":  "40 นาที",
        "total_time":  "60 นาที",
        "image":  "assets/images/cuisines/spanish/paella.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "ข้าวบอมบาหรือข้าวเมล็ดสั้น 2 ถ้วย",
                            "เนื้อสะโพกไก่หั่นชิ้น 500 กรัม",
                            "เนื้อกระต่ายหั่นชิ้น 300 กรัม (ถ้าต้องการ)",
                            "ถั่วเขียวตัดปลาย 200 กรัม",
                            "ถั่วลิมาหรือถั่วเนย 1 ถ้วย",
                            "น้ำซุปไก่ 4 ถ้วย",
                            "เกสรหญ้าฝรั่น 1 ช้อนชา",
                            "มะเขือเทศสุกขูด 3 ลูก",
                            "กระเทียมสับ 4 กลีบ",
                            "ผงพริกหวาน 1 ช้อนชา",
                            "ผงพริกรมควัน 1/2 ช้อนชา",
                            "น้ำมันมะกอก 4 ช้อนโต๊ะ",
                            "กิ่งโรสแมรี่สด",
                            "เกลือตามชอบ",
                            "มะนาวหั่นสำหรับเสิร์ฟ"
                        ],
        "steps":  [
                      "แช่เกสรหญ้าฝรั่นในน้ำซุปอุ่น 1/4 ถ้วย 10 นาที เพื่อปล่อยสีและกลิ่น พักไว้",
                      "ตั้งน้ำมันมะกอกในกระทะปาเอญาขนาดใหญ่ (หรือกระทะกว้างตื้น) ไฟกลางค่อนข้างแรง ปรุงรสไก่และกระต่ายด้วยเกลือ ทอด 5-6 นาที จนเป็นสีทองทุกด้าน ตักออกพักไว้",
                      "ในกระทะเดิม ใส่ถั่วเขียวและถั่วลิมา ผัด 3-4 นาที จนนุ่มเล็กน้อย ตักออกพักไว้กับเนื้อ",
                      "ใส่กระเทียมสับลงในกระทะและผัด 30 วินาที จนหอม ใส่มะเขือเทศขูด ผงพริกหวาน และผงพริกรมควัน ต้ม 5 นาที คนบ่อยๆ จนส่วนผสมข้นและเข้มสีขึ้น",
                      "ใส่เนื้อกลับเข้ากระทะ ใส่ข้าวและคน 2 นาที เพื่อเคลือบเม็ดข้าวแต่ละเม็ดด้วยส่วนผสมมะเขือเทศและน้ำมัน ขั้นตอนการคั่วนี้สำคัญมากสำหรับเนื้อสัมผัสที่ถูกต้อง",
                      "เทน้ำซุปไก่ร้อนและหญ้าฝรั่นพร้อมน้ำแช่ลงไป ใส่กิ่งโรสแมรี่ คนครั้งเดียวเพื่อกระจายทุกอย่างให้เท่ากัน แล้วอย่าคนอีก - สำคัญมากสำหรับปาเอญาแท้ๆ",
                      "จัดถั่วเขียวและถั่วลิมาบนหน้าเป็นลวดลายสวยงาม ตั้งไฟให้เดือด แล้วลดไฟเป็นกลางค่อนข้างอ่อน ต้มโดยไม่ปิดฝา 18-20 นาที โดยไม่คน",
                      "หลัง 15 นาที ตรวจสอบว่าข้าวนุ่มและของเหลวถูกดูดซับหมด ถ้าข้าวต้องการเวลามากขึ้นแต่ของเหลวหมด โรยน้ำร้อนเล็กน้อยรอบขอบ ใน 2-3 นาทีสุดท้าย เพิ่มไฟเป็นแรงเพื่อสร้างโซคาร์รัต (ชั้นกรอบด้านล่าง) - คุณควรได้ยินเสียงแตก",
                      "ยกออกจากไฟและปิดด้วยผ้าครัวสะอาด พัก 5 นาที ข้าวควรนุ่ม เคี้ยวได้เล็กน้อย พร้อมก้นกรอบสีทอง เสิร์ฟจากกระทะโดยตรงพร้อมมะนาวหั่น ปาเอญาแท้ๆ ทานด้วยช้อนไม้!"
                  ]
    },
    {
        "id":  "gazpacho",
        "title":  "กาซปาโช (ซุปมะเขือเทศเย็น)",
        "prep_time":  "15 นาที (บวกแช่เย็น 2 ชั่วโมง)",
        "cook_time":  "0 นาที",
        "total_time":  "15 นาที",
        "image":  "assets/images/cuisines/spanish/gazpacho.jpg",
        "categories":  [
                           "soap_and_curry",
                           "snack_and_appetizers"
                       ],
        "ingredients":  [
                            "มะเขือเทศสุกสับหยาบ 1 กก.",
                            "แตงกวาปอกเปลือกและสับ 1 ลูก",
                            "พริกหยวกแดงเอาเมล็ดออกและสับ 1 เม็ด",
                            "พริกหยวกเขียวเอาเมล็ดออกและสับ 1 เม็ด",
                            "กระเทียม 2 กลีบ",
                            "ขนมปังเก่า 1 แผ่น เอาเปลือกออก",
                            "น้ำส้มสายชูเชอร์รี่ 3 ช้อนโต๊ะ",
                            "น้ำมันมะกอกบริสุทธิ์พิเศษ 1/2 ถ้วย",
                            "เกลือ 1 ช้อนชา",
                            "ผงยี่หร่า 1/2 ช้อนชา (ถ้าต้องการ)",
                            "น้ำแข็ง",
                            "สำหรับโรยหน้า: แตงกวาหั่นเต็าซี พริกหยวก ครูตอง ไข่ต้มสุก"
                        ],
        "steps":  [
                      "แช่ขนมปังในน้ำ 5 นาที จนนุ่ม บีบน้ำส่วนเกินออก",
                      "ในเครื่องปั่นหรือเครื่องบดอาหาร ผสมมะเขือเทศ แตงกวา พริกหยวกแดงและเขียว กระเทียม และขนมปังที่แช่แล้ว ปั่นความเร็วสูง 2-3 นาที จนเนียนสนิท",
                      "ขณะที่เครื่องปั่นทำงาน ค่อยๆ ราดน้ำมันมะกอกเป็นสายบางๆ อย่างสม่ำเสมอ จะทำให้ซุปอิมัลซิฟายและสร้างเนื้อสัมผัสเนียนนุ่มเป็นไหม เติมน้ำส้มสายชูเชอร์รี่ เกลือ และยี่หร่าถ้าใช้ ปั่นอีก 1 นาที",
                      "ชิมรสและปรุงเพิ่มเติม กาซปาโชควรสมดุลดี - เปรี้ยวจากน้ำส้มสายชู เข้มข้นจากน้ำมันมะกอก และสดจากผัก",
                      "กรองซุปผ่านตะแกรงละเอียดเพื่อเนื้อสัมผัสเนียนพิเศษ (แบบดั้งเดิม) หรือทิ้งให้เป็นก้อนเล็กน้อยถ้าชอบ กดของแข็งเพื่อสกัดของเหลวทั้งหมด",
                      "ย้ายไปยังภาชนะและแช่ตู้เย็นอย่างน้อย 2 ชั่วโมง ดีที่สุดคือ 4 ชั่วโมงหรือข้ามคืน กาซปาโชต้องเสิร์ฟเย็นมาก",
                      "ก่อนเสิร์ฟ คนให้ดีและตรวจสอบรสชาติอีกครั้ง - อุณหภูมิเย็นสามารถทำให้รสชาติจางลง คุณอาจต้องเติมเกลือหรือน้ำส้มสายชูเพิ่ม",
                      "เสิร์ฟในชามหรือแก้วที่เย็นแล้ว ใส่น้ำแข็ง 1 ก้อนในแต่ละที่เสิร์ฟถ้าต้องการ โรยแตงกวาหั่นเต็าซีละเอียด พริกหยวก ครูตอง และไข่ต้มสุกสับ ราดน้ำมันมะกอกบริสุทธิ์พิเศษ กาซปาโชควรสดชื่น สดใส และเหมาะสำหรับวันร้อนในฤดูร้อน"
                  ]
    },
    {
        "id":  "patatas_bravas",
        "title":  "ปาตาตัส บราวัส (มันฝรั่งรสเผ็ด)",
        "prep_time":  "15 นาที",
        "cook_time":  "30 นาที",
        "total_time":  "45 นาที",
        "image":  "assets/images/cuisines/spanish/patatas_bravas.jpg",
        "categories":  [
                           "snack_and_appetizers"
                       ],
        "ingredients":  [
                            "มันฝรั่งปอกเปลือกและหั่นเต็าซี 2 ซม. 800 กรัม",
                            "น้ำมันสำหรับทอด",
                            "สำหรับซอสบราวัส: น้ำมันมะกอก 2 ช้อนโต๊ะ",
                            "หัวหอมใหญ่สับละเอียด 1 หัว",
                            "กระเทียมสับ 3 กลีบ",
                            "มะเขือเทศกระป๋องบด 400 กรัม",
                            "ผงพริกหวาน 1 ช้อนชา",
                            "ผงพริกเผ็ดหรือพริกป่น 1 ช้อนชา",
                            "น้ำตาล 1 ช้อนชา",
                            "เกลือตามชอบ",
                            "สำหรับไอโอลี: กระเทียม 3 กลีบ",
                            "ไข่แดง 1 ฟอง",
                            "น้ำมันมะกอก 3/4 ถ้วย",
                            "น้ำมะนาว 1 ช้อนโต๊ะ",
                            "เกลือเล็กน้อย"
                        ],
        "steps":  [
                      "ทำซอสบราวัส: ตั้งน้ำมันมะกอก 2 ช้อนโต๊ะในหม้อไฟกลาง ใส่หัวหอมสับละเอียดและต้ม 5-7 นาที จนนุ่มและใส ใส่กระเทียมสับและต้ม 1 นาที",
                      "ใส่มะเขือเทศบด ผงพริกหวาน ผงพริกเผ็ด น้ำตาล และเกลือ เคี่ยว 15-20 นาที คนเป็นครั้งคราว จนข้น ปั่นจนเนียนถ้าชอบ หรือทิ้งให้เป็นก้อน พักไว้",
                      "ทำไอโอลี: ในเครื่องบดอาหารหรือครก บดกระเทียมกับเกลือเล็กน้อยจนเป็นเพสต์ ใส่ไข่แดงและปั่น ค่อยๆ ราดน้ำมันมะกอกขณะปั่นอย่างต่อเนื่อง - เริ่มด้วยหยด แล้วเป็นสายบาง ส่วนผสมจะอิมัลซิฟายและข้น เติมน้ำมะนาวและปั่น แช่ตู้เย็นจนต้องการใช้",
                      "ล้างมันฝรั่งเต็าซีในน้ำเย็นเพื่อเอาแป้งส่วนเกินออก เช็ดให้แห้งสนิทด้วยกระดาษซับมัน - สำคัญมากสำหรับมันฝรั่งกรอบ",
                      "ตั้งน้ำมัน 2-3 นิ้วในหม้อลึกหรือเครื่องทอดให้ร้อน 160°C (320°F) ทอดมันฝรั่งเป็นชุดๆ 8-10 นาที จนนุ่มแต่ยังไม่มีสี ตักออกและพักบนกระดาษซับมัน ปล่อยให้เย็น 10 นาที",
                      "เพิ่มอุณหภูมิน้ำมันเป็น 190°C (375°F) ทอดมันฝรั่งอีกครั้งเป็นชุดๆ 3-4 นาที จนเป็นสีทองและกรอบ เทคนิคการทอดสองครั้งนี้ทำให้ด้านนอกกรอบและด้านในฟู พักและปรุงรสด้วยเกลือทันที",
                      "จัดมันฝรั่งกรอบบนจานเสิร์ฟ ราดซอสบราวัสอุ่นๆ ให้เยอะๆ เติมไอโอลีเป็นก้อนบนหน้าหรือเสิร์ฟข้างๆ",
                      "เสิร์ฟทันทีขณะร้อนและกรอบ ปาตาตัส บราวัสควรมีมันฝรั่งกรอบสีทองพร้อมซอสมะเขือเทศรสเผ็ดและไอโอลีกระเทียมครีมมี่ ทาปาสที่สมบูรณ์แบบ!"
                  ]
    },
    {
        "id":  "churros_chocolate",
        "title":  "ชูรอสกับช็อกโกแลต",
        "prep_time":  "15 นาที",
        "cook_time":  "20 นาที",
        "total_time":  "35 นาที",
        "image":  "assets/images/cuisines/spanish/churros_chocolate.jpg",
        "categories":  [
                           "dessert"
                       ],
        "ingredients":  [
                            "สำหรับชูรอส: น้ำ 1 ถ้วย",
                            "น้ำตาล 2 ช้อนโต๊ะ",
                            "เกลือ 1/2 ช้อนชา",
                            "เนย 2 ช้อนโต๊ะ",
                            "แป้งอเนกประสงค์ 1 ถ้วย",
                            "ไข่ 1 ฟอง",
                            "สารสกัดวานิลลา 1/2 ช้อนชา",
                            "น้ำมันสำหรับทอด",
                            "น้ำตาล 1/2 ถ้วยผสมกับอบเชย 1 ช้อนชา",
                            "สำหรับช็อกโกแลต: ช็อกโกแลตดาร์กสับ 200 กรัม",
                            "นมสดไขมันเต็ม 1 ถ้วย",
                            "แป้งข้าวโพด 1 ช้อนโต๊ะ",
                            "น้ำตาล 2 ช้อนโต๊ะ"
                        ],
        "steps":  [
                      "ทำซอสช็อกโกแลต: ผสมแป้งข้าวโพดกับนม 2 ช้อนโต๊ะจนเนียน ตั้งนมที่เหลือกับน้ำตาลในหม้อไฟกลางจนมีไอขึ้น ใส่ช็อกโกแลตสับและตีจนละลายและเนียน",
                      "เติมส่วนผสมแป้งข้าวโพดและตีตลอดเวลา 2-3 นาที จนช็อกโกแลตข้นเหมือนพุดดิ้ง เก็บไว้อุ่นบนไฟอ่อนมาก คนเป็นครั้งคราว",
                      "ทำแป้งชูรอส: ในหม้อขนาดกลาง ผสมน้ำ น้ำตาล 2 ช้อนโต๊ะ เกลือ และเนย ตั้งไฟกลางค่อนข้างแรงให้เดือด คนจนเนยละลาย",
                      "ยกออกจากไฟและใส่แป้งทั้งหมดลงไปทันที คนอย่างแรงด้วยช้อนไม้จนส่วนผสมเป็นก้อนเนียนและหลุดจากข้างหม้อ",
                      "ปล่อยให้เย็น 5 นาที ใส่ไข่และสารสกัดวานิลลา ตีอย่างแรงจนเข้ากันดีและแป้งเนียนเป็นเงา แป้งควรข้นแต่บีบได้",
                      "ย้ายแป้งไปยังถุงบีบที่ติดหัวดาวขนาดใหญ่ (สร้างร่องเป็นเอกลักษณ์)",
                      "ตั้งน้ำมัน 2-3 นิ้วในหม้อลึกให้ร้อน 190°C (375°F) บีบแป้งเป็นแถบยาว 4-5 นิ้วลงในน้ำมันร้อนโดยตรง ใช้กรรไกรตัด ทอด 3-4 ชูรอสต่อครั้ง 2-3 นาทีต่อด้าน จนเป็นสีทองเข้มและกรอบ",
                      "ตักด้วยทัพพีรูพรุนและพักบนกระดาษซับมัน 30 วินาที ขณะยังร้อน กลิ้งในน้ำตาลอบเชยเพื่อเคลือบทั่ว",
                      "เสิร์ฟชูรอสทันทีขณะร้อนและกรอบพร้อมซอสช็อกโกแลตข้นอุ่นๆ สำหรับจิ้ม ชูรอสสเปนมักจะหนากว่าแบบเม็กซิกันและช็อกโกแลตควรข้นมาก - เกือบเหมือนพุดดิ้ง เหมาะสำหรับอาหารเช้าหรือเมเรียนดายามบ่าย!"
                  ]
    },
    {
        "id":  "sangria",
        "title":  "ซังเกรีย (พันช์ไวน์สเปน)",
        "prep_time":  "10 นาที (บวกแช่เย็น 4 ชั่วโมง)",
        "cook_time":  "0 นาที",
        "total_time":  "10 นาที",
        "image":  "assets/images/cuisines/spanish/sangria.jpg",
        "categories":  [
                           "drink"
                       ],
        "ingredients":  [
                            "ไวน์แดงสเปน 1 ขวด (750 มล.) (รีโอฮาหรือเทมปรานิโย)",
                            "บรั่นดี 1/4 ถ้วย",
                            "ลิเคียร์ส้ม 2 ช้อนโต๊ะ (คอยน์โตรหรือทริปเปิลเซค)",
                            "น้ำตาล 1/4 ถ้วย",
                            "ส้มหั่น 1 ลูก",
                            "มะนาวหั่น 1 ลูก",
                            "มะนาวหั่น 1 ลูก",
                            "แอปเปิ้ลเอาแกนออกและหั่นเต็าซี 1 ลูก",
                            "เบอร์รี่สด (สตรอว์เบอร์รี่ ราสเบอร์รี่) 1 ถ้วย",
                            "อบเชย 1 แท่ง",
                            "น้ำส้มคั้น 1 ถ้วย",
                            "น้ำอัดลมหรือโซดามะนาว 1 ถ้วย",
                            "น้ำแข็ง"
                        ],
        "steps":  [
                      "ในเหยือกขนาดใหญ่ ผสมไวน์แดง บรั่นดี และลิเคียร์ส้ม คนให้เข้ากัน",
                      "เติมน้ำตาลและคนจนละลายหมด ปริมาณน้ำตาลสามารถปรับได้ตามความหวานของไวน์และความชอบส่วนบุคคล",
                      "ใส่ส้มหั่น มะนาวหั่น มะนาวหั่น แอปเปิ้ลหั่นเต็าซี เบอร์รี่สด และอบเชยลงในเหยือก ใช้ช้อนไม้บดผลไม้เบาๆ เพื่อปล่อยน้ำบ้าง แต่อย่าบดจนยุ่ย",
                      "เทน้ำส้มคั้นลงไปและคนทุกอย่างเข้าด้วยกัน",
                      "ปิดเหยือกและแช่ตู้เย็นอย่างน้อย 4 ชั่วโมง ดีที่สุดคือข้ามคืน เพื่อให้รสชาติผสมผสานและผลไม้ซึมลงในไวน์ ยิ่งทิ้งไว้นาน ยิ่งอร่อย",
                      "ก่อนเสิร์ฟ เติมน้ำอัดลมหรือโซดามะนาวเพื่อความฟู คนเบาๆ",
                      "เติมน้ำแข็งในแก้ว เทซังเกรียลงบนน้ำแข็ง ให้แน่ใจว่าแต่ละแก้วได้ผลไม้บ้าง",
                      "เสิร์ฟทันที ซังเกรียควรมีรสผลไม้ สดชื่น และไม่หวานเกินไป ชิ้นผลไม้ทานได้! เหมาะสำหรับการชุมนุมในฤดูร้อนและงานเฟียสต้า ¡ซาลูด!"
                  ]
    }
]
