[
    {
        "id":  "pad_thai",
        "title":  "ผัดไทยสูตรดั้งเดิม",
        "prep_time":  "20 นาที",
        "cook_time":  "10 นาที",
        "total_time":  "30 นาที",
        "image":  "assets/images/cuisines/thai/pad_thai.jpg",
        "categories":  [
                           "noodles",
                           "maincourse"
                       ],
        "ingredients":  [
                            "เส้นผัดไทย 150 กรัม (แช่น้ำ 30 นาที)",
                            "กุ้งสด 120 กรัม (ปอกเปลือก)",
                            "น้ำมะขามเปียก 2 ช้อนโต๊ะ",
                            "น้ำปลา 1.5 ช้อนโต๊ะ",
                            "น้ำตาลปี๊บ 1.5 ช้อนโต๊ะ",
                            "กระเทียมสับ 2 กลีบ",
                            "ไข่ 1 ฟอง",
                            "ถั่วงอก 1 ถ้วย",
                            "กุยช่ายหั่น 1 นิ้ว 2 ช้อนโต๊ะ",
                            "ถั่วลิสงบด 2 ช้อนโต๊ะ",
                            "น้ำมัน 1 ช้อนโต๊ะ",
                            "มะนาว"
                        ],
        "steps":  [
                      "แช่เส้นผัดไทยในน้ำอุณหภูมิห้อง 25-30 นาที จนเส้นนุ่มแต่ยังมีความยืดหยุ่น พักน้ำแล้วพักไว้",
                      "ตั้งหม้อเล็กไฟอ่อน ผสมน้ำมะขามเปียก น้ำปลา และน้ำตาลปี๊บ คนตลอด 2-3 นาที จนน้ำตาลละลายหมดและซอสเข้ากันดี พักไว้",
                      "ตั้งน้ำมัน 1 ช้อนโต๊ะในกระทะหรือพานขนาดใหญ่ไฟแรง จนน้ำมันเป็นริ้ว ใส่กระเทียมสับลงไป ผัด 15-20 วินาที จนหอมแต่ยังไม่เปลี่ยนสี",
                      "ใส่กุ้งลงไปผัด 2-3 นาที จนกุ้งเปลี่ยนเป็นสีชมพูและสุกพอดี เขล่าไปด้านข้างของกระทะ",
                      "ตอกไข่ลงไปด้านว่างของกระทะ ตีไข่แดงให้แตก แล้วคนประมาณ 30 วินาที จนไข่เพิ่งตัว แล้วผสมกับกุ้ง",
                      "ใส่เส้นที่พักน้ำแล้วลงไปในกระทะ รดซอสที่เตรียมไว้ลงไป คลุกเคล้า 2-3 นาที จนเส้นเคลือบซอสทั่วและร้อนดี",
                      "ใส่กุยช่ายและถั่วงอกลงไป ผัดอีก 1-2 นาที จนถั่วงอกนุ่มเล็กน้อยแต่ยังกรอบ",
                      "ตักใส่จาน โรยถั่วลิสงบด เสิร์ฟทันทีร้อนๆ พร้อมมะนาววางข้างจาน บีบน้ำมะนาวลงไปบนผัดไทยก่อนทาน"
                  ]
    },
    {
        "id":  "green_curry",
        "title":  "แกงเขียวหวาน",
        "prep_time":  "15 นาที",
        "cook_time":  "20 นาที",
        "total_time":  "35 นาที",
        "image":  "assets/images/cuisines/thai/green_curry.jpg",
        "categories":  [
                           "soap_and_curry",
                           "maincourse"
                       ],
        "ingredients":  [
                            "พริกแกงเขียวหวาน 2 ช้อนโต๊ะ",
                            "กะทิ 400 มล.",
                            "เนื้อไก่สะโพกหั่นชิ้น 250 กรัม",
                            "มะเขือพวง 1 ถ้วย (ผ่าครึ่ง)",
                            "น้ำปลา 1 ช้อนโต๊ะ",
                            "น้ำตาลปี๊บ 1 ช้อนโต๊ะ",
                            "น้ำซุปไก่ 1/2 ถ้วย",
                            "ใบโหระพา 1 ถ้วย",
                            "ใบมะกรูด 2 ใบ",
                            "พริกชี้ฟ้าแดงหั่น 2 เม็ด"
                        ],
        "steps":  [
                      "เทกะทิ 1/3 ส่วน (ประมาณ 130 มล.) ลงในกระทะหรือหม้อขนาดใหญ่ ตั้งไฟกลางค่อนข้างแรง 3-4 นาที คนเป็นครั้งคราว จนน้ำมันกะทิแยกตัวขึ้นมาเป็นชั้นบนสุด",
                      "ใส่พริกแกงเขียวหวานลงไปในกะทิที่แตกมันแล้ว ผัด 2-3 นาที จนพริกแกงหอมมากและน้ำมันเปลี่ยนเป็นสีเขียวเล็กน้อย",
                      "ใส่เนื้อไก่หั่นชิ้นลงไป คลุกให้ทุกชิ้นเคลือบพริกแกง ผัด 3-4 นาที คนบ่อยๆ จนไก่เริ่มสุกและไม่เป็นสีชมพูด้านนอก",
                      "เทกะทิที่เหลือและน้ำซุปไก่ลงไป คนให้เข้ากัน ตั้งไฟให้เดือดเบาๆ",
                      "ใส่มะเขือพวงผ่าครึ่งลงในแกง ลดไฟเป็นกลางค่อนข้างอ่อน เคี่ยว 10-12 นาที คนเป็นครั้งคราว จนมะเขือนุ่มและไก่สุกทั่ว",
                      "ปรุงรสด้วยน้ำปลาและน้ำตาลปี๊บ ชิมรสและปรุงเพิ่มเติมให้ได้รสเค็ม หวาน และเผ็ดที่สมดุล",
                      "ฉีกใบมะกรูดแล้วใส่ลงในแกง พร้อมใบโหระพาและพริกชี้ฟ้าแดงหั่น คนเบาๆ ต้มอีก 1-2 นาที จนใบโหระพาเหี่ยว",
                      "ปิดไฟและตักใส่ถ้วย เสิร์ฟร้อนๆ พร้อมข้าวหอมมะลิ แกงควรมีสีเขียวสดและเนื้อแกงข้นครีมมี่"
                  ]
    },
    {
        "id":  "tom_yum_goong",
        "title":  "ต้มยำกุ้ง",
        "prep_time":  "15 นาที",
        "cook_time":  "15 นาที",
        "total_time":  "30 นาที",
        "image":  "assets/images/cuisines/thai/tom_yum_goong.jpg",
        "categories":  [
                           "soap_and_curry"
                       ],
        "ingredients":  [
                            "กุ้งแม่น้ำตัวใหญ่ 300 กรัม (ปอกเปลือก)",
                            "น้ำซุปไก่หรือกุ้ง 4 ถ้วย",
                            "ตะไคร้หั่น 2 นิ้ว 3 ต้น",
                            "ข่าหั่น 5 แผ่น",
                            "ใบมะกรูดฉีก 5 ใบ",
                            "พริกขี้หนูบุบ 5 เม็ด",
                            "เห็ดฟางผ่าครึ่ง 200 กรัม",
                            "น้ำปลา 3 ช้อนโต๊ะ",
                            "น้ำมะนาว 2 ช้อนโต๊ะ",
                            "น้ำพริกเผา 1 ช้อนโต๊ะ",
                            "นมข้นจืด 3 ช้อนโต๊ะ (ถ้าทำแบบน้ำข้น)",
                            "ผักชีสำหรับโรยหน้า"
                        ],
        "steps":  [
                      "ตั้งหม้อใหญ่ใส่น้ำซุปไก่หรือกุ้ง ตั้งไฟแรงให้เดือดปุดๆ ใส่ตะไคร้ที่ทุบแล้ว ข่าหั่น และใบมะกรูดฉีก ต้มต่อ 5 นาที เพื่อให้กลิ่นหอมซึมลงในน้ำซุป",
                      "ใส่เห็ดฟางผ่าครึ่งลงในน้ำซุปที่เดือด ลดไฟเป็นกลาง เคี่ยว 3 นาที จนเห็ดนุ่ม",
                      "ใส่กุ้งที่ปอกเปลือกแล้วลงไป ต้ม 2-3 นาที คนเบาๆ จนกุ้งเปลี่ยนเป็นสีชมพูและม้วนตัว ห้ามต้มนานเกินไปไม่งั้นกุ้งจะเหนียว",
                      "ปรุงรสด้วยน้ำปลาและน้ำพริกเผา คนให้น้ำพริกเผาละลายหมด ชิมรสและปรุงเพิ่มเติม - ควรได้รสเปรี้ยว เผ็ด และเค็มที่สมดุล",
                      "ปิดไฟทันที ใส่น้ำมะนาวสดและพริกขี้หนูบุบ น้ำมะนาวควรใส่หลังปิดไฟเพื่อรักษารสเปรี้ยวสด",
                      "ถ้าทำแบบน้ำข้น (ต้มยำน้ำข้น) ให้คนนมข้นจืดลงไปจนซุปเปลี่ยนเป็นสีส้มอ่อน สำหรับแบบน้ำใส (ต้มยำน้ำใส) ข้ามขั้นตอนนี้",
                      "ตักใส่ถ้วย โรยผักชีสดให้เยอะๆ เสิร์ฟทันทีขณะร้อนจัด ต้มยำควรมีกลิ่นหอม รสชาติสมดุลระหว่างเปรี้ยว เผ็ด และเค็ม"
                  ]
    },
    {
        "id":  "som_tam",
        "title":  "ส้มตำไทย",
        "prep_time":  "20 นาที",
        "cook_time":  "0 นาที",
        "total_time":  "20 นาที",
        "image":  "assets/images/cuisines/thai/som_tam.jpg",
        "categories":  [
                           "snack_and_appetizers"
                       ],
        "ingredients":  [
                            "มะละกอดิบฝอย 2 ถ้วย",
                            "กระเทียม 2 กลีบ",
                            "พริกขี้หนู 2-3 เม็ด",
                            "กุ้งแห้ง 2 ช้อนโต๊ะ",
                            "ถั่วลิสงคั่ว 2 ช้อนโต๊ะ",
                            "น้ำตาลปี๊บ 1 ช้อนโต๊ะ",
                            "น้ำปลา 2 ช้อนโต๊ะ",
                            "น้ำมะนาว 2 ช้อนโต๊ะ",
                            "มะเขือเทศราชินีผ่าครึ่ง 1 ถ้วย",
                            "ถั่วฝักยาวหั่น 1 นิ้ว 1/2 ถ้วย",
                            "น้ำมะขามเปียก 1 ช้อนโต๊ะ"
                        ],
        "steps":  [
                      "ในครกขนาดใหญ่ ใส่กระเทียมและพริกขี้หนู โขลกด้วยกันประมาณ 1-2 นาที จนได้เป็นเนื้อละเอียดหยาบ พริกควรแตกแต่ไม่ละเอียดมาก",
                      "ใส่น้ำตาลปี๊บลงในครก โขลกต่ออีกประมาณ 1 นาที จนน้ำตาลละลายและผสมกับกระเทียม-พริก",
                      "ใส่กุ้งแห้งและถั่วลิสงคั่วลงไป โขลกเบาๆ ประมาณ 10-15 ครั้ง เพื่อทุบให้แตกเล็กน้อย ควรเหลือเนื้อเป็นก้อนเพื่อความกรุบกรอบ",
                      "ใส่ถั่วฝักยาวหั่น 1 นิ้ว และมะเขือเทศราชินีผ่าครึ่งลงไป ตำเบาๆ 5-6 ครั้ง เพื่อให้แตกและออกน้ำ แต่ไม่ให้บุบยุ่ยหมด",
                      "ใส่มะละกอดิบฝอยลงในครก ใช้ช้อนและสากครกร่วมกัน ตำและพลิกคลุกเคล้าเบาๆ 2-3 นาที เป้าหมายคือให้มะละกอช้ำเพื่อซึมรส ไม่ใช่บด",
                      "ปรุงรสด้วยน้ำปลา น้ำมะนาวสด และน้ำมะขามเปียก ใช้ช้อนคลุกเคล้าให้น้ำปรุงรสเคลือบส่วนผสมทุกอย่างอย่างทั่วถึง ชิมรสและปรุงเพิ่มเติม - ควรได้รสสมดุลระหว่างเผ็ด เปรี้ยว เค็ม และหวานเล็กน้อย",
                      "ตักใส่จานทันที ส้มตำอร่อยที่สุดเมื่อทำสดใหม่และไม่ควรทิ้งไว้นาน เสิร์ฟพร้อมข้าวเหนียว ไก่ย่าง หรือเป็นเครื่องเคียง สลัดควรกรอบ เปรี้ยว และสดชื่น"
                  ]
    },
    {
        "id":  "massaman_curry",
        "title":  "แกงมัสมั่น",
        "prep_time":  "20 นาที",
        "cook_time":  "45 นาที",
        "total_time":  "65 นาที",
        "image":  "assets/images/cuisines/thai/massaman_curry.jpg",
        "categories":  [
                           "soap_and_curry",
                           "maincourse"
                       ],
        "ingredients":  [
                            "พริกแกงมัสมั่น 3 ช้อนโต๊ะ",
                            "เนื้อวัวหั่นชิ้น 500 กรัม",
                            "กะทิ 400 มล.",
                            "หัวกะทิ 1 ถ้วย",
                            "มันฝรั่งหั่นชิ้น 2 หัว",
                            "หัวหอมใหญ่หั่นเป็น 4 1 หัว",
                            "ถั่วลิสงคั่ว 1/2 ถ้วย",
                            "น้ำปลา 3 ช้อนโต๊ะ",
                            "น้ำตาลปี๊บ 3 ช้อนโต๊ะ",
                            "น้ำมะขามเปียก 2 ช้อนโต๊ะ",
                            "ใบกระวาน 3 ใบ",
                            "อบเชย 1 แท่ง",
                            "ลูกกระวาน 3 เม็ด"
                        ],
        "steps":  [
                      "เทหัวกะทิลงในหม้อหรือกระทะขนาดใหญ่ ตั้งไฟกลางค่อนข้างแรง 5-7 นาที คนเป็นครั้งคราว จนน้ำมันกะทิแยกตัวขึ้นมาด้านบน จะเห็นชั้นน้ำมันใสๆ ลอยขึ้นมา",
                      "ใส่พริกแกงมัสมั่นลงไปในหัวกะทิที่แตกมันแล้ว ผัด 3-4 นาที คนตลอดเวลา จนพริกแกงหอมมากและเข้มสีขึ้นเล็กน้อย ครัวจะมีกลิ่นหอมชวนน้ำลายสอ",
                      "ใส่เนื้อวัวหั่นชิ้นลงในหม้อ คลุกให้ทุกชิ้นเคลือบพริกแกง ผัด 5-6 นาที พลิกเนื้อเป็นครั้งคราว จนทุกด้านสุกและปิดผิว",
                      "เทกะทิลงไป ใส่ใบกระวาน อบเชย และลูกกระวาน คนให้เข้ากัน ตั้งไฟให้เดือดเบาๆ",
                      "เมื่อเดือดแล้ว ลดไฟเป็นอ่อน ปิดฝาและเคี่ยวเบาๆ 30-40 นาที คนเป็นครั้งคราว จนเนื้อนุ่ม ตรวจสอบโดยใช้ส้อมแทง - ควรแทงเข้าไปได้ง่ายแต่เนื้อยังไม่แตกเป็นเส้นใย",
                      "ใส่มันฝรั่งหั่นชิ้นและหัวหอมใหญ่หั่นเป็น 4 ลงในแกง คนเบาๆ เคี่ยวต่อโดยไม่ปิดฝาอีก 15-20 นาที จนมันฝรั่งสุกนุ่มทะลุ",
                      "ปรุงรสแกงด้วยน้ำปลา น้ำตาลปี๊บ และน้ำมะขามเปียก คนให้เข้ากัน ชิมรสและปรุงเพิ่มเติมให้ได้รสสมดุลระหว่างเค็ม หวาน และเปรี้ยวเล็กน้อย แกงมัสมั่นควรมีรสหวานนำเล็กน้อย",
                      "ใส่ถั่วลิสงคั่วลงไปคนให้เข้ากัน เคี่ยวต่ออีก 5 นาที เพื่อให้ถั่วนุ่มเล็กน้อยและซึมรสแกง",
                      "ปิดไฟ ตักใส่ถ้วย เสิร์ฟร้อนๆ พร้อมข้าวหอมมะลิ แกงควรมีสีน้ำตาลแดง เนื้อข้นครีมมี่ และมีชั้นน้ำมันลอยอยู่ด้านบน"
                  ]
    }
]
