[
    {
        "id":  "kebab",
        "title":  "เคบับตุรกี (อาดานา เคบับ)",
        "prep_time":  "30 นาที",
        "cook_time":  "15 นาที",
        "total_time":  "45 นาที",
        "image":  "assets/images/cuisines/turkish/kebab.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "เนื้อแกะบด (หรือเนื้อวัว) 800 กรัม",
                            "หัวหอมขูด 1 หัว",
                            "กระเทียมสับ 3 กลีบ",
                            "ผงพริกหวาน 2 ช้อนโต๊ะ",
                            "ผงยี่หร่า 1 ช้อนโต๊ะ",
                            "พริกป่น 1 ช้อนชา",
                            "พริกไทยดำ 1 ช้อนชา",
                            "เกลือตามชอบ",
                            "ขนมปังแบน ผักย่าง โยเกิร์ต"
                        ],
        "steps":  [
                      "ในชาม ผสมเนื้อแกะบด หัวหอมขูด (บีบน้ำส่วนเกินออก) กระเทียม ผงพริกหวาน ยี่หร่า พริกป่น พริกไทยดำ และเกลือ ผสมให้เข้ากันและนวด 5 นาที จนเหนียว",
                      "แบ่งส่วนผสมเป็นส่วนๆ ปั้นแต่ละส่วนรอบไม้เสียบโลหะแบน สร้างเคบับยาวบาง",
                      "แช่ตู้เย็น 30 นาที เพื่อให้แข็งตัว",
                      "อุ่นเตาย่างไฟแรง ย่างเคบับ 12-15 นาที พลิกเป็นครั้งคราว จนสุกทั่วและไหม้เล็กน้อย",
                      "เสิร์ฟพร้อมขนมปังแบน ผักย่าง และโยเกิร์ต เคบับตุรกีควรชุ่มฉ่ำ เผ็ด และมีกลิ่นควัน"
                  ]
    },
    {
        "id":  "meze_platter",
        "title":  "จานเมเซ่ตุรกี",
        "prep_time":  "30 นาที",
        "cook_time":  "0 นาที",
        "total_time":  "30 นาที",
        "image":  "assets/images/cuisines/turkish/meze.jpg",
        "categories":  [
                           "snack_and_appetizers"
                       ],
        "ingredients":  [
                            "ฮัมมัส บาบากานูช ใบองุ่นยัดไส้",
                            "ชีสเฟต้า มะกอก มะเขือเทศราชินี",
                            "แตงกวาหั่น ขนมปังพิต้า",
                            "สำหรับคาซิก: โยเกิร์ต 2 ถ้วย",
                            "แตงกวาขูด 1 ลูก",
                            "กระเทียมสับ 2 กลีบ",
                            "น้ำมันมะกอก 2 ช้อนโต๊ะ",
                            "มิ้นต์สับ 1 ช้อนโต๊ะ",
                            "เกลือ"
                        ],
        "steps":  [
                      "ทำคาซิก (ซาซิกิตุรกี): ผสมโยเกิร์ต แตงกวาขูด (พักน้ำ) กระเทียม น้ำมันมะกอก มิ้นต์ และเกลือ แช่ตู้เย็น",
                      "จัดฮัมมัส บาบากานูช ใบองุ่นยัดไส้ ชีสเฟต้า มะกอก มะเขือเทศราชินี และแตงกวาบนจานใหญ่",
                      "ใส่คาซิกในชามเล็ก เสิร์ฟพร้อมขนมปังพิต้าอุ่นๆ เมเซ่ควรมีรสชาติและเนื้อสัมผัสหลากหลายสำหรับแบ่งปัน"
                  ]
    },
    {
        "id":  "baklava_turkish",
        "title":  "บาคลาวาตุรกี",
        "prep_time":  "40 นาที",
        "cook_time":  "50 นาที",
        "total_time":  "90 นาที",
        "image":  "assets/images/cuisines/turkish/baklava.jpg",
        "categories":  [
                           "dessert"
                       ],
        "ingredients":  [
                            "แป้งฟิลโล 1 ซอง",
                            "ถั่วพิสตาชิโอสับละเอียด 2 ถ้วย",
                            "เนยละลาย 1 ถ้วย",
                            "สำหรับน้ำเชื่อม: น้ำตาล 2 ถ้วย",
                            "น้ำ 1 ถ้วย",
                            "น้ำมะนาว 1 ช้อนโต๊ะ",
                            "น้ำกุหลาบ 1 ช้อนโต๊ะ"
                        ],
        "steps":  [
                      "อุ่นเตาอบที่ 175°C (350°F) เรียง 10 แผ่นฟิลโลในกระทะทาเนย ทาแต่ละแผ่นด้วยเนย",
                      "โรยพิสตาชิโอครึ่งหนึ่ง เพิ่มฟิลโล 5 แผ่น (ทาเนยแต่ละแผ่น) พิสตาชิโอที่เหลือ แล้วฟิลโลอีก 10 แผ่น",
                      "หั่นเป็นรูปเพชร อบ 50 นาที จนเป็นสีทอง",
                      "ทำน้ำเชื่อม: ต้มน้ำตาล น้ำ และน้ำมะนาว 10 นาที เติมน้ำกุหลาบ เทน้ำเชื่อมร้อนลงบนบาคลาวาอุ่น",
                      "ปล่อยให้เย็นสนิทก่อนเสิร์ฟ บาคลาวาตุรกีมีชื่อเสียงจากไส้พิสตาชิโอและน้ำเชื่อมน้ำกุหลาบ"
                  ]
    },
    {
        "id":  "turkish_coffee",
        "title":  "กาแฟตุรกี",
        "prep_time":  "2 นาที",
        "cook_time":  "5 นาที",
        "total_time":  "7 นาที",
        "image":  "assets/images/cuisines/turkish/turkish_coffee.jpg",
        "categories":  [
                           "drink"
                       ],
        "ingredients":  [
                            "น้ำเย็น 1 ถ้วย",
                            "กาแฟตุรกีบดละเอียด 1 ช้อนโต๊ะ",
                            "น้ำตาล 1 ช้อนชา (ถ้าต้องการ)",
                            "ลูกกระวาน (ถ้าต้องการ)"
                        ],
        "steps":  [
                      "ใส่น้ำ กาแฟ และน้ำตาล (ถ้าใช้) ลงในเซซเว่ (หม้อกาแฟตุรกี) คนครั้งเดียว",
                      "ตั้งไฟอ่อน เมื่อเริ่มเป็นฟอง ยกออกจากไฟก่อนที่จะเดือดล้น ปล่อยให้ฟองตก",
                      "กลับไปตั้งไฟและปล่อยให้ฟองขึ้นอีกครั้ง ทำซ้ำอีกครั้ง",
                      "เทลงในถ้วยเล็ก ปล่อยให้กากตกตะกอน กาแฟตุรกีควรเข้มข้น ข้น และเสิร์ฟพร้อมกาก"
                  ]
    },
    {
        "id":  "turkish_delight",
        "title":  "ขนมตุรกี (โลกุม)",
        "prep_time":  "15 นาที",
        "cook_time":  "60 นาที",
        "total_time":  "75 นาที (บวกตั้งตัว)",
        "image":  "assets/images/cuisines/turkish/turkish_delight.jpg",
        "categories":  [
                           "dessert"
                       ],
        "ingredients":  [
                            "น้ำตาล 4 ถ้วย",
                            "น้ำ 4.5 ถ้วย",
                            "แป้งข้าวโพด 1 ถ้วย",
                            "ครีมออฟทาร์ทาร์ 1 ช้อนชา",
                            "น้ำกุหลาบ 2 ช้อนโต๊ะ",
                            "สีผสมอาหาร (ถ้าต้องการ)",
                            "น้ำตาลป่น 1 ถ้วย",
                            "ถั่วพิสตาชิโอ (ถ้าต้องการ)"
                        ],
        "steps":  [
                      "ทาน้ำมันในกระทะ 9x9 ในหม้อ ผสมน้ำ 1.5 ถ้วยกับแป้งข้าวโพดและครีมออฟทาร์ทาร์ ตีจนเนียน",
                      "ในหม้ออีกใบ ต้มน้ำตาลกับน้ำ 3 ถ้วยจนน้ำตาลละลาย เติมลงในส่วนผสมแป้งข้าวโพด",
                      "ต้มไฟกลาง คนตลอดเวลา 45-60 นาที จนข้นและเป็นสีทอง เติมน้ำกุหลาบและสีผสมอาหาร",
                      "เทลงในกระทะที่เตรียมไว้ ปล่อยให้ตั้งตัวข้ามคืน หั่นเป็นสี่เหลี่ยมและกลิ้งในน้ำตาลป่นผสมแป้งข้าวโพด ขนมตุรกีควรนุ่ม เคี้ยวได้ และหอม"
                  ]
    }
]
