[
    {
        "id":  "pho_bo",
        "title":  "เฝอเนื้อ",
        "prep_time":  "30 นาที",
        "cook_time":  "3 ชั่วโมง",
        "total_time":  "3.5 ชั่วโมง",
        "image":  "assets/images/cuisines/vietnamese/pho_bo.jpg",
        "categories":  [
                           "soap_and_curry",
                           "noodles"
                       ],
        "ingredients":  [
                            "กระดูกเนื้อ 1 กก.",
                            "เนื้อสันทราย 500 กรัม",
                            "หัวหอมใหญ่ผ่าครึ่ง 2 หัว",
                            "ขิงผ่าครึ่งตามยาว 10 ซม.",
                            "โป๊ยกั๊ก 3 ดอก",
                            "อบเชย 2 แท่ง",
                            "กานพลู 5 เม็ด",
                            "เมล็ดผักชี 1 ช้อนโต๊ะ",
                            "น้ำปลา 3 ช้อนโต๊ะ",
                            "น้ำตาล 1 ช้อนโต๊ะ",
                            "เส้นก๋วยเตี๋ยวสด (บั๋นเฝอ) 400 กรัม",
                            "เนื้อสันในหั่นบาง 200 กรัม",
                            "ถั่วงอก โหระพาไทย มะนาวหั่น พริกสำหรับเสิร์ฟ",
                            "ซอสหอยซินและศรีราชา"
                        ],
        "steps":  [
                      "ลวกกระดูกเนื้อในน้ำเดือด 5 นาที พักน้ำและล้างเพื่อเอาสิ่งสกปรกออก เพื่อให้น้ำซุปใส",
                      "เผาหัวหอมและขิงโดยตรงบนเตาแก๊สหรือใต้เตาอบจนไหม้ดำทุกด้าน ประมาณ 5 นาที เพื่อเพิ่มความลึกให้น้ำซุป",
                      "คั่วโป๊ยกั๊ก อบเชย กานพลู และเมล็ดผักชีในกระทะแห้งไฟกลาง 2-3 นาที จนหอม",
                      "ในหม้อใหญ่ ใส่กระดูกที่ทำความสะอาดแล้ว เนื้อสันทราย หัวหอมและขิงที่เผาแล้ว และเครื่องเทศที่คั่วแล้ว เติมน้ำ 4 ลิตร ตั้งไฟให้เดือด แล้วลดเป็นเดือดเบาๆ",
                      "ตักฟองที่ลอยขึ้นมาทิ้งในช่วง 30 นาทีแรก เคี่ยวโดยไม่ปิดฝา 3 ชั่วโมง เติมน้ำถ้าจำเป็นเพื่อให้กระดูกจมน้ำ",
                      "ตักเนื้อสันทรายออกหลัง 1.5 ชั่วโมงเมื่อนุ่ม ปล่อยให้เย็น แล้วหั่นบางตัดขวางเส้นใย เคี่ยวน้ำซุปต่อ",
                      "กรองน้ำซุปผ่านตะแกรงละเอียด ปรุงรสด้วยน้ำปลาและน้ำตาล ชิมรสและปรุงเพิ่มเติม - น้ำซุปควรเค็มกลมกล่อม หวานเล็กน้อย และหอม",
                      "ต้มเส้นก๋วยเตี๋ยวสดตามคำแนะนำบนซอง (ปกติ 1-2 นาทีในน้ำเดือด) พักน้ำและแบ่งใส่ชาม",
                      "โรยเส้นด้วยเนื้อสันทรายสุกหั่นและเนื้อสันในดิบหั่นบาง ตักน้ำซุปร้อนจัดราดลงไป - จะทำให้เนื้อดิบสุก",
                      "เสิร์ฟทันทีพร้อมจานถั่วงอก โหระพาไทย มะนาวหั่น พริกหั่น ซอสหอยซิน และศรีราชา ผู้ทานเติมตามชอบ น้ำซุปควรใส หอม และมีรสชาติลึกซึ้ง"
                  ]
    },
    {
        "id":  "banh_mi",
        "title":  "ขนมปังเวียดนาม (บั๋นหมี่)",
        "prep_time":  "30 นาที",
        "cook_time":  "15 นาที",
        "total_time":  "45 นาที",
        "image":  "assets/images/cuisines/vietnamese/banh_mi.jpg",
        "categories":  [
                           "maincourse"
                       ],
        "ingredients":  [
                            "ขนมปังบาแก็ตต์เวียดนาม 4 แท่ง",
                            "เนื้อสันคอหมูหั่นบาง 400 กรัม",
                            "สำหรับหมัก: ซอสถั่วเหลือง 2 ช้อนโต๊ะ",
                            "น้ำปลา 1 ช้อนโต๊ะ",
                            "กระเทียมสับ 2 กลีบ",
                            "น้ำตาล 1 ช้อนโต๊ะ",
                            "สำหรับผักดอง: แครอทหั่นฝอย 1 ลูก",
                            "หัวไชเท้าหั่นฝอย 1 หัว",
                            "น้ำส้มสายชูข้าว 1/4 ถ้วย",
                            "น้ำตาล 2 ช้อนโต๊ะ",
                            "มายองเนส พาเต้ ผักชีสด",
                            "แตงกวาหั่น พริกฮาลาเปโญหั่น"
                        ],
        "steps":  [
                      "ทำผักดอง: ผสมน้ำส้มสายชูข้าว น้ำตาล และเกลือเล็กน้อยจนน้ำตาลละลาย ใส่แครอทและหัวไชเท้าหั่นฝอย ปล่อยทิ้งไว้อย่างน้อย 30 นาที",
                      "หมักหมู: ผสมซอสถั่วเหลือง น้ำปลา กระเทียมสับ และน้ำตาล ใส่หมูหั่นและหมัก 15 นาที",
                      "ตั้งกระทะไฟแรง ทอดหมูที่หมักไว้ 3-4 นาทีต่อด้าน จนคาราเมลไลซ์และสุกทั่ว",
                      "ผ่าขนมปังบาแก็ตต์ตามยาว ทิ้งด้านหนึ่งติดกัน ปิ้งเบาๆ ถ้าต้องการ",
                      "ทามายองเนสด้านหนึ่งและพาเต้อีกด้าน (ถ้าต้องการแต่เป็นแบบดั้งเดิม)",
                      "เรียงชั้นด้วยหมูสุก ผักดองพักน้ำ แตงกวาหั่น พริกฮาลาเปโญหั่น และผักชีสด",
                      "เสิร์ฟทันที บั๋นหมี่ควรมีเปลือกกรอบ ด้านในนุ่ม และความสมดุลที่สมบูรณ์แบบของรสเค็ม หวาน เปรี้ยว และเผ็ด"
                  ]
    },
    {
        "id":  "spring_rolls",
        "title":  "ปอเปี๊ยะสดเวียดนาม (ก๋อยกวน)",
        "prep_time":  "30 นาที",
        "cook_time":  "10 นาที",
        "total_time":  "40 นาที",
        "image":  "assets/images/cuisines/vietnamese/spring_rolls.jpg",
        "categories":  [
                           "snack_and_appetizers"
                       ],
        "ingredients":  [
                            "แผ่นแป้งข้าว 12 แผ่น",
                            "กุ้งสุกผ่าครึ่งตามยาว 200 กรัม",
                            "เส้นหมี่ข้าวสุก 100 กรัม",
                            "ผักสลัดฉีก 1 ถ้วย",
                            "ใบมิ้นต์สด 1 ถ้วย",
                            "ผักชีสด 1 ถ้วย",
                            "โหระพาไทย 1 ถ้วย",
                            "สำหรับซอสถั่ว: เนยถั่ว 3 ช้อนโต๊ะ",
                            "ซอสหอยซิน 2 ช้อนโต๊ะ",
                            "ซอสถั่วเหลือง 1 ช้อนโต๊ะ",
                            "ศรีราชา 1 ช้อนชา",
                            "น้ำเพื่อเจือจาง"
                        ],
        "steps":  [
                      "ทำซอสถั่ว: ผสมเนยถั่ว ซอสหอยซิน ซอสถั่วเหลือง และศรีราชา เติมน้ำทีละน้อยจนได้ความข้นสำหรับจิ้ม พักไว้",
                      "เตรียมส่วนผสมทั้งหมดและจัดเรียงบนจานเพื่อประกอบง่าย",
                      "เติมน้ำอุ่นในจานตื้นขนาดใหญ่ จุ่มแผ่นแป้งข้าวหนึ่งแผ่น 2-3 วินาที จนเพิ่งนุ่ม (จะนุ่มต่อเอง) วางราบบนพื้นผิวสะอาด",
                      "บนหนึ่งในสามด้านล่างของแผ่น เรียงชั้นผักสลัด เส้นหมี่ มิ้นต์ ผักชี และโหระพา",
                      "พับขอบล่างทับไส้ แล้วพับด้านข้างเข้า วางกุ้งผ่าครึ่ง 2-3 ตัวด้านตัดลงบนหน้า (จะมองเห็นผ่านแผ่น)",
                      "ม้วนแน่นไปด้านบน แผ่นควรโปร่งแสง แสดงส่วนผสมสีสันด้านใน",
                      "ทำซ้ำกับแผ่นและส่วนผสมที่เหลือ เสิร์ฟทันทีพร้อมซอสถั่ว ม้วนควรสด เบา และเต็มไปด้วยสมุนไพร"
                  ]
    },
    {
        "id":  "bun_cha",
        "title":  "บุ๋นจา (หมูย่างกับเส้น)",
        "prep_time":  "30 นาที (บวกหมัก 1 ชั่วโมง)",
        "cook_time":  "15 นาที",
        "total_time":  "45 นาที",
        "image":  "assets/images/cuisines/vietnamese/bun_cha.jpg",
        "categories":  [
                           "noodles",
                           "maincourse"
                       ],
        "ingredients":  [
                            "หมูบด 500 กรัม",
                            "หมูสามชั้นหั่น 300 กรัม",
                            "น้ำปลา 3 ช้อนโต๊ะ",
                            "น้ำตาล 2 ช้อนโต๊ะ",
                            "กระเทียมสับ 3 กลีบ",
                            "หอมแดงสับ 2 หัว",
                            "พริกไทยดำ",
                            "เส้นหมี่ข้าว 400 กรัม",
                            "สำหรับน้ำจิ้ม: น้ำปลา 1/2 ถ้วย",
                            "น้ำตาล 1/2 ถ้วย",
                            "น้ำ 1 ถ้วย",
                            "น้ำมะนาว 2 ช้อนโต๊ะ",
                            "กระเทียมและพริก",
                            "สมุนไพรสด ผักสลัด ผักดอง"
                        ],
        "steps":  [
                      "ผสมหมูบดกับน้ำปลา 2 ช้อนโต๊ะ น้ำตาล 1 ช้อนโต๊ะ กระเทียมสับ หอมแดง และพริกไทยดำ ปั้นเป็นแพตตี้เล็กๆ แช่ตู้เย็น 1 ชั่วโมง",
                      "หมักหมูสามชั้นหั่นด้วยน้ำปลา 1 ช้อนโต๊ะ น้ำตาล 1 ช้อนโต๊ะ และพริกไทยดำ 1 ชั่วโมง",
                      "ทำน้ำจิ้ม: ละลายน้ำตาลในน้ำอุ่น เติมน้ำปลา น้ำมะนาว กระเทียมสับ และพริกหั่น ปรุงรสตามชอบ - ควรหวาน เค็ม เปรี้ยว และเผ็ด",
                      "ย่างแพตตี้หมูและหมูสามชั้นหั่นบนไฟแรง (หรือย่างในเตาอบ) 3-4 นาทีต่อด้าน จนไหม้และคาราเมลไลซ์",
                      "ต้มเส้นหมี่ข้าวตามคำแนะนำบนซอง พักน้ำและล้างน้ำเย็น",
                      "เสิร์ฟในชาม: วางเส้นหมี่ในชามแยก ใส่แพตตี้หมูย่างและหมูสามชั้น เทน้ำจิ้มลงไปหรือเสิร์ฟข้างๆ",
                      "เสิร์ฟพร้อมสมุนไพรสด (มิ้นต์ ผักชี ใบชะพลู) ผักสลัด และผักดอง ผู้ทานผสมทุกอย่างเข้าด้วยกัน จานนี้ควรมีกลิ่นควัน หวาน และสดชื่น"
                  ]
    },
    {
        "id":  "vietnamese_coffee",
        "title":  "กาแฟเย็นเวียดนาม (กาเฟซัวดา)",
        "prep_time":  "5 นาที",
        "cook_time":  "5 นาที",
        "total_time":  "10 นาที",
        "image":  "assets/images/cuisines/vietnamese/vietnamese_coffee.jpg",
        "categories":  [
                           "drink"
                       ],
        "ingredients":  [
                            "กาแฟเวียดนามบด (คั่วเข้ม) 3 ช้อนโต๊ะ",
                            "นมข้นหวาน 2 ช้อนโต๊ะ",
                            "น้ำแข็ง",
                            "น้ำเดือด"
                        ],
        "steps":  [
                      "ใส่นมข้นหวาน 2 ช้อนโต๊ะลงในแก้ว",
                      "วางที่กรองกาแฟเวียดนาม (ฟิน) บนแก้ว ใส่กาแฟบด 3 ช้อนโต๊ะลงในที่กรอง",
                      "กดที่กรองด้านในลงเบาๆ เพื่ออัดกาแฟเล็กน้อย - อย่ากดแน่นเกินไปไม่งั้นน้ำจะหยดไม่ผ่าน",
                      "เทน้ำเดือดเล็กน้อย (ประมาณ 2 ช้อนโต๊ะ) ลงบนกาแฟเพื่อบลูม รอ 30 วินาที",
                      "เติมน้ำเดือดเต็มที่กรอง ปิดฝาและปล่อยให้หยดช้าๆ - ควรใช้เวลา 4-5 นาที การหยดช้าเป็นสิ่งสำคัญสำหรับรสชาติเข้มข้นและเข้มข้น",
                      "เมื่อน้ำหยดหมดแล้ว เอาที่กรองออก คนกาแฟและนมข้นหวานเข้าด้วยกันให้ดี",
                      "เติมน้ำแข็งในแก้วแยก เทส่วนผสมกาแฟลงบนน้ำแข็ง",
                      "เสิร์ฟทันที กาแฟเย็นเวียดนามควรเข้มข้น หวาน และนุ่มนวลอย่างเหลือเชื่อพร้อมสีคาราเมลสวยงาม"
                  ]
    }
]
